[
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Rafael_Belloso_Chacin_University'的节点\nlabel为organisation,属性name='University_of_Florida_Alumni_Association'的节点\nlabel为organisation,属性name='ACSI_College-Iloilo'的节点\nlabel为tag,属性name='Francis_I_of_France'的节点\nlabel为tag,属性name='Federico_Fellini'的节点\nlabel为tag,属性name='Fabio_Fognini'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Ali的人认识的名为Francisco的人的生日、性别、Francisco的姓氏、Francisco的创建日期、Francisco的IP地址、Francisco使用的浏览器、关系的创建日期、Ali的语言、Ali的邮箱、Ali的创建日期、Ali的ID、Francisco的语言、Francisco的IP地址。",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n2.firstname='Francisco' and n1.firstname='Ali' return n2.birthday, n2.gender, n1.language, n1.email, n2.lastname, n1.creationdate, n2.locationip, n2.browserused, r1.creationdate, n2.creationdate, n1.id, n2.language, n1.locationip"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='William_Carey_University'的节点\nlabel为organisation,属性name='American_University_in_Cairo'的节点\nlabel为organisation,属性name='ACSI_College-Iloilo'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为tag,属性name='Andrew_Cole'的节点\nlabel为tag,属性name='Adam_Carolla'的节点\nlabel为tag,属性name='Agustín_Calleri'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Ali的人认识的名为Carlo的人的信息，包括Carlo的语言、IP地址、创建日期、最后名、性别、生日、电子邮件、浏览器使用情况，以及Ali的IP地址、创建日期、最后名、性别、生日、电子邮件、浏览器使用情况，还有他们关系的创建日期。",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n2.firstname='Carlo' and n1.firstname='Ali' return n2.language, n2.locationip, n1.locationip, n1.creationdate, r1.creationdate, n1.lastname, n2.gender, n1.birthday, n2.creationdate, n1.language, n2.birthday, n2.email, n1.browserused, n2.browserused, n1.gender, n1.firstname, n1.email, n2.id, n2.firstname, n2.lastname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为organisation,属性name='Petre_Andrei_University_of_Iaşi'的节点\nlabel为organisation,属性name='Paul_Sabatier_University'的节点\nlabel为organisation,属性name='Azim_Premji_University'的节点\nlabel为tag,属性name='Andrei_Pavel'的节点\nlabel为tag,属性name='Tom_Pillibi'的节点\nlabel为tag,属性name='Hyder_Ali'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Ali的人认识的名为Peter的人，返回Ali的邮箱、id、使用的浏览器、Peter的id、他们关系的创建日期、Ali的性别以及Peter的创建日期，仅返回一条结果。",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n2.firstname='Peter' and n1.firstname='Ali' return n1.email, n1.id, n1.browserused, n2.id, r1.creationdate, n1.gender, n2.creationdate limit 1"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为organisation,属性name='ACSI_College-Iloilo'的节点\nlabel为organisation,属性name='Aliah_University'的节点\nlabel为organisation,属性name='Azim_Premji_University'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为tag,属性name='Muhammad_Ali'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\nlabel为tag,属性name='Zine_El_Abidine_Ben_Ali'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Ali的人认识的人的邮箱地址",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n1.firstname='Ali' return n2.email"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='DG_Vaishnav_College'的节点\nlabel为organisation,属性name='Gabriel_Dumont_Institute'的节点\nlabel为tag,属性name='Find_Out_Who_Your_Friends_Are'的节点\nlabel为tag,属性name='Steve_Davis'的节点\nlabel为tag,属性name='David_Weber'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找David的好友的性别、使用的浏览器，以及这些好友的位置IP和电子邮件",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n2.firstname='David' return n2.gender, n2.browserused, n1.locationip, n1.email"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Aliah_University'的节点\nlabel为organisation,属性name='Altai_State_University'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\nlabel为tag,属性name='Muhammad_Ali'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Ali的人认识的人的详细信息，包括他们的语言、电子邮件、生日、名字、浏览器、性别、位置IP，以及Ali的位置IP、ID、关系的创建日期、性别、语言、姓氏和电子邮件，限制返回14条结果。",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n1.firstname='Ali' return n2.language, n2.email, n2.birthday, n2.firstname, n2.browserused, n2.gender, n1.locationip, n1.id, r1.creationdate, n1.gender, n1.language, n2.lastname, n1.email, n2.locationip limit 14"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Al-Ahliyya_Amman_University'的节点\nlabel为organisation,属性name='Al_Akhawayn_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Hyder_Ali'的节点\nlabel为tag,属性name='Alan_Alda'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Ali的人认识的名为Anh的人的性别、IP地址、id、生日、使用的语言、创建日期、浏览器、姓氏以及他们之间的关系创建日期。同时返回Ali的性别、创建日期、使用的浏览器、姓氏、名字、id和使用的语言。",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n2.firstname='Anh' and n1.firstname='Ali' return n2.gender, n2.locationip, n2.id, n1.birthday, n2.language, n1.id, n1.gender, n2.creationdate, n1.browserused, n1.lastname, n1.creationdate, n2.browserused, n1.firstname, r1.creationdate, n1.language, n2.lastname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为forum,属性title='Group for Alicia_Keys in Jalpaiguri'的节点\nlabel为organisation,属性name='Aliah_University'的节点\nlabel为organisation,属性name='Arturo_Michelena_University'的节点\nlabel为organisation,属性name='Santa_Isabel_College,_Manila'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为tag,属性name='Alyssa_Milano'的节点\nlabel为tag,属性name='Muhammad_Ali'的节点\nlabel为tag,属性name='Alicia_Molik'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Ali的人知道的名为Maria的人的邮箱，以及Ali的位置IP地址",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n2.firstname='Maria' and n1.firstname='Ali' return n1.locationip, n2.email"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='José_Rizal_University'的节点\nlabel为organisation,属性name='Felix_Airways'的节点\nlabel为organisation,属性name='Fatih_University'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\nlabel为tag,属性name='Hyder_Ali'的节点\nlabel为tag,属性name='Muhammad_ibn_Zakariya_al-Razi'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Ali的人和名为Fritz的人之间的关系，返回Ali的生日、Fritz的名、关系的创建日期、Ali的名、位置IP、ID、语言、浏览器使用情况、Fritz的性别、Ali的性别、Fritz的姓、Fritz的浏览器使用情况、Ali的创建日期、Fritz的位置IP。",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n1.firstname='Ali' and n2.firstname='Fritz' return n1.birthday, n2.firstname, r1.creationdate, n1.firstname, n1.locationip, n1.id, n1.language, n1.browserused, n2.gender, n1.gender, n2.lastname, n2.browserused, n1.creationdate, n2.locationip"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Wall of Emperor of Brazil Nascimento'的节点\nlabel为forum,属性title='Album 1 of Emperor of Brazil Souza'的节点\nlabel为forum,属性title='Album 24 of Emperor of Brazil Dom Pedro II'的节点\nlabel为organisation,属性name='Sergio_Arboleda_University'的节点\nlabel为organisation,属性name='Rafael_Belloso_Chacin_University'的节点\nlabel为organisation,属性name='Simón_Bolívar_University'的节点\nlabel为place,属性name='Presidencia_Roque_Sáenz_Peña'的节点\nlabel为place,属性name='Pedro_Escobedo'的节点\nlabel为place,属性name='Antón_Lizardo'的节点\nlabel为tag,属性name='Pedro_I_of_Brazil'的节点\nlabel为tag,属性name='John_VI_of_Portugal'的节点\nlabel为tag,属性name='Manuel_I_of_Portugal'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Emperor of Brazil的人喜欢的帖子的信息，包括该人的名字、邮箱、创建日期、语言、ID、位置IP、生日、性别、姓氏，以及帖子的长度、位置IP、内容、语言、创建日期、使用的浏览器，还有喜欢关系的创建日期。",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='Emperor of Brazil' return n1.firstname, n2.length, n2.locationip, n1.email, n2.id, n1.creationdate, n1.language, n1.id, n1.locationip, n2.content, n1.birthday, n2.language, n1.gender, n2.creationdate, r1.creationdate, n1.lastname, n2.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 5 of Emperor of Brazil Machado'的节点\nlabel为forum,属性title='Album 5 of Emperor of Brazil Souza'的节点\nlabel为forum,属性title='Album 5 of Emperor of Brazil Dom Pedro II'的节点\nlabel为organisation,属性name='Simón_Bolívar_University'的节点\nlabel为organisation,属性name='Rafael_Belloso_Chacin_University'的节点\nlabel为organisation,属性name='Sergio_Arboleda_University'的节点\nlabel为place,属性name='Presidencia_Roque_Sáenz_Peña'的节点\nlabel为place,属性name='Pedro_Escobedo'的节点\nlabel为place,属性name='Antón_Lizardo'的节点\nlabel为tag,属性name='Pedro_I_of_Brazil'的节点\nlabel为tag,属性name='John_VI_of_Portugal'的节点\nlabel为tag,属性name='John_V_of_Portugal'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Emperor of Brazil的人喜欢的帖子的详细信息，包括该人的姓氏、喜欢的时间、语言、帖子长度、生日、性别、帖子创建时间、内容、ID、语言、图片文件和邮箱，限制返回5条结果。",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='Emperor of Brazil' return n1.lastname, r1.creationdate, n1.language, n2.length, n1.birthday, n1.gender, n2.creationdate, n1.firstname, n2.content, n1.id, n2.language, n2.imagefile, n1.email limit 5"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Seirei_Christopher_University'的节点\nlabel为organisation,属性name='William_Carey_University'的节点\nlabel为organisation,属性name='Patricia_Stevens_College'的节点\nlabel为tag,属性name='Chris_Sabin'的节点\nlabel为tag,属性name='Chris_Cornell'的节点\nlabel为tag,属性name='Chris_Claremont'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Chris的人喜欢的帖子的内容、使用的浏览器、Chris的邮箱、名字、姓氏、帖子的id、创建日期、Chris的语言、使用的浏览器、帖子的图片文件、Chris的创建日期、位置IP、Chris的id和性别",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='Chris' return n2.content, n2.browserused, n1.email, n1.firstname, n1.lastname, n2.id, n2.creationdate, n1.language, n1.browserused, n2.imagefile, n1.creationdate, n1.locationip, n1.id, n1.gender"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='KIMEP_University'的节点\nlabel为organisation,属性name='KMC_International_Center'的节点\nlabel为organisation,属性name='KPC_Medical_College_and_Hospital'的节点\nlabel为tag,属性name='Get_The_Knack'的节点\nlabel为tag,属性name='James_K._Polk'的节点\nlabel为tag,属性name='Keith_David'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为K.的人的IP位置、名字和电子邮件，并限制返回结果为15条",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='K.' return n1.locationip, n1.firstname, n1.email limit 15"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Wall of Emperor of Brazil Nascimento'的节点\nlabel为forum,属性title='Album 1 of Emperor of Brazil Machado'的节点\nlabel为forum,属性title='Album 27 of Emperor of Brazil Dom Pedro II'的节点\nlabel为organisation,属性name='Sergio_Arboleda_University'的节点\nlabel为organisation,属性name='Rafael_Belloso_Chacin_University'的节点\nlabel为organisation,属性name='Simón_Bolívar_University'的节点\nlabel为place,属性name='Presidencia_Roque_Sáenz_Peña'的节点\nlabel为place,属性name='Pedro_Escobedo'的节点\nlabel为place,属性name='Antón_Lizardo'的节点\nlabel为tag,属性name='Pedro_I_of_Brazil'的节点\nlabel为tag,属性name='John_VI_of_Portugal'的节点\nlabel为tag,属性name='Manuel_I_of_Portugal'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Emperor of Brazil的人喜欢的帖子的信息，包括帖子的语言、浏览器、IP地址、id、内容、图片文件、长度，以及该人的语言、id、创建日期、IP地址、浏览器、性别、名字、姓氏、生日，还有喜欢操作的创建日期。",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='Emperor of Brazil' return n2.language, n2.browserused, n2.locationip, n2.id, n2.content, n1.language, n1.id, n1.creationdate, n2.imagefile, n1.lastname, r1.creationdate, n1.locationip, n2.length, n1.browserused, n1.gender, n1.firstname, n1.birthday"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='William_Carey_University'的节点\nlabel为organisation,属性name='Seirei_Christopher_University'的节点\nlabel为tag,属性name='Chris_Sabin'的节点\nlabel为tag,属性name='Jamie_Lee_Curtis'的节点\nlabel为tag,属性name='Charles_Stross'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Chris的人喜欢的帖子的内容、长度、创建日期、图片文件，以及Chris的浏览器使用情况、位置IP、生日、语言、ID、姓氏、性别、创建日期、电子邮件，还有喜欢关系的创建日期。",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='Chris' return n1.browserused, n2.content, n1.locationip, n2.id, n1.birthday, n1.language, r1.creationdate, n1.firstname, n2.imagefile, n2.length, n1.id, n1.lastname, n1.gender, n1.creationdate, n1.email, n2.creationdate, n2.language, n2.locationip"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 1 of Emperor of Brazil Machado'的节点\nlabel为organisation,属性name='Sergio_Arboleda_University'的节点\nlabel为organisation,属性name='Adolfo_Ibáñez_University'的节点\nlabel为organisation,属性name='Rafael_Belloso_Chacin_University'的节点\nlabel为place,属性name='Antón_Lizardo'的节点\nlabel为place,属性name='Pedro_Escobedo'的节点\nlabel为place,属性name='Presidencia_Roque_Sáenz_Peña'的节点\nlabel为tag,属性name='Pedro_I_of_Brazil'的节点\nlabel为tag,属性name='John_VI_of_Portugal'的节点\nlabel为tag,属性name='Manuel_I_of_Portugal'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Emperor of Brazil的人喜欢的帖子的内容、他的名字、浏览器使用情况、帖子的语言、帖子的id、帖子使用的浏览器以及帖子的创建日期，同时返回该人的id。",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='Emperor of Brazil' return n2.content, n1.firstname, n1.browserused, n2.language, n2.id, n2.browserused, n2.creationdate, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='William_Carey_University'的节点\nlabel为organisation,属性name='Seirei_Christopher_University'的节点\nlabel为organisation,属性name='Charles_Sturt_University_Study_Centres'的节点\nlabel为tag,属性name='Jamie_Lee_Curtis'的节点\nlabel为tag,属性name='Chris_Sabin'的节点\nlabel为tag,属性name='John_Conyers'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Chris的人喜欢的帖子的内容、Chris使用的浏览器、Chris的名字、帖子的语言以及他们的id，最多返回19条结果",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='Chris' return n2.content, n1.browserused, n1.firstname, n2.language, n1.id, n2.id limit 19"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='K_L_University'的节点\nlabel为organisation,属性name='Keen_College'的节点\nlabel为organisation,属性name='Jinnah_University_for_Women'的节点\nlabel为tag,属性name='My_Kinda_Party'的节点\nlabel为tag,属性name='Kevin_Rudd'的节点\nlabel为tag,属性name='Ken_Schrader'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为K.的人喜欢的帖子的内容、创建日期、K.使用的浏览器、性别以及帖子的id",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='K.' return n2.content, n2.creationdate, n1.browserused, n1.gender, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Korea_Science_Academy_of_KAIST'的节点\nlabel为organisation,属性name='Korea_University_College_of_Science'的节点\nlabel为organisation,属性name='K_L_University'的节点\nlabel为tag,属性name='Philip_K._Dick'的节点\nlabel为tag,属性name='Kim_Wilde'的节点\nlabel为tag,属性name='James_K._Polk'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为K.的人及其喜欢的帖子的详细信息，包括人的名字、性别、帖子的语言、人的创建日期、生日、帖子的长度、人的ID、语言、喜欢关系的创建日期、人的IP地址、邮箱、姓氏、帖子的IP地址、图片文件、浏览器使用情况、帖子的内容和ID。",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='K.' return n1.firstname, n1.gender, n2.language, n1.creationdate, n1.birthday, n2.length, n1.id, n1.language, r1.creationdate, n1.locationip, n1.email, n1.lastname, n2.locationip, n2.imagefile, n1.browserused, n2.browserused, n2.content, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 17 of Emperor of Brazil Machado'的节点\nlabel为forum,属性title='Album 17 of Emperor of Brazil Dom Pedro II'的节点\nlabel为forum,属性title='Album 19 of Emperor of Brazil Machado'的节点\nlabel为organisation,属性name='Sergio_Arboleda_University'的节点\nlabel为organisation,属性name='Rafael_Belloso_Chacin_University'的节点\nlabel为organisation,属性name='Adolfo_Ibáñez_University'的节点\nlabel为place,属性name='Pedro_Escobedo'的节点\nlabel为place,属性name='Antón_Lizardo'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为tag,属性name='Pedro_I_of_Brazil'的节点\nlabel为tag,属性name='John_VI_of_Portugal'的节点\nlabel为tag,属性name='John_V_of_Portugal'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Emperor of Brazil的人喜欢的帖子的IP位置、该人的姓氏、性别、浏览器使用情况以及帖子的内容长度，跳过前10条记录，返回接下来的17条记录",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='Emperor of Brazil' return n2.locationip, n1.lastname, n1.gender, n1.browserused, n2.length skip 10 limit 17"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Gachongil_College'的节点\nlabel为organisation,属性name='Georgia_State_University'的节点\nlabel为organisation,属性name='Gandhi_Medical_College'的节点\nlabel为tag,属性name='Maxim_Gorky'的节点\nlabel为tag,属性name='Roger_Glover'的节点\nlabel为tag,属性name='Richard_Gere'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Grigore的人喜欢的帖子的信息，包括该人的姓氏、浏览器使用情况、电子邮件、id、语言、位置IP、性别、生日、创建日期，以及帖子的语言、内容、创建日期、位置IP、长度、id、浏览器使用情况，同时返回喜欢关系的创建日期，限制结果数量为16条。",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='Grigore' return n1.lastname, n1.browserused, n1.email, n1.id, n2.language, n1.locationip, n2.browserused, n1.gender, n2.content, n2.creationdate, n2.locationip, n2.length, n2.id, n1.language, r1.creationdate, n1.firstname, n1.creationdate, n1.birthday limit 16"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Sergio_Arboleda_University'的节点\nlabel为organisation,属性name='Rafael_Belloso_Chacin_University'的节点\nlabel为organisation,属性name='Simón_Bolívar_University'的节点\nlabel为place,属性name='Antón_Lizardo'的节点\nlabel为place,属性name='Pedro_Escobedo'的节点\nlabel为tag,属性name='Pedro_I_of_Brazil'的节点\nlabel为tag,属性name='John_VI_of_Portugal'的节点\nlabel为tag,属性name='Manuel_I_of_Portugal'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Emperor of Brazil的人喜欢的帖子的内容、该人的浏览器使用情况、帖子的id、该人的IP地址、姓氏、电子邮件、id、性别、帖子的创建日期、长度、IP地址、生日、创建日期和语言信息，以及喜欢行为的创建日期。",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='Emperor of Brazil' return n2.content, n1.browserused, n2.id, n1.locationip, n1.lastname, n1.email, n1.id, n1.gender, n2.creationdate, n1.firstname, r1.creationdate, n2.length, n2.locationip, n1.birthday, n1.creationdate, n1.language"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Wall of Emperor of Brazil Nascimento'的节点\nlabel为forum,属性title='Album 1 of Emperor of Brazil Machado'的节点\nlabel为organisation,属性name='Sergio_Arboleda_University'的节点\nlabel为organisation,属性name='Rafael_Belloso_Chacin_University'的节点\nlabel为organisation,属性name='Simón_Bolívar_University'的节点\nlabel为place,属性name='Presidencia_Roque_Sáenz_Peña'的节点\nlabel为place,属性name='Pedro_Escobedo'的节点\nlabel为tag,属性name='Pedro_I_of_Brazil'的节点\nlabel为tag,属性name='John_VI_of_Portugal'的节点\nlabel为tag,属性name='Manuel_I_of_Portugal'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Emperor of Brazil的人所喜欢的帖子的信息，包括该人的浏览器使用情况、性别、id、生日、姓氏、名字、创建日期、语言、位置IP，以及帖子的创建日期、图片文件、内容、长度、浏览器使用情况、位置IP，还有喜欢行为的创建日期。",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='Emperor of Brazil' return n1.browserused, n1.gender, n1.id, n2.creationdate, n1.birthday, n1.lastname, n1.firstname, n2.imagefile, n2.content, n1.locationip, n2.length, n2.browserused, n1.creationdate, r1.creationdate, n1.language, n2.locationip"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Seirei_Christopher_University'的节点\nlabel为organisation,属性name='William_Carey_University'的节点\nlabel为organisation,属性name='Patricia_Stevens_College'的节点\nlabel为tag,属性name='Chris_Sabin'的节点\nlabel为tag,属性name='Jamie_Lee_Curtis'的节点\nlabel为tag,属性name='Cheri,_Cheri_Lady'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Chris的人喜欢的帖子的id、使用的浏览器、图片文件以及Chris的电子邮件地址",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='Chris' return n1.id, n2.browserused, n2.imagefile, n1.email"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for John_Edward_Gray in Loikaw'的节点\nlabel为organisation,属性name='Gachongil_College'的节点\nlabel为organisation,属性name='Gifu_Women's_University'的节点\nlabel为organisation,属性name='Grooveshark_University'的节点\nlabel为place,属性name='Jagüey_Grande'的节点\nlabel为tag,属性name='Maxim_Gorky'的节点\nlabel为tag,属性name='Live_at_the_Gorge_05/06'的节点\nlabel为tag,属性name='I_Got_Id'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Grigore的人喜欢的帖子的信息，包括Grigore的性别、id、创建日期、浏览器使用情况、位置IP、电子邮件，以及帖子的语言、图片文件、id、内容、浏览器使用情况、长度，限制返回19条结果",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='Grigore' return n1.gender, n1.id, n2.language, n2.imagefile, n2.id, n2.content, n1.creationdate, n2.locationip, n1.browserused, n1.email, n2.browserused, n2.length, n1.locationip, n1.firstname limit 19"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Sergio_Arboleda_University'的节点\nlabel为organisation,属性name='Andres_Soriano_College'的节点\nlabel为organisation,属性name='Andrés_Bello_University'的节点\nlabel为tag,属性name='Fernando_Alonso'的节点\nlabel为tag,属性name='Phil_Esposito'的节点\nlabel为tag,属性name='Alex_Ferguson'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Alfonso的人喜欢的帖子的点赞时间、他的语言、帖子的创建时间、他的性别、姓氏、位置IP、帖子的长度、他使用的浏览器以及帖子的内容",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='Alfonso' return r1.creationdate, n1.language, n2.creationdate, n1.gender, n1.lastname, n1.locationip, n2.length, n1.browserused, n2.content"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='James_Cook_University'的节点\nlabel为organisation,属性name='Jackson_School_of_Geosciences'的节点\nlabel为organisation,属性name='Jackson_Junior_High_School'的节点\nlabel为tag,属性name='John_Gay'的节点\nlabel为tag,属性name='My_Jamaican_Guy'的节点\nlabel为tag,属性name='James_Joyce'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Jorge的人喜欢的帖子的详细信息，包括Jorge的姓名、创建日期、IP地址、姓氏、浏览器使用情况、生日、邮箱、语言，以及帖子的长度、ID、创建日期、浏览器使用情况和图片文件。同时返回喜欢关系的创建日期。",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='Jorge' return n1.firstname, n2.length, n1.creationdate, n2.id, n1.locationip, n1.lastname, r1.creationdate, n1.browserused, n2.browserused, n2.creationdate, n1.id, n1.birthday, n2.imagefile, n1.email, n1.language"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='William_Carey_University'的节点\nlabel为organisation,属性name='Seirei_Christopher_University'的节点\nlabel为organisation,属性name='Mississippi_University_for_Women'的节点\nlabel为tag,属性name='Chris_Sabin'的节点\nlabel为tag,属性name='Jamie_Lee_Curtis'的节点\nlabel为tag,属性name='I_Want_Your_Sex'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Chris的人喜欢的帖子的性别、帖子id、姓氏、使用的浏览器、创建日期、IP地址、长度和图片文件，最多返回8条结果",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='Chris' return n1.gender, n2.id, n1.lastname, n2.browserused, n2.creationdate, n2.locationip, n2.length, n2.imagefile limit 8"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Wall of Emperor of Brazil Nascimento'的节点\nlabel为forum,属性title='Album 24 of Emperor of Brazil Dom Pedro II'的节点\nlabel为forum,属性title='Album 29 of Emperor of Brazil Dom Pedro II'的节点\nlabel为organisation,属性name='Sergio_Arboleda_University'的节点\nlabel为organisation,属性name='Rafael_Belloso_Chacin_University'的节点\nlabel为organisation,属性name='Brazilian_Naval_School'的节点\nlabel为person,属性firstname='Emperor of Brazil'的节点\nlabel为person,属性firstname='Emperor of Brazil'的节点\nlabel为person,属性firstname='Emperor of Brazil'的节点\nlabel为place,属性name='Pedro_Escobedo'的节点\nlabel为place,属性name='Presidencia_Roque_Sáenz_Peña'的节点\nlabel为place,属性name='Antón_Lizardo'的节点\nlabel为tag,属性name='Pedro_I_of_Brazil'的节点\nlabel为tag,属性name='John_VI_of_Portugal'的节点\nlabel为tag,属性name='Afonso_I_of_Portugal'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Emperor of Brazil的人的生日和创建日期，这个人喜欢了某个帖子",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='Emperor of Brazil' return n1.birthday, n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Seirei_Christopher_University'的节点\nlabel为organisation,属性name='William_Carey_University'的节点\nlabel为organisation,属性name='Patricia_Stevens_College'的节点\nlabel为tag,属性name='Chris_Sabin'的节点\nlabel为tag,属性name='Jamie_Lee_Curtis'的节点\nlabel为tag,属性name='Chris_Evert'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Chris的人喜欢的帖子的创建日期、Chris的邮箱、姓氏、生日、性别、位置IP、浏览器使用情况、语言，以及帖子的id、内容、位置IP、语言，限制返回17条结果",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='Chris' return n2.creationdate, n1.email, n1.lastname, n2.id, n1.firstname, n1.birthday, r1.creationdate, n2.content, n1.gender, n1.locationip, n1.browserused, n2.locationip, n2.language, n1.language limit 17"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Gachongil_College'的节点\nlabel为organisation,属性name='Ghislieri_College'的节点\nlabel为organisation,属性name='Georgia_Tech_Alumni_Association'的节点\nlabel为place,属性name='Jagüey_Grande'的节点\nlabel为tag,属性name='Live_at_the_Gorge_05/06'的节点\nlabel为tag,属性name='Like_Glue'的节点\nlabel为tag,属性name='Frederico_Gil'的节点\nlabel为tagclass,属性name='GridironFootballPlayer'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Grigore喜欢的帖子的信息，包括Grigore使用的浏览器、他的名字、帖子使用的浏览器、Grigore的生日、帖子的创建日期以及Grigore的创建日期",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='Grigore' return n1.browserused, n1.firstname, n2.browserused, n1.birthday, n2.creationdate, n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='K_L_University'的节点\nlabel为organisation,属性name='Jinnah_University_for_Women'的节点\nlabel为organisation,属性name='Korea_Science_Academy_of_KAIST'的节点\nlabel为tag,属性name='Profiles'的节点\nlabel为tag,属性name='Philip_K._Dick'的节点\nlabel为tag,属性name='My_Kinda_Party'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为K.的人喜欢的帖子的IP位置、内容、创建日期、帖子ID、浏览器使用情况、帖子的语言、帖子长度、人的创建日期、性别、生日、关系创建日期、人的ID和姓氏",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='K.' return n2.locationip, n2.content, n1.creationdate, n2.id, n1.browserused, n1.firstname, n2.browserused, n2.language, n2.length, n1.language, n1.gender, n1.birthday, r1.creationdate, n1.id, n1.lastname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Seirei_Christopher_University'的节点\nlabel为organisation,属性name='William_Carey_University'的节点\nlabel为organisation,属性name='San_Carlos_Seminary'的节点\nlabel为tag,属性name='Jamie_Lee_Curtis'的节点\nlabel为tag,属性name='John_Cleese'的节点\nlabel为tag,属性name='Chris_Sabin'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Chris的人喜欢的帖子的创建日期、Chris的创建日期、帖子的图片文件以及Chris的语言，限制返回6条结果",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='Chris' return r1.creationdate, n1.creationdate, n2.imagefile, n1.language limit 6"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Korea_University_College_of_Science'的节点\nlabel为organisation,属性name='KPC_Medical_College_and_Hospital'的节点\nlabel为organisation,属性name='Korea_Science_Academy_of_KAIST'的节点\nlabel为tag,属性name='Philip_K._Dick'的节点\nlabel为tag,属性name='James_K._Polk'的节点\nlabel为tag,属性name='Kim_Wilde'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为K.的人喜欢的帖子的详细信息，包括帖子的位置IP、内容、创建日期、语言、长度、图片文件、浏览器使用情况，以及该人的创建日期、浏览器使用情况、位置IP、生日、名字、性别、姓氏、邮箱、语言和ID，限制返回11条记录。",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='K.' return n2.locationip, n2.content, n2.creationdate, n2.language, n1.creationdate, n1.browserused, n2.length, n1.birthday, n1.firstname, n1.gender, n1.lastname, n1.email, n1.language, n1.id, n2.imagefile, n2.browserused, n1.locationip, r1.creationdate limit 11"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Wall of Emperor of Brazil Nascimento'的节点\nlabel为forum,属性title='Album 27 of Emperor of Brazil Dom Pedro II'的节点\nlabel为forum,属性title='Album 1 of Emperor of Brazil Machado'的节点\nlabel为organisation,属性name='Sergio_Arboleda_University'的节点\nlabel为organisation,属性name='Rafael_Belloso_Chacin_University'的节点\nlabel为organisation,属性name='Simón_Bolívar_University'的节点\nlabel为place,属性name='Presidencia_Roque_Sáenz_Peña'的节点\nlabel为place,属性name='Pedro_Escobedo'的节点\nlabel为place,属性name='Antón_Lizardo'的节点\nlabel为tag,属性name='Pedro_I_of_Brazil'的节点\nlabel为tag,属性name='John_VI_of_Portugal'的节点\nlabel为tag,属性name='Manuel_I_of_Portugal'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Emperor of Brazil的人喜欢的帖子的信息，包括该人的生日、姓名、性别、创建日期、使用的浏览器和id，以及帖子的位置IP、图片文件、语言和使用的浏览器。",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='Emperor of Brazil' return n1.birthday, n2.locationip, n1.lastname, n2.id, n2.imagefile, n1.browserused, n1.creationdate, n1.firstname, n1.gender, n2.language, n1.id, n2.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Seirei_Christopher_University'的节点\nlabel为organisation,属性name='William_Carey_University'的节点\nlabel为tag,属性name='Chris_Sabin'的节点\nlabel为tag,属性name='Profiles'的节点\nlabel为tag,属性name='Jamie_Lee_Curtis'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Chris的人喜欢的帖子的内容、浏览器使用情况、帖子的语言、图片文件、长度以及Chris的浏览器使用情况、id和创建日期",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='Chris' return n1.browserused, n2.content, n1.id, n1.creationdate, n2.language, n2.imagefile, n1.firstname, n2.length, n2.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Gachongil_College'的节点\nlabel为organisation,属性name='Ghislieri_College'的节点\nlabel为organisation,属性name='Pontifical_Gregorian_University'的节点\nlabel为place,属性name='Jagüey_Grande'的节点\nlabel为tag,属性name='Live_at_the_Gorge_05/06'的节点\nlabel为tag,属性name='Richard_Gere'的节点\nlabel为tag,属性name='Frederico_Gil'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Grigore的人喜欢的帖子的详细信息，包括Grigore的生日、姓氏，以及帖子的图片文件、内容、创建日期、长度和IP地址。同时返回帖子的ID和Grigore的创建日期。",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='Grigore' return n1.birthday, n1.lastname, n2.imagefile, n2.content, n1.creationdate, n2.creationdate, n2.id, n2.length, n2.locationip"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='K_L_University'的节点\nlabel为organisation,属性name='KPC_Medical_College_and_Hospital'的节点\nlabel为organisation,属性name='Jinnah_University_for_Women'的节点\nlabel为tag,属性name='James_K._Polk'的节点\nlabel为tag,属性name='Philip_K._Dick'的节点\nlabel为tag,属性name='Ken_Schrader'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为K.的人喜欢的帖子的信息，包括帖子使用的浏览器、语言、长度、创建日期、内容、位置IP，以及该人的使用的浏览器、姓氏、ID、创建日期、电子邮件、性别、生日和位置IP，限制返回12条记录。",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='K.' return n2.browserused, n2.language, n2.length, n1.browserused, n2.creationdate, n2.content, n1.firstname, n2.locationip, r1.creationdate, n1.lastname, n1.id, n1.creationdate, n1.email, n2.id, n1.gender, n1.locationip, n1.birthday limit 12"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Andres_Soriano_College'的节点\nlabel为organisation,属性name='Andrés_Bello_University'的节点\nlabel为organisation,属性name='Sergio_Arboleda_University'的节点\nlabel为tag,属性name='Fernando_Alonso'的节点\nlabel为tag,属性name='Doremi_Fasol_Latido'的节点\nlabel为tag,属性name='Phil_Esposito'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Alfonso的人喜欢的帖子的喜欢时间及帖子的创建时间",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='Alfonso' return r1.creationdate, n2.creationdate"
    }
]