[
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 2 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 1 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 2 of Hassan Forouhar'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Islamic_Courts_Union'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 2 of Hossein Forouhar包含的帖子的IP地址、id、论坛的id和标题、帖子的语言、使用的浏览器、图片文件、创建日期和长度",
        "output": "match (n1:forum)-[r1:containerOf]->(n2:post)  where n1.title='Album 2 of Hossein Forouhar' return n2.locationip, n2.id, n1.id, n1.title, n2.language, n2.browserused, n2.imagefile, n2.creationdate, n2.length"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 2 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 2 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 22 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='The_Photo_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 2 of Hossein Forouhar的创建日期及其包含的帖子的创建日期、图片文件、浏览器使用情况和长度",
        "output": "match (n1:forum)-[r1:containerOf]->(n2:post)  where n1.title='Album 2 of Hossein Forouhar' return n1.creationdate, n2.creationdate, n2.imagefile, n2.browserused, n2.length"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 2 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 2 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 32 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='The_Help_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 2 of Hossein Forouhar包含的帖子的内容、创建日期、语言和长度，同时返回该论坛的创建日期",
        "output": "match (n1:forum)-[r1:containerOf]->(n2:post)  where n1.title='Album 2 of Hossein Forouhar' return n2.content, n2.creationdate, n2.language, n2.length, n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 2 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 2 of Amjad Islam Ahsan'的节点\nlabel为forum,属性title='Album 2 of Hassan Forouhar'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Sindh_Madrasatul_Islam'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Fatehgarh_Sahib'的节点\nlabel为place,属性name='Jiaganj_Azimganj'的节点\nlabel为tag,属性name='Abdullah_II_of_Jordan'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='Adil_Shahi_dynasty'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 2 of Hossein Forouhar包含的帖子的id",
        "output": "match (n1:forum)-[r1:containerOf]->(n2:post)  where n1.title='Album 2 of Hossein Forouhar' return n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 2 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 2 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 1 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Islamic_Courts_Union'的节点\nlabel为tag,属性name='Abdullah_II_of_Jordan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 2 of Hossein Forouhar包含的帖子的id、论坛的创建日期、帖子使用的浏览器、关系的创建日期、帖子的位置IP、论坛的标题、帖子的创建日期、帖子的长度、图片文件、内容、语言以及论坛的id",
        "output": "match (n1:forum)-[r1:containerOf]->(n2:post)  where n1.title='Album 2 of Hossein Forouhar' return n2.id, n1.creationdate, n2.browserused, r1.creationdate, n2.locationip, n1.title, n2.creationdate, n2.length, n2.imagefile, n2.content, n2.language, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 3 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 33 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 13 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Fatehgarh_Sahib'的节点\nlabel为place,属性name='Jiaganj_Azimganj'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Muhammad_Ali_of_Egypt'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 3 of Hossein Forouhar包含的帖子的创建日期、位置IP、长度和ID",
        "output": "match (n1:forum)-[r1:containerOf]->(n2:post)  where n1.title='Album 3 of Hossein Forouhar' return n2.creationdate, n2.locationip, n2.length, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 3 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 3 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 33 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 3 of Hossein Forouhar包含的帖子的浏览器使用情况、论坛标题、帖子创建日期和论坛id",
        "output": "match (n1:forum)-[r1:containerOf]->(n2:post)  where n1.title='Album 3 of Hossein Forouhar' return n2.browserused, n1.title, n2.creationdate, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 3 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 3 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 23 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Islamic_Courts_Union'的节点\nlabel为tag,属性name='Mohammed_Zahir_Shah'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 3 of Hossein Forouhar包含的帖子的标题、关系的创建日期、帖子的IP地址、长度、id和使用的浏览器",
        "output": "match (n1:forum)-[r1:containerOf]->(n2:post)  where n1.title='Album 3 of Hossein Forouhar' return n1.title, r1.creationdate, n2.locationip, n2.length, n2.id, n2.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 3 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 3 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 33 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='New_Muslim_Town'的节点\nlabel为place,属性name='Ramadan_City'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\nlabel为tag,属性name='Mohammed_Zahir_Shah'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 3 of Hossein Forouhar包含的帖子的id、创建日期、位置IP和语言，并返回论坛的创建日期和标题，限制结果为3条",
        "output": "match (n1:forum)-[r1:containerOf]->(n2:post)  where n1.title='Album 3 of Hossein Forouhar' return n2.id, n2.creationdate, n1.creationdate, n2.locationip, n1.title, n2.language limit 3"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 17 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 3 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 13 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 3 of Hossein Forouhar包含的帖子的浏览器使用情况、论坛的创建日期、帖子的id和论坛的标题，最多返回17条结果",
        "output": "match (n1:forum)-[r1:containerOf]->(n2:post)  where n1.title='Album 3 of Hossein Forouhar' return n2.browserused, n1.creationdate, n2.id, n1.title limit 17"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 4 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 14 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 18 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\nlabel为tag,属性name='Music_for_18_Musicians'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 4 of Hossein Forouhar包含的帖子的创建日期、内容、使用的浏览器、IP地址以及论坛的id，最多返回18条记录",
        "output": "match (n1:forum)-[r1:containerOf]->(n2:post)  where n1.title='Album 4 of Hossein Forouhar' return r1.creationdate, n2.content, n2.browserused, n2.locationip, n1.id limit 18"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 5 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 5 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 4 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Islamic_Courts_Union'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 5 of Hossein Forouhar包含的帖子的浏览器使用情况、论坛的创建日期、帖子的语言、图片文件、帖子的创建日期、帖子的长度、关联关系的创建日期、帖子的位置IP以及论坛的标题",
        "output": "match (n1:forum)-[r1:containerOf]->(n2:post)  where n1.title='Album 5 of Hossein Forouhar' return n2.browserused, n1.creationdate, n2.language, n2.imagefile, n2.creationdate, n2.length, r1.creationdate, n2.locationip, n1.title"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 5 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 5 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 7 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 5 of Hossein Forouhar包含的帖子的关联时间、帖子的创建时间、论坛的创建时间、帖子的位置IP、帖子使用的浏览器以及论坛的id",
        "output": "match (n1:forum)-[r1:containerOf]->(n2:post)  where n1.title='Album 5 of Hossein Forouhar' return r1.creationdate, n2.creationdate, n1.creationdate, n2.locationip, n2.browserused, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 6 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 6 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 26 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Sindh_Madrasatul_Islam'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为person,属性firstname='Mamoon Eshaq 0'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Fatehgarh_Sahib'的节点\nlabel为place,属性name='New_Muslim_Town'的节点\nlabel为tag,属性name='Glee:_The_Music,_Volume_6'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 6 of Hossein Forouhar包含的帖子的内容以及该论坛的标题",
        "output": "match (n1:forum)-[r1:containerOf]->(n2:post)  where n1.title='Album 6 of Hossein Forouhar' return n2.content, n1.title"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 6 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 6 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 6 of Mohamed Hassan'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\nlabel为tag,属性name='Islamic_Courts_Union'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 6 of Hossein Forouhar及其包含的帖子的信息，包括论坛的创建日期、帖子的图片文件、帖子的创建日期、论坛的id、关系的创建日期、帖子的id、帖子的长度、帖子的语言、帖子使用的浏览器、帖子的内容以及论坛的标题，限制返回6条结果",
        "output": "match (n1:forum)-[r1:containerOf]->(n2:post)  where n1.title='Album 6 of Hossein Forouhar' return n1.creationdate, n2.imagefile, n2.creationdate, n1.id, r1.creationdate, n2.id, n2.length, n2.language, n2.browserused, n2.content, n1.title limit 6"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 6 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 6 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 26 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Qazvin_Islamic_Azad_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\nlabel为tag,属性name='Islamic_Courts_Union'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 6 of Hossein Forouhar包含的帖子的IP地址、内容、论坛的创建日期、论坛的id、帖子的创建日期、帖子的语言、帖子的图片文件、帖子的id和帖子的内容长度",
        "output": "match (n1:forum)-[r1:containerOf]->(n2:post)  where n1.title='Album 6 of Hossein Forouhar' return n2.locationip, n2.content, n1.creationdate, n1.id, n2.creationdate, n2.language, n2.imagefile, n2.id, n2.length"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 6 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 6 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 6 of Amjad Islam Ahsan'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\nlabel为tag,属性name='Islamic_Courts_Union'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 6 of Hossein Forouhar包含的帖子的语言、id、论坛id、浏览器使用情况、位置IP和长度",
        "output": "match (n1:forum)-[r1:containerOf]->(n2:post)  where n1.title='Album 6 of Hossein Forouhar' return n2.language, n2.id, n1.id, n2.browserused, n2.locationip, n2.length"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 6 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 6 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 26 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Qazvin_Islamic_Azad_University'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 6 of Hossein Forouhar包含的帖子的创建日期、语言、IP位置、内容以及论坛的id",
        "output": "match (n1:forum)-[r1:containerOf]->(n2:post)  where n1.title='Album 6 of Hossein Forouhar' return r1.creationdate, n2.language, n2.locationip, n2.content, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 6 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 6 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 26 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Al_Jamea_tus_Saifiyah'的节点\nlabel为organisation,属性name='Al_Jamea_tus_Saifiyah'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='Glee:_The_Music,_Volume_6'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 6 of Hossein Forouhar的创建日期",
        "output": "match (n1:forum)-[r1:containerOf]->(n2:post)  where n1.title='Album 6 of Hossein Forouhar' return n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 6 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 26 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 6 of Hassan Forouhar'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='The_Photo_Album'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 6 of Hossein Forouhar包含的帖子的图片文件、论坛的id、帖子的创建日期、论坛的创建日期、帖子的id和使用的浏览器",
        "output": "match (n1:forum)-[r1:containerOf]->(n2:post)  where n1.title='Album 6 of Hossein Forouhar' return n2.imagefile, n1.id, n2.creationdate, n1.creationdate, n2.id, n2.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 6 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 5 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 6 of Hassan Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Baku_Academy_of_Music'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\nlabel为tag,属性name='Theme_from_A_Summer_Place'的节点\nlabel为tag,属性name='Lullabies_to_Paralyze'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 6 of Hossein Forouhar包含的帖子的语言，限制返回5条结果，并返回该论坛的标题",
        "output": "match (n1:forum)-[r1:containerOf]->(n2:post)  where n1.title='Album 6 of Hossein Forouhar' return n1.title, n2.language limit 5"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 0 of Emperor of Brazil Souza'的节点\nlabel为forum,属性title='Album 0 of Emperor of Brazil Silva'的节点\nlabel为forum,属性title='Album 0 of Emperor of Brazil Dom Pedro II'的节点\nlabel为organisation,属性name='Rafael_Belloso_Chacin_University'的节点\nlabel为organisation,属性name='Sultan_Qaboos_University'的节点\nlabel为organisation,属性name='Queen_Sofía_College_of_Music'的节点\nlabel为place,属性name='Bab_Ezzouar'的节点\nlabel为place,属性name='Freiburg_im_Breisgau'的节点\nlabel为place,属性name='Pedro_Escobedo'的节点\nlabel为tag,属性name='Pedro_I_of_Brazil'的节点\nlabel为tag,属性name='Afonso_I_of_Portugal'的节点\nlabel为tag,属性name='Pedro_II_of_Brazil'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 0 of Hossein Forouhar中成员名为Emperor of Brazil的语言、性别、生日、加入时间、使用的浏览器、论坛标题、电子邮件、姓氏和id",
        "output": "match (n1:forum)-[r1:hasmember]->(n2:person)  where n1.title='Album 0 of Hossein Forouhar' and n2.firstname='Emperor of Brazil' return n2.language, n2.gender, n2.birthday, r1.creationdate, n2.browserused, n1.title, n2.email, n2.lastname, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Chen_Shui-bian in Dar_es_Salaam'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Khalsa_College,_Amritsar'的节点\nlabel为organisation,属性name='El_Asher_University'的节点\nlabel为tag,属性name='Sher_Shah_Suri'的节点\nlabel为tag,属性name='Mohammed_Zahir_Shah'的节点\nlabel为tag,属性name='Chris_Sabin'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Chris的成员在Album 0 of Hossein Forouhar中的浏览器使用情况、创建日期、论坛标题、成员名、性别、论坛ID、成员ID、位置IP和使用的语言",
        "output": "match (n1:forum)-[r1:hasmember]->(n2:person)  where n1.title='Album 0 of Hossein Forouhar' and n2.firstname='Chris' return n2.browserused, n2.creationdate, n1.title, n2.firstname, n2.gender, n1.id, n2.language, n2.id, n2.locationip"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Gachongil_College'的节点\nlabel为organisation,属性name='Delgado_Community_College'的节点\nlabel为organisation,属性name='Georgia_Tech_Alumni_Association'的节点\nlabel为tag,属性name='Live_at_the_Gorge_05/06'的节点\nlabel为tag,属性name='The_Grind_Date'的节点\nlabel为tag,属性name='Eddie_Guerrero'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Grigore的人加入的论坛的id、创建日期，以及该人的邮箱、语言、生日、id、性别和名字，同时返回加入关系的创建日期",
        "output": "match (n1:forum)-[r1:hasmember]->(n2:person)  where n2.firstname='Grigore' return n2.email, n1.id, n2.language, n2.birthday, n2.id, n2.gender, n2.firstname, n1.creationdate, r1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='K_L_University'的节点\nlabel为organisation,属性name='KPC_Medical_College_and_Hospital'的节点\nlabel为organisation,属性name='Korea_Science_Academy_of_KAIST'的节点\nlabel为tag,属性name='Profiles'的节点\nlabel为tag,属性name='Ken_Schrader'的节点\nlabel为tag,属性name='Kevin_Rudd'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为K.的人的生日、加入论坛的时间、论坛的创建时间、个人的创建时间、姓氏、位置IP、性别、ID、论坛ID、论坛标题、浏览器使用情况和个人邮箱",
        "output": "match (n1:forum)-[r1:hasmember]->(n2:person)  where n2.firstname='K.' return n2.birthday, r1.creationdate, n1.creationdate, n2.creationdate, n2.lastname, n2.locationip, n2.gender, n2.id, n1.id, n1.title, n2.browserused, n2.email"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 0 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 0 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 0 of Amjad Islam Ahsan'的节点\nlabel为organisation,属性name='Al-Farabi_University'的节点\nlabel为organisation,属性name='Obirin_Junior_College'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='Omar_Sharif'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 0 of Hossein Forouhar中名为Alfonso的成员的生日、使用的浏览器、id、论坛的创建日期、成员的姓氏、性别、IP地址、名字、论坛的id和标题、成员的邮箱以及他们加入论坛的日期",
        "output": "match (n1:forum)-[r1:hasmember]->(n2:person)  where n1.title='Album 0 of Hossein Forouhar' and n2.firstname='Alfonso' return n2.birthday, n2.browserused, n2.id, n1.creationdate, n2.lastname, n2.gender, n2.locationip, n2.firstname, n1.id, n1.title, n2.email, r1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 0 of Muhammad Ahmed'的节点\nlabel为forum,属性title='Album 0 of Amjad Islam Ahsan'的节点\nlabel为forum,属性title='Album 0 of Faisal Ahmed'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Qazvin_Islamic_Azad_University'的节点\nlabel为organisation,属性name='Jamal_Mohamed_College'的节点\nlabel为person,属性firstname='Salim Ahmed'的节点\nlabel为person,属性firstname='Abdullah'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为place,属性name='Fatehgarh_Sahib'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Mohammed_Zahir_Shah'的节点\nlabel为tag,属性name='Muhammad_Ali_of_Egypt'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Salim Ahmed的人加入的Album 0 of Hossein Forouhar论坛的id、创建日期，以及该人的生日、IP地址、使用的浏览器、语言、姓氏、名字、性别和邮箱。",
        "output": "match (n1:forum)-[r1:hasmember]->(n2:person)  where n2.firstname='Salim Ahmed' and n1.title='Album 0 of Hossein Forouhar' return n1.id, n2.birthday, n2.locationip, n1.title, n2.browserused, n2.language, n2.lastname, n2.firstname, n2.gender, n1.creationdate, n2.email"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 14 of Amjad Islam Ahsan'的节点\nlabel为forum,属性title='Album 0 of Amjad Islam Ahsan'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Islamic_Azad_University_of_Mashhad'的节点\nlabel为organisation,属性name='Qazvin_Islamic_Azad_University'的节点\nlabel为person,属性firstname='Mamoon Eshaq 0'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Islamabad/Rawalpindi,Lahore'的节点\nlabel为place,属性name='Fatehgarh_Sahib'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Islamic_Courts_Union'的节点\nlabel为tag,属性name='Mahmoud_Abbas'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 0 of Hossein Forouhar中名为Abdul-Malik的成员的位置IP、论坛的创建日期、成员的邮箱、成员的创建日期、成员加入论坛的日期、论坛的ID、成员的姓氏、性别、名字、生日以及论坛的标题，限制返回14条结果",
        "output": "match (n1:forum)-[r1:hasmember]->(n2:person)  where n1.title='Album 0 of Hossein Forouhar' and n2.firstname='Abdul-Malik' return n2.locationip, n1.creationdate, n2.email, n2.creationdate, r1.creationdate, n1.id, n2.lastname, n2.gender, n2.firstname, n2.birthday, n1.title limit 14"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 0 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 0 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 1 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Obirin_Junior_College'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 0 of Hossein Forouhar的成员的生日、论坛标题、姓氏、创建日期、语言、名字、浏览器使用情况、电子邮件、性别和成员的id，以及论坛的创建日期。",
        "output": "match (n1:forum)-[r1:hasmember]->(n2:person)  where n1.title='Album 0 of Hossein Forouhar' return n2.birthday, n1.title, n2.lastname, n2.creationdate, n2.language, n2.firstname, n2.browserused, n2.email, n2.gender, n1.creationdate, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 1 of Emperor of Brazil Souza'的节点\nlabel为forum,属性title='Album 6 of Emperor of Brazil Dom Pedro II'的节点\nlabel为forum,属性title='Album 6 of Emperor of Brazil Machado'的节点\nlabel为organisation,属性name='Sultan_Qaboos_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Adolfo_Ibáñez_University'的节点\nlabel为place,属性name='Bab_Ezzouar'的节点\nlabel为place,属性name='Pedro_Escobedo'的节点\nlabel为tag,属性name='Pedro_I_of_Brazil'的节点\nlabel为tag,属性name='Zulfikar_Ali_Bhutto'的节点\nlabel为tag,属性name='Zine_El_Abidine_Ben_Ali'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 1 of Hossein Forouhar中成员名为Emperor of Brazil的用户的id和姓氏，限制返回6条结果",
        "output": "match (n1:forum)-[r1:hasmember]->(n2:person)  where n2.firstname='Emperor of Brazil' and n1.title='Album 1 of Hossein Forouhar' return n1.id, n2.lastname limit 6"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 1 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 2 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 1 of Hassan Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='The_Help_Album'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 1 of Hossein Forouhar的成员信息，返回论坛的id、成员的生日和使用的浏览器，限制返回2条结果",
        "output": "match (n1:forum)-[r1:hasmember]->(n2:person)  where n1.title='Album 1 of Hossein Forouhar' return n1.id, n2.birthday, n2.browserused limit 2"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 1 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 18 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 8 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Gokhale_Memorial_Girls'_College'的节点\nlabel为organisation,属性name='Obirin_Junior_College'的节点\nlabel为organisation,属性name='Harimohan_Ghosh_College'的节点\nlabel为place,属性name='Chorrillos_District'的节点\nlabel为tag,属性name='Music_for_18_Musicians'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\nlabel为tag,属性name='Live_at_the_Gorge_05/06'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 1 of Hossein Forouhar中的成员Grigore的姓氏、性别、id、论坛id、成员创建日期、论坛创建日期、语言、位置IP、生日、浏览器使用情况、关系创建日期、电子邮件和论坛标题，最多返回18条记录。",
        "output": "match (n1:forum)-[r1:hasmember]->(n2:person)  where n1.title='Album 1 of Hossein Forouhar' and n2.firstname='Grigore' return n2.lastname, n2.gender, n2.id, n1.id, n2.creationdate, n1.creationdate, n2.language, n2.locationip, n2.birthday, n2.browserused, r1.creationdate, n2.email, n1.title limit 18"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Andres_Soriano_College'的节点\nlabel为organisation,属性name='Alverno_College'的节点\nlabel为organisation,属性name='Fundação_Armando_Alvares_Penteado'的节点\nlabel为tag,属性name='Fernando_Alonso'的节点\nlabel为tag,属性name='In_da_Club'的节点\nlabel为tag,属性name='Doremi_Fasol_Latido'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Alfonso的成员加入的论坛，返回加入时间、成员的名字、邮箱、性别、成员的创建日期、成员的id以及论坛的创建日期",
        "output": "match (n1:forum)-[r1:hasmember]->(n2:person)  where n2.firstname='Alfonso' return r1.creationdate, n2.firstname, n2.email, n2.gender, n2.creationdate, n2.id, n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 1 of Hossein Forouhar'的节点\nlabel为forum,属性title='Group for Joseph_Haydn in Solapur'的节点\nlabel为forum,属性title='Group for John_Edward_Gray in Shah_Alam'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Harimohan_Ghosh_College'的节点\nlabel为organisation,属性name='Al-Zaytoonah_University_of_Jordan'的节点\nlabel为tag,属性name='Jeff_Gordon'的节点\nlabel为tag,属性name='Hussein_of_Jordan'的节点\nlabel为tag,属性name='Geoff_Johns'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Jorge的人加入的Album 1 of Hossein Forouhar论坛的信息，返回该人的浏览器使用情况、生日、位置IP、姓氏、该论坛的创建日期、该人的创建日期、加入关系的创建日期、名字、语言和邮箱，以及该论坛的id。",
        "output": "match (n1:forum)-[r1:hasmember]->(n2:person)  where n2.firstname='Jorge' and n1.title='Album 1 of Hossein Forouhar' return n2.browserused, n2.birthday, n2.locationip, n2.lastname, n1.creationdate, n2.creationdate, r1.creationdate, n2.firstname, n2.language, n2.email, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Imam_Sadiq_University'的节点\nlabel为organisation,属性name='Jamal_Mohamed_College'的节点\nlabel为person,属性firstname='Salim Ahmed'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Sahiwal_Division'的节点\nlabel为tag,属性name='Mohammed_Zahir_Shah'的节点\nlabel为tag,属性name='Saif_Ali_Khan'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Salim Ahmed的成员的性别、姓氏、生日、使用的浏览器、所在论坛的标题、成员的创建日期、加入论坛的日期、使用的语言和名字",
        "output": "match (n1:forum)-[r1:hasmember]->(n2:person)  where n2.firstname='Salim Ahmed' return n2.gender, n2.lastname, n2.birthday, n2.browserused, n1.title, n2.creationdate, r1.creationdate, n2.language, n2.firstname"
    }
]