[
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Adani_Institute_of_Infrastructure_Management'的节点\nlabel为organisation,属性name='Asian_Institute_of_Management'的节点\nlabel为organisation,属性name='Mohammad_Ali_Jinnah_University'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\nlabel为tag,属性name='Muhammad_Ali'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Ali的人作为管理员的论坛的信息，包括该人的创建日期、姓氏、浏览器使用情况、生日、论坛标题、名字、语言、电子邮件、位置IP、ID，以及该人与论坛关系的创建日期和性别。",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n2.firstname='Ali' return n2.creationdate, n2.lastname, n1.creationdate, n2.browserused, n2.birthday, n1.title, n2.firstname, n2.language, n2.email, n2.locationip, n2.id, n1.id, r1.creationdate, n2.gender"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Wall of Ali Achiou'的节点\nlabel为forum,属性title='Wall of Ahmad Zakii Lee'的节点\nlabel为forum,属性title='Wall of Ali Diori'的节点\nlabel为organisation,属性name='Adani_Institute_of_Infrastructure_Management'的节点\nlabel为organisation,属性name='Al_Akhawayn_University'的节点\nlabel为organisation,属性name='Ajay_Binay_Institute_of_Technology'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\nlabel为tag,属性name='Adil_Shahi_dynasty'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Wall of Ali Achiou的管理员Ali的详细信息，包括他的语言、论坛的创建日期、生日、名字、IP地址、创建日期、性别、论坛标题、姓氏、邮箱、ID、使用的浏览器以及关系的创建日期。",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n1.title='Wall of Ali Achiou' and n2.firstname='Ali' return n2.language, n1.creationdate, n2.birthday, n2.firstname, n2.locationip, n2.creationdate, n2.gender, n1.title, n2.lastname, n2.email, n2.id, n1.id, n2.browserused, r1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为forum,属性title='Group for Alicia_Keys in Jalpaiguri'的节点\nlabel为organisation,属性name='Adani_Institute_of_Infrastructure_Management'的节点\nlabel为organisation,属性name='Azim_Premji_University'的节点\nlabel为organisation,属性name='Mohammad_Ali_Jinnah_University'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\nlabel为tag,属性name='Muhammad_Ali'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Ali的人员作为管理员的论坛的创建日期、性别和论坛的id，限制返回8条结果",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n2.firstname='Ali' return n2.creationdate, n2.gender, n1.id limit 8"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Rafael_Nadal in Visonta'的节点\nlabel为organisation,属性name='Jorge_Amado_University_Center'的节点\nlabel为organisation,属性name='Jorge_A._Sabato_institute'的节点\nlabel为organisation,属性name='Garcia_College_of_Technology'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为place,属性name='San_Pedro_Garza_García'的节点\nlabel为place,属性name='Presidencia_Roque_Sáenz_Peña'的节点\nlabel为tag,属性name='Juan_Ignacio_Chela'的节点\nlabel为tag,属性name='Miguel_Hidalgo_y_Costilla'的节点\nlabel为tag,属性name='Alan_García'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Alejandro Garcia管理的论坛的标题，他的姓氏，管理关系的创建日期，性别，电子邮件，语言，名，IP地址，论坛的id和生日",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n2.firstname='Alejandro' and n1.title='Wall of Alejandro Garcia' return n1.title, n2.lastname, r1.creationdate, n2.gender, n2.email, n2.language, n2.firstname, n2.locationip, n1.id, n2.birthday"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Nikolay_Davydenko in Ahmedpur_Sial'的节点\nlabel为forum,属性title='Wall of Deepak Khan'的节点\nlabel为forum,属性title='Wall of Deepak Khan'的节点\nlabel为organisation,属性name='Zakir_Husain_Delhi_College'的节点\nlabel为organisation,属性name='Mohammad_Ali_Jinnah_University'的节点\nlabel为organisation,属性name='Jamal_Mohamed_College'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为place,属性name='Jiaganj_Azimganj'的节点\nlabel为place,属性name='Fatehgarh_Sahib'的节点\nlabel为tag,属性name='Saif_Ali_Khan'的节点\nlabel为tag,属性name='Adil_Shahi_dynasty'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Wall of Deepak Khan的管理员的生日、邮箱、名字、位置IP以及论坛的id",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n1.title='Wall of Deepak Khan' return n2.birthday, n2.email, n2.firstname, n2.locationip, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Diederich_College_of_Communication'的节点\nlabel为organisation,属性name='Deakin_University'的节点\nlabel为organisation,属性name='Deakin_University'的节点\nlabel为tag,属性name='Alfred_Deakin'的节点\nlabel为tag,属性name='David_H._DePatie'的节点\nlabel为tag,属性name='Deval_Patrick'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Deepak担任管理员的论坛的信息，包括Deepak的邮箱、名字、浏览器使用情况、语言、姓氏、生日、创建日期，以及论坛的标题、创建日期和ID。同时返回关系的创建日期。",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n2.firstname='Deepak' return n2.email, n2.firstname, n1.title, n2.browserused, n2.language, n2.lastname, n2.birthday, n1.creationdate, r1.creationdate, n2.creationdate, n1.id, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Wall of Albaye Papa Diouf'的节点\nlabel为forum,属性title='Wall of Albaye Papa Faye'的节点\nlabel为forum,属性title='Wall of Albaye Papa Senghor'的节点\nlabel为organisation,属性name='Pablo_de_Olavide_University'的节点\nlabel为organisation,属性name='Petre_Andrei_University_of_Iaşi'的节点\nlabel为organisation,属性name='Abasaheb_Garware_College'的节点\nlabel为person,属性firstname='Albaye Papa'的节点\nlabel为person,属性firstname='Albaye Papa'的节点\nlabel为person,属性firstname='Albaye Papa'的节点\nlabel为place,属性name='Bab_Ezzouar'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\nlabel为tag,属性name='Iparhi_Agapi_Edo'的节点\nlabel为tag,属性name='Abbas_I_of_Persia'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Wall of Albaye Papa Diouf的管理员Albaye Papa的语言信息",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n1.title='Wall of Albaye Papa Diouf' and n2.firstname='Albaye Papa' return n2.language"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 7 of Albaye Papa Diouf'的节点\nlabel为forum,属性title='Album 17 of Albaye Papa Diouf'的节点\nlabel为forum,属性title='Album 27 of Albaye Papa Diouf'的节点\nlabel为organisation,属性name='Petre_Andrei_University_of_Iaşi'的节点\nlabel为organisation,属性name='Pablo_de_Olavide_University'的节点\nlabel为organisation,属性name='Sandip_Foundation'的节点\nlabel为person,属性firstname='Albaye Papa'的节点\nlabel为person,属性firstname='Albaye Papa'的节点\nlabel为person,属性firstname='Albaye Papa'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\nlabel为tag,属性name='David_Nalbandian'的节点\nlabel为tag,属性name='Iparhi_Agapi_Edo'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 7 of Albaye Papa Diouf的管理员的信息，包括论坛的id、管理员的姓氏、论坛的创建日期、管理员的生日、语言、名字、邮箱、创建日期以及关系的创建日期和管理员的位置IP",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n2.firstname='Albaye Papa' and n1.title='Album 7 of Albaye Papa Diouf' return n1.id, n2.lastname, n1.creationdate, n2.birthday, n2.language, n2.firstname, n2.email, n2.creationdate, r1.creationdate, n2.locationip"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Wall of Abay Ibrahim Kanapyanov'的节点\nlabel为forum,属性title='Album 1 of Abay Ibrahim Kanapyanov'的节点\nlabel为forum,属性title='Group for Nikolay_Davydenko in Ahmedpur_Sial'的节点\nlabel为organisation,属性name='Xavier_Institute_of_Management,_Bhubaneswar'的节点\nlabel为organisation,属性name='Al_Akhawayn_University'的节点\nlabel为organisation,属性name='Al_Kabir_Polytechnic'的节点\nlabel为place,属性name='Ivanovo_Oblast'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\nlabel为tag,属性name='Ilham_Aliyev'的节点\nlabel为tag,属性name='Anatoly_Karpov'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Wall of Abay Ibrahim Kanapyanov的管理员的姓名、id、语言、电子邮件、姓氏、使用的浏览器、关系创建日期、位置IP、论坛的id、标题、创建日期、管理员的生日和性别",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n1.title='Wall of Abay Ibrahim Kanapyanov' return n2.firstname, n2.id, n1.id, n2.language, n1.title, n2.email, n2.lastname, n2.browserused, r1.creationdate, n2.locationip, n1.creationdate, n2.birthday, n2.gender"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Wall of Chaim Azriel Hleb'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为organisation,属性name='Xavier_Institute_of_Management,_Bhubaneswar'的节点\nlabel为organisation,属性name='Abasaheb_Garware_College'的节点\nlabel为organisation,属性name='Qazvin_Islamic_Azad_University'的节点\nlabel为tag,属性name='Ayman_al-Zawahiri'的节点\nlabel为tag,属性name='Saif_Ali_Khan'的节点\nlabel为tag,属性name='Mohammed_Zahir_Shah'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Wall of Chaim Azrail Hleb的管理员的性别、IP地址、管理关系的创建日期、使用的浏览器、邮箱以及论坛的标题",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n1.title='Wall of Chaim Azriel Hleb' return n2.gender, n2.locationip, r1.creationdate, n2.browserused, n2.email, n1.title"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Wall of Zdenek Herzigová'的节点\nlabel为forum,属性title='Wall of David Herzigová'的节点\nlabel为forum,属性title='Wall of Andrzej Zakrzewski'的节点\nlabel为organisation,属性name='Gheorghe_Zane_University'的节点\nlabel为organisation,属性name='Zaoksky_Adventist_University'的节点\nlabel为organisation,属性name='Cardinal_Stefan_Wyszyński_University_in_Warsaw'的节点\nlabel为tag,属性name='Denzel_Washington'的节点\nlabel为tag,属性name='Zakk_Wylde'的节点\nlabel为tag,属性name='Daniel_Vacek'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Wall of Zdenek Herzigová的管理员Zdenek的生日、论坛标题、关系创建日期、管理员的语言、论坛id、管理员的邮箱和名字，限制返回2条结果",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n1.title='Wall of Zdenek Herzigová' and n2.firstname='Zdenek' return n2.birthday, n1.title, r1.creationdate, n2.language, n1.id, n2.email, n2.firstname limit 2"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Wall of Miguel Gonzalez'的节点\nlabel为forum,属性title='Wall of Jose Gonzalez'的节点\nlabel为forum,属性title='Wall of Jose Gonzalez'的节点\nlabel为organisation,属性name='Diego_Portales_University'的节点\nlabel为organisation,属性name='Andres_Soriano_College'的节点\nlabel为organisation,属性name='Escuela_Normal_Superior_Moíses_Sáenz_Garza'的节点\nlabel为place,属性name='Campos_dos_Goytacazes'的节点\nlabel为place,属性name='San_Pedro_Garza_García'的节点\nlabel为tag,属性name='Gabriel_García_Márquez'的节点\nlabel为tag,属性name='Alberto_Gonzales'的节点\nlabel为tag,属性name='Fernando_González'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Wall of Jose Gonzalez的管理员的性别、邮箱、语言，以及管理员关系的创建日期和论坛的id",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n1.title='Wall of Jose Gonzalez' return n2.gender, n2.email, n2.language, r1.creationdate, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Pavai_College_of_Technology'的节点\nlabel为organisation,属性name='Paul_Sabatier_University'的节点\nlabel为organisation,属性name='Paavai_College_of_Engineering'的节点\nlabel为tag,属性name='Andrei_Pavel'的节点\nlabel为tag,属性name='Paul_Revere'的节点\nlabel为tag,属性name='Paul_Schrader'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Pavel担任管理员的论坛的信息，包括Pavel的姓名、性别、创建日期、使用的浏览器、位置IP、语言，以及论坛的ID、标题和创建日期，还有管理员关系的创建日期。",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n2.firstname='Pavel' return n2.firstname, r1.creationdate, n1.id, n2.creationdate, n2.id, n1.creationdate, n2.lastname, n1.title, n2.language, n2.locationip, n2.browserused, n2.gender"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for John_Lennon in Chaozhou'的节点\nlabel为forum,属性title='Group for Joseph_Stalin in Bijie'的节点\nlabel为forum,属性title='Group for John_McCain in Zhukovsky'的节点\nlabel为organisation,属性name='Jain_Institute_of_Technology'的节点\nlabel为organisation,属性name='IAE_Jean_Moulin_University_Lyon_3'的节点\nlabel为organisation,属性name='Jagran_Institute_of_Communication_and_Management'的节点\nlabel为place,属性name='Pyin_U_Lwin'的节点\nlabel为place,属性name='Jagüey_Grande'的节点\nlabel为place,属性name='Borey_Seang_Nam'的节点\nlabel为tag,属性name='Jennifer_Jason_Leigh'的节点\nlabel为tag,属性name='The_Jean_Genie'的节点\nlabel为tag,属性name='Jeff_Lynne'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Jun且管理着Wall of Jun Li论坛的人的邮箱、姓氏、语言以及他们成为管理员的时间",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n2.firstname='Jun' and n1.title='Wall of Jun Li' return n2.email, n2.lastname, n2.language, r1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Matt_Damon in Chaozhou'的节点\nlabel为organisation,属性name='SAM_Colombia'的节点\nlabel为organisation,属性name='Calvin_University'的节点\nlabel为organisation,属性name='Hogeschool_van_Amsterdam'的节点\nlabel为place,属性name='Kampong_Cham'的节点\nlabel为tag,属性name='Michael_Chabon'的节点\nlabel为tag,属性name='Carl_Maria_von_Weber'的节点\nlabel为tag,属性name='Carl_Gustaf_Emil_Mannerheim'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Cam且管理着Wall of Cam Ho论坛的人的语言和IP地址，最多返回3条结果",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n2.firstname='Cam' and n1.title='Wall of Cam Ho' return n2.language, n2.locationip limit 3"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Wall of Ashin Karat'的节点\nlabel为forum,属性title='Wall of Ahmad Zakii Lee'的节点\nlabel为forum,属性title='Group for Alicia_Keys in Jalpaiguri'的节点\nlabel为organisation,属性name='Maulana_Azad_College'的节点\nlabel为organisation,属性name='Shahid_Madani_University_Of_Azarbaijan'的节点\nlabel为organisation,属性name='Zakir_Husain_Delhi_College'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为tag,属性name='Adil_Shahi_dynasty'的节点\nlabel为tag,属性name='Dance_Hall_Days'的节点\nlabel为tag,属性name='Saif_Ali_Khan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Wall of Ashin Karat的管理员的id、创建日期和生日，并返回论坛的标题",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n1.title='Wall of Ashin Karat' return n1.title, n2.creationdate, n2.birthday, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Wall of Parviz Derderian'的节点\nlabel为forum,属性title='Group for Rafael_Nadal in Visonta'的节点\nlabel为forum,属性title='Group for Heinz_Guderian in Dire_Dawa'的节点\nlabel为organisation,属性name='Davangere_University'的节点\nlabel为organisation,属性name='Sardar_Patel_University'的节点\nlabel为organisation,属性name='Sardar_Patel_University'的节点\nlabel为tag,属性name='David_Prinosil'的节点\nlabel为tag,属性name='Walter_Pidgeon'的节点\nlabel为tag,属性name='Leander_Paes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Wall of Parviz Derderian的版主的id、姓氏、语言和浏览器使用情况，以及论坛的标题",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n1.title='Wall of Parviz Derderian' return n1.id, n2.lastname, n2.language, n1.title, n2.browserused"
    },
    {
        "instruction": "\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Wall of Hao Chen的管理员的浏览器使用情况、创建日期、姓氏、位置IP、id、语言、电子邮件、性别和名字",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n1.title='Wall of Hao Chen' return n2.browserused, n2.creationdate, n2.lastname, n2.locationip, n2.id, n2.language, n2.email, n2.gender, n2.firstname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Wall of Bingbing Liu'的节点\nlabel为forum,属性title='Wall of Bing Liu'的节点\nlabel为forum,属性title='Wall of Bing Liu'的节点\nlabel为organisation,属性name='Alumni_Hall'的节点\nlabel为organisation,属性name='Paul_Sabatier_University'的节点\nlabel为organisation,属性name='Hubert_Kairuki_Memorial_University'的节点\nlabel为place,属性name='Pyin_U_Lwin'的节点\nlabel为tag,属性name='Born_Slippy_.NUXX'的节点\nlabel为tag,属性name='Sgt._Pepper_Live'的节点\nlabel为tag,属性name='Peter_Paul_Rubens'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Wall of Bingbing Liu的版主的生日、使用的浏览器和创建日期",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n1.title='Wall of Bingbing Liu' return n2.birthday, n2.browserused, n2.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Wall of David Fenter'的节点\nlabel为forum,属性title='Wall of Stefan David'的节点\nlabel为forum,属性title='Wall of David Anderson'的节点\nlabel为organisation,属性name='DG_Vaishnav_College'的节点\nlabel为organisation,属性name='Vanderbilt_University_Graduate_School'的节点\nlabel为organisation,属性name='Vet_Tech_Institute_at_Bradford_School'的节点\nlabel为tag,属性name='David_Foster'的节点\nlabel为tag,属性name='David_Weber'的节点\nlabel为tag,属性name='John_Denver'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找David作为管理员的论坛“Wall of David Fenter”的详细信息，包括David的姓氏、创建日期、id、使用的浏览器、语言、IP地址、电子邮件和生日，以及论坛的创建日期和id。",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n2.firstname='David' and n1.title='Wall of David Fenter' return n2.lastname, n2.creationdate, n2.id, n1.creationdate, n1.id, n2.browserused, n2.language, n2.locationip, n2.email, n2.birthday"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Wall of Fritz Muller'的节点\nlabel为forum,属性title='Wall of Franz Muller'的节点\nlabel为forum,属性title='Wall of Wolfgang Muller'的节点\nlabel为organisation,属性name='Sigmund_Freud_University_Vienna'的节点\nlabel为organisation,属性name='Sigmund_Freud_University_Vienna'的节点\nlabel为organisation,属性name='Fulmer_Hall'的节点\nlabel为tag,属性name='Alfred_Russel_Wallace'的节点\nlabel为tag,属性name='Mariusz_Fyrstenberg'的节点\nlabel为tag,属性name='Felix_Frankfurter'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Wall of Franz Muller的管理员Franz的姓氏、位置IP、生日以及论坛的创建日期",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n2.firstname='Franz' and n1.title='Wall of Franz Muller' return n2.lastname, n2.locationip, n2.birthday, n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Wall of Andrei Makarova'的节点\nlabel为forum,属性title='Wall of Leonid Makarova'的节点\nlabel为forum,属性title='Wall of Mischa Ivanov'的节点\nlabel为organisation,属性name='Adam_Mickiewicz_University_in_Poznań'的节点\nlabel为organisation,属性name='Moscow_Aviation_Institute'的节点\nlabel为organisation,属性name='Cardinal_Stefan_Wyszyński_University_in_Warsaw'的节点\nlabel为place,属性name='Ivanovo_Oblast'的节点\nlabel为place,属性name='Moscow_International_Business_Center'的节点\nlabel为place,属性name='Kemerovo_Oblast'的节点\nlabel为tag,属性name='Alexander_Vladimirovich_Volkov'的节点\nlabel为tag,属性name='Andriy_Medvedev'的节点\nlabel为tag,属性name='Dmitry_Medvedev'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Wall of Andrei Makarova的版主所在论坛的id",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n1.title='Wall of Andrei Makarova' return n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Wall of Frank Anderson'的节点\nlabel为organisation,属性name='Jan_Van_Eyck_Academie'的节点\nlabel为organisation,属性name='Florida_Hospital_College_of_Health_Sciences'的节点\nlabel为organisation,属性name='Florida_Student_Association'的节点\nlabel为tag,属性name='Frankie_Avalon'的节点\nlabel为tag,属性name='Alfred_Russel_Wallace'的节点\nlabel为tag,属性name='John_Franklin'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Frank且是Wall of Frank Anderson论坛管理员的人的详细信息，包括他的姓氏、电子邮件、位置IP、语言、性别、浏览器使用情况、生日和ID，以及论坛的ID和标题，还有管理员关系的创建日期。",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n2.firstname='Frank' and n1.title='Wall of Frank Anderson' return n2.lastname, n2.email, n1.id, n2.locationip, n1.title, n2.firstname, n2.language, r1.creationdate, n2.creationdate, n2.gender, n2.browserused, n2.birthday, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Frankfurt_School_of_Finance_&_Management'的节点\nlabel为organisation,属性name='Florida_Institute_of_Technology_Academics'的节点\nlabel为organisation,属性name='Frankfurt_University_of_Applied_Sciences'的节点\nlabel为tag,属性name='Felix_Frankfurter'的节点\nlabel为tag,属性name='Frank_Gifford'的节点\nlabel为tag,属性name='John_Franklin'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Frank作为管理员的论坛信息，包括他的位置IP、论坛标题、他的ID、生日、姓名、语言、邮箱、浏览器使用情况、创建日期、性别，以及他成为管理员的创建日期，从第16条记录开始，返回20条记录。",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n2.firstname='Frank' return n2.locationip, n1.title, n2.id, n2.birthday, n2.firstname, n2.language, n2.email, n2.browserused, n2.creationdate, r1.creationdate, n2.gender, n1.creationdate, n1.id skip 15 limit 20"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 6 of R. Khan'的节点\nlabel为forum,属性title='Group for Mahmud_of_Ghazni in Raniganj'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为organisation,属性name='Shahid_Rajaee_University'的节点\nlabel为organisation,属性name='Burdwan_Raj_College'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为place,属性name='Islamabad/Rawalpindi,Lahore'的节点\nlabel为place,属性name='Ramadan_City'的节点\nlabel为tag,属性name='Rahsaan_Roland_Kirk'的节点\nlabel为tag,属性name='Mohammad_Reza_Pahlavi'的节点\nlabel为tag,属性name='Rashidun_Caliphate'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找R. Khan管理的论坛的id以及R. Khan的创建日期，限制返回6条结果",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n2.firstname='R.' and n1.title='Wall of R. Khan' return n1.id, n2.creationdate limit 6"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Wall of Gregorio Reyes'的节点\nlabel为forum,属性title='Group for Miguel_de_Cervantes in Rio_de_Janeiro'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为organisation,属性name='Mar_Ivanios_College'的节点\nlabel为organisation,属性name='Andres_Soriano_College'的节点\nlabel为organisation,属性name='Diego_Portales_University'的节点\nlabel为place,属性name='San_Pedro_Garza_García'的节点\nlabel为place,属性name='Campos_dos_Goytacazes'的节点\nlabel为tag,属性name='Henry_Louis_Gates'的节点\nlabel为tag,属性name='John_Eliot_Gardiner'的节点\nlabel为tag,属性name='Jorge_Luis_Borges'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Wall of Gregorio Reyes的管理员的id、论坛标题、管理员的语言、生日、使用的浏览器、性别、论坛id、管理员的邮箱和位置IP，仅返回一条结果。",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n1.title='Wall of Gregorio Reyes' return n2.id, n1.title, n2.language, n2.birthday, n2.browserused, n2.gender, n1.id, n2.email, n2.locationip limit 1"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Wall of Chen Yang'的节点\nlabel为forum,属性title='Wall of Chen Yang'的节点\nlabel为forum,属性title='Wall of Chen Yang'的节点\nlabel为organisation,属性name='Anna_University,_Chennai'的节点\nlabel为organisation,属性name='Coyne_College'的节点\nlabel为tag,属性name='Chen_Dynasty'的节点\nlabel为tag,属性name='Keenan_Wynn'的节点\nlabel为tag,属性name='Michael_Caine'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Wall of Chen Yang的管理员Chen的信息，包括关系的创建日期、管理员的语言、创建日期、邮箱、浏览器、id、生日、名字、论坛id、性别和姓氏",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n2.firstname='Chen' and n1.title='Wall of Chen Yang' return r1.creationdate, n2.language, n2.creationdate, n2.email, n2.browserused, n2.id, n2.birthday, n2.firstname, n1.id, n2.gender, n2.lastname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Dusty_Springfield in Dali'的节点\nlabel为forum,属性title='Group for Chen_Shui-bian in Dar_es_Salaam'的节点\nlabel为forum,属性title='Group for Lindsay_Davenport in Ahmedpur_Sial'的节点\nlabel为organisation,属性name='Chatfield_College'的节点\nlabel为organisation,属性name='Richard_J._Daley_College'的节点\nlabel为organisation,属性name='Sandip_Foundation'的节点\nlabel为tag,属性name='Dusty_Springfield'的节点\nlabel为tag,属性name='Rodney_Dangerfield'的节点\nlabel为tag,属性name='Dan_Fouts'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Dusty_Springfield在Dali的论坛中，姓氏为Chen的管理员的姓名、性别、创建日期、位置IP和ID",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n1.title='Group for Dusty_Springfield in Dali' and n2.firstname='Chen' return n2.lastname, n2.firstname, n2.gender, n2.creationdate, n2.locationip, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 18 of Chen Yang'的节点\nlabel为forum,属性title='Album 18 of Chen Yang'的节点\nlabel为forum,属性title='Album 18 of Chen Yan'的节点\nlabel为organisation,属性name='Anna_University,_Chennai'的节点\nlabel为organisation,属性name='An_Music_School'的节点\nlabel为organisation,属性name='Andres_Soriano_College'的节点\nlabel为place,属性name='Borey_Seang_Nam'的节点\nlabel为tag,属性name='Music_for_18_Musicians'的节点\nlabel为tag,属性name='Chen_Dynasty'的节点\nlabel为tag,属性name='The_Help_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 18 of Chen Yang的管理员中名字为Chen的人的名字，最多返回2个结果",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n2.firstname='Chen' and n1.title='Album 18 of Chen Yang' return n2.firstname limit 2"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Wall of Gheorghe Popescu'的节点\nlabel为forum,属性title='Group for Georg_Wilhelm_Friedrich_Hegel in Tarakan'的节点\nlabel为forum,属性title='Group for Friedrich_Nietzsche in Poznań'的节点\nlabel为organisation,属性name='Adam_Mickiewicz_University_in_Poznań'的节点\nlabel为organisation,属性name='Gheorghe_Zane_University'的节点\nlabel为organisation,属性name='Mihail_Kogălniceanu_University_of_Iaşi'的节点\nlabel为tag,属性name='Paul_I_of_Russia'的节点\nlabel为tag,属性name='Paul_Gascoigne'的节点\nlabel为tag,属性name='Tomáš_Garrigue_Masaryk'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Wall of Gheorghe Popescu的版主Gheorghe的语言、关系创建日期、生日、性别、id、姓氏、使用的浏览器、IP地址以及论坛的标题",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n1.title='Wall of Gheorghe Popescu' and n2.firstname='Gheorghe' return n2.language, r1.creationdate, n2.birthday, n2.gender, n2.id, n2.lastname, n2.browserused, n2.locationip, n1.title"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Wall of Zheng Xu'的节点\nlabel为forum,属性title='Wall of Jun Xu'的节点\nlabel为organisation,属性name='Yuan_Ze_University'的节点\nlabel为organisation,属性name='José_Rizal_University'的节点\nlabel为organisation,属性name='Hangzhou_Dianzi_University'的节点\nlabel为tag,属性name='Jesse_Ventura'的节点\nlabel为tag,属性name='Zakk_Wylde'的节点\nlabel为tag,属性name='Jesse_Jackson'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Wall of Jun Xu的版主信息，包括论坛的id、标题，版主的生日、id和名字",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n1.title='Wall of Jun Xu' return n1.id, n2.birthday, n2.id, n1.title, n2.firstname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 3 of Jun Xu'的节点\nlabel为organisation,属性name='Nihon_University_Junior_College'的节点\nlabel为organisation,属性name='Yuan_Ze_University'的节点\nlabel为organisation,属性name='PC_Jabin_College'的节点\nlabel为tag,属性name='The_Jean_Genie'的节点\nlabel为tag,属性name='Songs_About_Jane'的节点\nlabel为tag,属性name='Jennifer_Jason_Leigh'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Jun的用户作为管理员的Album 3 of Jun Xu论坛的相关信息，包括用户的IP地址、浏览器、性别、语言、姓氏、论坛的创建日期、论坛标题、用户的名字、生日、论坛ID、用户的创建日期和邮箱。",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n2.firstname='Jun' and n1.title='Album 3 of Jun Xu' return n2.locationip, n2.browserused, n2.gender, n2.language, n2.lastname, n1.creationdate, n1.title, n2.firstname, n2.birthday, n1.id, n2.creationdate, n2.email"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 8 of Jun Xu'的节点\nlabel为forum,属性title='Album 28 of Jun Xu'的节点\nlabel为forum,属性title='Album 8 of Jun Chen'的节点\nlabel为organisation,属性name='Yuan_Ze_University'的节点\nlabel为organisation,属性name='José_Rizal_University'的节点\nlabel为organisation,属性name='Hangzhou_Dianzi_University'的节点\nlabel为tag,属性name='Jennifer_Jason_Leigh'的节点\nlabel为tag,属性name='Jeff_Lynne'的节点\nlabel为tag,属性name='Justine_Henin'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Jun且是Album 8 of Jun Xu的管理员的个人的语言、姓氏和论坛标题",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n2.firstname='Jun' and n1.title='Album 8 of Jun Xu' return n2.language, n2.lastname, n1.title"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Jain_Institute_of_Technology'的节点\nlabel为organisation,属性name='Jagran_Institute_of_Communication_and_Management'的节点\nlabel为organisation,属性name='Jagan_Institute_of_Management_Studies'的节点\nlabel为tag,属性name='John_Turner'的节点\nlabel为tag,属性name='The_Jean_Genie'的节点\nlabel为tag,属性name='John_Bunyan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Jun担任管理员的论坛的信息，包括Jun的名、IP地址、关系的创建日期、使用的浏览器、Jun的创建日期、姓、邮箱、论坛的创建日期、性别、语言、论坛的ID、Jun的生日和论坛的标题。",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n2.firstname='Jun' return n2.firstname, n2.locationip, r1.creationdate, n2.browserused, n2.creationdate, n2.lastname, n2.email, n1.creationdate, n2.gender, n2.language, n1.id, n2.birthday, n1.title"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Wall of Zdenek Balcar'的节点\nlabel为forum,属性title='Wall of Zdenek Herzigová'的节点\nlabel为forum,属性title='Album 15 of Zdenek Balcar'的节点\nlabel为organisation,属性name='Gheorghe_Zane_University'的节点\nlabel为organisation,属性name='Zaoksky_Adventist_University'的节点\nlabel为organisation,属性name='Adam_Mickiewicz_University_in_Poznań'的节点\nlabel为tag,属性name='Zakk_Wylde'的节点\nlabel为tag,属性name='Denzel_Washington'的节点\nlabel为tag,属性name='Christian_IX_of_Denmark'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Wall of Zdenek Balcar的版主Zdenek的相关信息，包括关系的创建日期、版主的名、论坛的id、版主的姓、版主的创建日期、版主的邮箱、版主的位置IP、版主的生日、论坛的标题、版主的id、版主的语言、论坛的创建日期、版主的性别和版主使用的浏览器，限制返回15条结果。",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n1.title='Wall of Zdenek Balcar' and n2.firstname='Zdenek' return r1.creationdate, n2.firstname, n1.id, n2.lastname, n2.creationdate, n2.email, n2.locationip, n2.birthday, n1.title, n2.id, n2.language, n1.creationdate, n2.gender, n2.browserused limit 15"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 4 of Zdenek Balcar'的节点\nlabel为forum,属性title='Album 24 of Zdenek Balcar'的节点\nlabel为forum,属性title='Album 14 of Zdenek Balcar'的节点\nlabel为organisation,属性name='Sarajevo_Music_Academy'的节点\nlabel为organisation,属性name='Gheorghe_Zane_University'的节点\nlabel为organisation,属性name='Baku_Academy_of_Music'的节点\nlabel为tag,属性name='The_Barbra_Streisand_Album'的节点\nlabel为tag,属性name='Gangsta_Grillz:_The_Album'的节点\nlabel为tag,属性name='Dirk_Bogarde'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 4 of Zdenek Balcar的管理员的id、标题、生日、邮箱、论坛创建日期、使用的浏览器和性别",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n1.title='Album 4 of Zdenek Balcar' return n1.id, n1.title, n2.birthday, n2.email, n1.creationdate, n2.browserused, n2.gender"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 13 of Zdenek Balcar'的节点\nlabel为forum,属性title='Album 23 of Zdenek Balcar'的节点\nlabel为forum,属性title='Album 14 of Zdenek Balcar'的节点\nlabel为organisation,属性name='Gheorghe_Zane_University'的节点\nlabel为organisation,属性name='Academy_of_Music,_University_of_Zagreb'的节点\nlabel为organisation,属性name='Zaoksky_Adventist_University'的节点\nlabel为person,属性firstname='Zdenek'的节点\nlabel为person,属性firstname='Zdenek'的节点\nlabel为place,属性name='Bab_Ezzouar'的节点\nlabel为tag,属性name='Zakk_Wylde'的节点\nlabel为tag,属性name='The_Barbra_Streisand_Album'的节点\nlabel为tag,属性name='Gangsta_Grillz:_The_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 13 of Zdenek Balcar的管理员Zdenek的姓名、使用的浏览器、id和生日",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n1.title='Album 13 of Zdenek Balcar' and n2.firstname='Zdenek' return n2.firstname, n2.browserused, n2.id, n2.birthday"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Friedrich_Nietzsche in Poznań'的节点\nlabel为organisation,属性name='Gheorghe_Zane_University'的节点\nlabel为organisation,属性name='Zaoksky_Adventist_University'的节点\nlabel为organisation,属性name='Zanjan_University'的节点\nlabel为tag,属性name='Zakk_Wylde'的节点\nlabel为tag,属性name='Zinedine_Zidane'的节点\nlabel为tag,属性name='Glenn_Danzig'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Zdenek管理的论坛的id、语言、论坛标题、Zdenek的姓氏、位置IP、浏览器使用情况以及关系的创建日期，限制返回16条记录",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n2.firstname='Zdenek' return n2.id, n2.language, n1.title, n2.lastname, n2.locationip, n2.browserused, r1.creationdate limit 16"
    }
]