[
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Strawberry_Letter_23'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Cuba发布的评论的创建日期、评论长度、评论id、地点URL、浏览器使用情况和IP地址，限制返回18条记录",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='Cuba' return r1.creationdate, n1.creationdate, n1.length, n1.id, n2.url, n1.browserused, n1.locationip limit 18"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Stephens_College'的节点\nlabel为organisation,属性name='Stanley_Medical_College'的节点\nlabel为organisation,属性name='University_of_Sydney_School_of_Geosciences'的节点\nlabel为place,属性name='Sittwe_District'的节点\nlabel为tag,属性name='Wingspan:_Hits_and_History'的节点\nlabel为tag,属性name='Shel_Silverstein'的节点\nlabel为tag,属性name='Vin_Scully'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找位于斯威士兰的评论的长度、id、位置IP、内容以及斯威士兰的id和关系的创建日期",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='Swaziland' return n2.name, n1.length, n1.id, n1.locationip, n1.content, n2.id, r1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Philippine_Women's_University'的节点\nlabel为organisation,属性name='PAL_Airlines'的节点\nlabel为organisation,属性name='MexicanaLink'的节点\nlabel为tag,属性name='Seventeen_Provinces'的节点\nlabel为tag,属性name='Strawberry_Letter_23'的节点\nlabel为tag,属性name='Dil_Dil_Pakistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n在菲律宾位置下的评论，跳过前7条，返回接下来13条评论的长度、IP地址、位置ID、位置URL、评论ID、使用的浏览器以及关系的创建日期",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='Philippines' return n1.length, n1.locationip, n2.id, n2.url, n1.id, n1.browserused, r1.creationdate skip 7 limit 13"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Sergio_Arboleda_University'的节点\nlabel为organisation,属性name='Chiba_University'的节点\nlabel为organisation,属性name='Servicio_de_Publicaciones'的节点\nlabel为tag,属性name='Strawberry_Letter_23'的节点\nlabel为tag,属性name='Techno_Cumbia'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Cuba发布的评论的浏览器使用情况、IP地址、评论创建日期、内容和评论ID，以及Cuba的ID",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='Cuba' return n1.browserused, n1.locationip, r1.creationdate, n1.content, n1.id, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Anadolu_University'的节点\nlabel为organisation,属性name='Angola_Air_Charter'的节点\nlabel为organisation,属性name='Maulana_Azad_College'的节点\nlabel为place,属性name='Addis_Ababa'的节点\nlabel为tag,属性name='Aceh_Sultanate'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Algeria地点的所有评论的长度、IP地址、id、地点的URL、关系的创建日期、地点名称、评论的创建日期、地点id、评论内容和浏览器使用情况",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='Algeria' return n1.length, n1.locationip, n1.id, n2.url, r1.creationdate, n2.name, n1.creationdate, n2.id, n1.content, n1.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为organisation,属性name='Russian_Sky_Airlines'的节点\nlabel为organisation,属性name='Vladivostok_Air'的节点\nlabel为organisation,属性name='Moscow_Aviation_Institute'的节点\nlabel为place,属性name='Kemerovo_Oblast'的节点\nlabel为place,属性name='Moscow_International_Business_Center'的节点\nlabel为place,属性name='Ivanovo_Oblast'的节点\nlabel为tag,属性name='Odbrana_i_poslednji_dani'的节点\nlabel为tag,属性name='Rocket_to_Russia'的节点\nlabel为tag,属性name='Peter_Bogdanovich'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在俄罗斯发布的评论的内容、使用的浏览器、IP地址、评论的创建日期、位置的ID、评论的长度、位置的名称、位置的URL，按位置名称降序排列，并返回评论的创建日期和ID",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='Russia' return n1.content, n1.browserused, n1.locationip, r1.creationdate, n2.id, n1.length, n2.name, n2.url, n1.creationdate, n1.id order by n2.name desc"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 14 of Arbaaz Ali'的节点\nlabel为forum,属性title='Album 14 of Amjad Islam Ahsan'的节点\nlabel为forum,属性title='Album 17 of Arbaaz Ali'的节点\nlabel为organisation,属性name='Maulana_Azad_College'的节点\nlabel为organisation,属性name='Obirin_Junior_College'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为place,属性name='Jiaganj_Azimganj'的节点\nlabel为place,属性name='Anantapur_district'的节点\nlabel为place,属性name='Addis_Ababa'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\nlabel为tag,属性name='Arif_Mardin'的节点\nlabel为tag,属性name='Azad_Hind'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Azerbaijan位置的评论的id、位置的id、关系的创建日期、位置的名称、评论的IP地址和评论的创建日期，跳过前16条记录，返回接下来的14条记录",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='Azerbaijan' return n1.id, n2.id, r1.creationdate, n2.name, n1.locationip, n1.creationdate skip 16 limit 14"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Sergio_Arboleda_University'的节点\nlabel为organisation,属性name='Diponegoro_University'的节点\nlabel为organisation,属性name='Instituto_Tecnológico_de_Puebla'的节点\nlabel为place,属性name='Distrito_de_Bellavista'的节点\nlabel为place,属性name='San_Pedro_Garza_García'的节点\nlabel为tag,属性name='Pedro_I_of_Brazil'的节点\nlabel为tag,属性name='Paulinho_da_Costa'的节点\nlabel为tag,属性name='Brazilian_military_government'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在巴西的评论的ip地址和长度，以及巴西的id",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='Brazil' return n2.id, n1.locationip, n1.length"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Swiss_German_University'的节点\nlabel为organisation,属性name='Steinbeis-Hochschule_Berlin'的节点\nlabel为organisation,属性name='Technische_Hochschule_Mittelhessen'的节点\nlabel为tag,属性name='East_Germany'的节点\nlabel为tag,属性name='West_Germany'的节点\nlabel为tag,属性name='Live_aus_Berlin'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在德国位置的评论的id、位置IP、地点id、地点URL、评论内容、使用的浏览器和地点名称",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='Germany' return n1.id, n1.locationip, n2.id, n2.url, n1.content, n1.browserused, n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Philippine_Women's_University'的节点\nlabel为organisation,属性name='Airlines_PNG'的节点\nlabel为organisation,属性name='PAL_Airlines'的节点\nlabel为tag,属性name='Dil_Dil_Pakistan'的节点\nlabel为tag,属性name='Peace_Sells'的节点\nlabel为tag,属性name='Electoral_Palatinate'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在菲律宾发布的评论的浏览器使用情况、评论id、地点名称、位置IP、评论长度、评论内容、地点URL、关系创建日期、评论创建日期和地点id，并按地点名称降序排列",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='Philippines' return n1.browserused, n1.id, n2.name, n1.locationip, n1.length, n1.content, n2.url, r1.creationdate, n1.creationdate, n2.id order by n2.name desc"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Yang-En_University'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在中国发表的评论的创建日期、长度、位置URL、IP地址、浏览器使用情况、内容以及中国的ID和名称",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='China' return r1.creationdate, n1.length, n2.url, n1.locationip, n2.id, n1.browserused, n1.content, n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Philippine_Women's_University'的节点\nlabel为organisation,属性name='Philippine_Airlines'的节点\nlabel为organisation,属性name='Instituto_Tecnológico_de_Puebla'的节点\nlabel为tag,属性name='First_Philippine_Republic'的节点\nlabel为tag,属性name='My_Place'的节点\nlabel为tag,属性name='John_I_of_Portugal'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在菲律宾发表的评论的内容、评论的id、创建日期、位置IP、浏览器使用情况、长度，以及菲律宾的位置id、名称和关系的创建日期，并按菲律宾的名称排序",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='Philippines' return n1.content, n2.id, n1.creationdate, n2.url, n1.browserused, n1.locationip, n1.id, n2.name, n1.length, r1.creationdate order by n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Steinbeis-Hochschule_Berlin'的节点\nlabel为organisation,属性name='Swiss_German_University'的节点\nlabel为organisation,属性name='SRH_Hochschule_Berlin'的节点\nlabel为tag,属性name='East_Germany'的节点\nlabel为tag,属性name='Live_aus_Berlin'的节点\nlabel为tag,属性name='West_Germany'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n在德国位置下的评论中，返回前3条评论的IP地址和内容",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='Germany' return n1.locationip, n1.content limit 3"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为organisation,属性name='Cubana_de_Aviación'的节点\nlabel为organisation,属性name='Alberto_Hurtado_University'的节点\nlabel为organisation,属性name='Sergio_Arboleda_University'的节点\nlabel为place,属性name='Distrito_de_Bellavista'的节点\nlabel为place,属性name='Campos_dos_Goytacazes'的节点\nlabel为tag,属性name='Santiago_Ventura_Bertomeu'的节点\nlabel为tag,属性name='Paulinho_da_Costa'的节点\nlabel为tag,属性name='Juan_Bautista_Alvarado'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在巴西位置的评论的创建日期和巴西的位置URL，限制返回20条结果",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='Brazil' return r1.creationdate, n2.url limit 20"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Swiss_German_University'的节点\nlabel为organisation,属性name='Steinbeis-Hochschule_Berlin'的节点\nlabel为organisation,属性name='SRH_Hochschule_Berlin'的节点\nlabel为tag,属性name='East_Germany'的节点\nlabel为tag,属性name='Live_aus_Berlin'的节点\nlabel为tag,属性name='Elmer_Bernstein'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在德国发布的评论的id、位置URL、评论创建日期、评论长度和使用的浏览器信息",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='Germany' return n2.url, n1.id, r1.creationdate, n1.length, n1.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Strawberry_Letter_23'的节点\nlabel为tag,属性name='For_the_Record'的节点\nlabel为tag,属性name='Put_Your_Records_On'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n跳过一条记录，查找在Cuba发布的评论的浏览器使用情况、id、位置IP、内容以及评论的创建日期，限制返回3条记录",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='Cuba' return n1.browserused, n1.id, n1.locationip, n1.content, r1.creationdate skip 1 limit 3"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Swiss_German_University'的节点\nlabel为organisation,属性name='Technische_Universität_Darmstadt'的节点\nlabel为organisation,属性name='Steinbeis-Hochschule_Berlin'的节点\nlabel为tag,属性name='East_Germany'的节点\nlabel为tag,属性name='Live_aus_Berlin'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在德国发布的评论的创建日期、地点的URL、评论长度、地点名称、评论的IP地址和浏览器信息",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='Germany' return r1.creationdate, n2.url, n1.length, n2.name, n1.locationip, n1.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Air_Express_Sweden'的节点\nlabel为organisation,属性name='Air_Sweden'的节点\nlabel为organisation,属性name='SNDT_Women's_University'的节点\nlabel为tag,属性name='Strawberry_Letter_23'的节点\nlabel为tag,属性name='Deion_Sanders'的节点\nlabel为tag,属性name='Shel_Silverstein'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Sweden位置的评论的长度、创建日期、id、使用的浏览器、位置的URL、评论内容和评论的创建日期",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='Sweden' return n1.length, r1.creationdate, n1.id, n1.browserused, n2.url, n1.content, n1.creationdate"
    },
    {
        "instruction": "\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Swaziland地点中的评论的创建日期、id、评论的位置关系的创建日期、地点名称和评论的长度",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='Swaziland' return n1.creationdate, n1.id, r1.creationdate, n2.name, n1.length"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Stockholm_University'的节点\nlabel为organisation,属性name='Swedish_University_of_Agricultural_Sciences'的节点\nlabel为organisation,属性name='Swedish_University_of_Agricultural_Sciences'的节点\nlabel为tag,属性name='Swedish_Pomerania'的节点\nlabel为tag,属性name='Swedish_Empire'的节点\nlabel为tag,属性name='Emanuel_Swedenborg'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在瑞典发表的评论的内容、IP地址、瑞典的URL以及评论的id和内容",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='Sweden' return n2.name, n1.locationip, n2.url, n1.id, n1.content"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Cubana_de_Aviación'的节点\nlabel为organisation,属性name='Sergio_Arboleda_University'的节点\nlabel为organisation,属性name='Arturo_Michelena_University'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Cuba中发布的评论的内容、评论的创建日期、评论的位置IP、评论的长度、评论的id，以及Cuba的URL、id和名称，并按Cuba的名称降序排列。",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='Cuba' return n2.url, n1.content, n2.id, n1.creationdate, r1.creationdate, n1.locationip, n1.id, n1.length, n2.name order by n2.name desc"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Las_Condes_University'的节点\nlabel为organisation,属性name='Sergio_Arboleda_University'的节点\nlabel为organisation,属性name='Mercu_Buana_University'的节点\nlabel为tag,属性name='Straight_Outta_Cashville'的节点\nlabel为tag,属性name='Strawberry_Letter_23'的节点\nlabel为tag,属性name='Various_Positions'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n跳过10个结果，限制返回4个，在Cuba中的评论的位置名称",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='Cuba' return n2.name skip 10 limit 4"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Instituto_Tecnológico_de_Buenos_Aires'的节点\nlabel为organisation,属性name='Servicio_de_Publicaciones'的节点\nlabel为organisation,属性name='Avianca_Brazil'的节点\nlabel为tag,属性name='Pedro_I_of_Brazil'的节点\nlabel为tag,属性name='Brazilian_military_government'的节点\nlabel为tag,属性name='John_I_of_Portugal'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在巴西发表的评论的创建日期、内容、id、使用的浏览器、长度以及地点名称",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='Brazil' return r1.creationdate, n1.content, n1.id, n1.browserused, n1.length, n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Angola_Air_Charter'的节点\nlabel为organisation,属性name='Air_Arabia_Egypt'的节点\nlabel为organisation,属性name='ItAli_Airlines'的节点\nlabel为place,属性name='Addis_Ababa'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Aceh_Sultanate'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Algeria发布的评论的创建日期、位置名称、评论长度、评论内容、使用的浏览器、IP地址、位置ID、位置URL和评论ID",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='Algeria' return r1.creationdate, n2.name, n1.length, n1.creationdate, n1.content, n1.browserused, n1.locationip, n2.id, n2.url, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Zoom_Airlines_Limited'的节点\nlabel为organisation,属性name='Zoom_Airlines_Limited'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在中国发表的评论所使用的浏览器，限制返回20条结果",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='China' return n1.browserused limit 20"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Swiss_German_University'的节点\nlabel为organisation,属性name='Steinbeis-Hochschule_Berlin'的节点\nlabel为organisation,属性name='NetJets_Europe'的节点\nlabel为tag,属性name='East_Germany'的节点\nlabel为tag,属性name='Live_aus_Berlin'的节点\nlabel为tag,属性name='West_Germany'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在德国发布的评论的浏览器使用情况、长度、位置IP、发布日期、评论ID、内容以及德国的位置URL和ID",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='Germany' return n1.browserused, n1.length, n1.locationip, n2.url, n1.creationdate, n1.id, n1.content, n2.name, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Philippine_Women's_University'的节点\nlabel为organisation,属性name='Fundação_Armando_Alvares_Penteado'的节点\nlabel为organisation,属性name='Central_Philippine_University'的节点\nlabel为tag,属性name='Paulinho_da_Costa'的节点\nlabel为tag,属性name='Various_Positions'的节点\nlabel为tag,属性name='Iparhi_Agapi_Edo'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在菲律宾位置下的评论的id、长度以及菲律宾的位置名称和id，限制返回14条结果",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='Philippines' return n1.id, n1.length, n2.name, n2.id limit 14"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Mahmud_of_Ghazni in Raniganj'的节点\nlabel为forum,属性title='Album 12 of Amjad Islam Ahsan'的节点\nlabel为forum,属性title='Album 12 of Ahmad Shah Aman'的节点\nlabel为organisation,属性name='Afghanistan_Public_Policy_Research_Organization'的节点\nlabel为organisation,属性name='Al_Akhawayn_University'的节点\nlabel为organisation,属性name='Maulana_Azad_College'的节点\nlabel为place,属性name='Jiaganj_Azimganj'的节点\nlabel为place,属性name='Addis_Ababa'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Islamic_Courts_Union'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找位于阿富汗的组织的网址和id，限制返回12条结果",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n2.name='Afghanistan' return n1.url, n1.id limit 12"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Genghis_Khan in Asadabad'的节点\nlabel为forum,属性title='Group for Genghis_Khan in Asadabad'的节点\nlabel为forum,属性title='Group for Genghis_Khan in Asadabad'的节点\nlabel为organisation,属性name='Khyber_Afghan_Airlines'的节点\nlabel为organisation,属性name='Bakhtar_Afghan_Airlines'的节点\nlabel为organisation,属性name='Yamal_Airlines'的节点\nlabel为place,属性name='Jiaganj_Azimganj'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Saif_Ali_Khan'的节点\nlabel为tag,属性name='Adil_Shahi_dynasty'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找位于阿富汗的Khyber_Afghan_Airlines的id、网址和名称",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n2.name='Afghanistan' and n1.name='Khyber_Afghan_Airlines' return n1.id, n1.url, n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为forum,属性title='Group for Mahmud_of_Ghazni in Raniganj'的节点\nlabel为organisation,属性name='Al_Akhawayn_University'的节点\nlabel为organisation,属性name='Amman_Arab_University'的节点\nlabel为organisation,属性name='Al-Ahliyya_Amman_University'的节点\nlabel为place,属性name='Addis_Ababa'的节点\nlabel为place,属性name='Jiaganj_Azimganj'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Islamic_Courts_Union'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Arab_League'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找位于阿富汗的组织的URL、阿富汗的ID和URL、组织的ID和名称，并按组织名称排序，跳过前3个结果，返回接下来的6个结果",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n2.name='Afghanistan' return n1.url, n2.id, n2.url, n1.id, n1.name order by n1.name skip 3 limit 6"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Lindsay_Davenport in Ahmedpur_Sial'的节点\nlabel为forum,属性title='Group for Nikolay_Davydenko in Ahmedpur_Sial'的节点\nlabel为organisation,属性name='Pamir_Airways'的节点\nlabel为organisation,属性name='Wimbi_Dira_Airways'的节点\nlabel为organisation,属性name='Siem_Reap_Airways_International'的节点\nlabel为place,属性name='Ratmalana_Airport'的节点\nlabel为place,属性name='Anantapur_district'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Dil_Dil_Pakistan'的节点\nlabel为tag,属性name='Emirate_of_Sicily'的节点\nlabel为tag,属性name='Dominion_of_Pakistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Pamir_Airways的id及其所在地点的名称",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n1.name='Pamir_Airways' return n1.id, n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Mahmud_of_Ghazni in Raniganj'的节点\nlabel为forum,属性title='Group for Lindsay_Davenport in Ahmedpur_Sial'的节点\nlabel为forum,属性title='Group for Nawaz_Sharif in Cali'的节点\nlabel为organisation,属性name='Afghanistan_Public_Policy_Research_Organization'的节点\nlabel为organisation,属性name='Al_Akhawayn_University'的节点\nlabel为organisation,属性name='Al-Ahliyya_Amman_University'的节点\nlabel为place,属性name='Afghanistan'的节点\nlabel为place,属性name='Addis_Ababa'的节点\nlabel为place,属性name='Jiaganj_Azimganj'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Afghanistan'的节点\nlabel为tag,属性name='Democratic_Republic_of_Afghanistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找位于阿富汗的组织所在的地点名称",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n2.name='Afghanistan' return n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Safi_Airways'的节点\nlabel为organisation,属性name='Safiran_Airlines'的节点\nlabel为organisation,属性name='Chabahar_Airlines'的节点\nlabel为place,属性name='Sahiwal_Division'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Beni_Suef'的节点\nlabel为tag,属性name='Emirate_of_Sicily'的节点\nlabel为tag,属性name='S&M_Airlines'的节点\nlabel为tag,属性name='Saif_Ali_Khan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Safi Airways所在的地点名称",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n1.name='Safi_Airways' return n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Nawaz_Sharif in Cali'的节点\nlabel为forum,属性title='Group for Mahmud_of_Ghazni in Raniganj'的节点\nlabel为organisation,属性name='Khalifa_Airways'的节点\nlabel为organisation,属性name='Khyber_Afghan_Airlines'的节点\nlabel为organisation,属性name='Alajnihah_Airways'的节点\nlabel为place,属性name='Ratmalana_Airport'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Kuala_Lumpur'的节点\nlabel为tag,属性name='Wiz_Khalifa'的节点\nlabel为tag,属性name='Umayyad_Caliphate'的节点\nlabel为tag,属性name='Emirate_of_Sicily'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Khalifa_Airways所在的地方的信息，包括该地方的URL、ID以及Khalifa_Airways的ID和URL，同时返回该地方的名称和ID",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n1.name='Khalifa_Airways' and n2.name='Algeria' return n2.url, n1.id, n2.name, n1.url, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为organisation,属性name='Tassili_Airlines'的节点\nlabel为organisation,属性name='Regional_Air_Services_(Tanzania)'的节点\nlabel为organisation,属性name='ItAli_Airlines'的节点\nlabel为place,属性name='Ratmalana_Airport'的节点\nlabel为place,属性name='Pathum_Thani_Province'的节点\nlabel为tag,属性name='Sur_un_air_latino'的节点\nlabel为tag,属性name='Emirate_of_Sicily'的节点\nlabel为tag,属性name='Saadi_dynasty'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Tassili_Airlines的网址及其所在地点的id和名称，同时返回Tassili_Airlines的名称和id",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n1.name='Tassili_Airlines' return n1.url, n2.id, n1.name, n1.id, n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Antinea_Airlines'的节点\nlabel为organisation,属性name='Aerolínea_de_Antioquia'的节点\nlabel为organisation,属性name='Alania_Airlines'的节点\nlabel为place,属性name='Ratmalana_Airport'的节点\nlabel为tag,属性name='Nashville_Skyline'的节点\nlabel为tag,属性name='S&M_Airlines'的节点\nlabel为tag,属性name='This_Place_Hotel'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Antinea_Airlines所在位置的名称",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n1.name='Antinea_Airlines' return n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Andy_Roddick in Ahmedpur_Sial'的节点\nlabel为forum,属性title='Group for Lindsay_Davenport in Ahmedpur_Sial'的节点\nlabel为forum,属性title='Group for Nikolay_Davydenko in Ahmedpur_Sial'的节点\nlabel为organisation,属性name='Avadh_University'的节点\nlabel为organisation,属性name='Maulana_Azad_College'的节点\nlabel为organisation,属性name='Azov_Avia_Airlines'的节点\nlabel为place,属性name='Addis_Ababa'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Anantapur_district'的节点\nlabel为tag,属性name='Adil_Shahi_dynasty'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\nlabel为tag,属性name='International_Energy_Agency'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找位于阿尔及利亚的Star_Aviation组织的网址和阿尔及利亚的id",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n2.name='Algeria' and n1.name='Star_Aviation' return n1.url, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Vytautas in Banda_Aceh'的节点\nlabel为forum,属性title='Group for Vytautas in Banda_Aceh'的节点\nlabel为organisation,属性name='TAAG_Angola_Airlines'的节点\nlabel为organisation,属性name='Angola_Air_Charter'的节点\nlabel为organisation,属性name='Aladia_Airlines'的节点\nlabel为place,属性name='Ratmalana_Airport'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为tag,属性name='Emirate_of_Granada'的节点\nlabel为tag,属性name='Alan_Alda'的节点\nlabel为tag,属性name='In-A-Gadda-Da-Vida'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找TAAG Angola Airlines所在位置Angola的id",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n1.name='TAAG_Angola_Airlines' and n2.name='Angola' return n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Direct_Aero_Services'的节点\nlabel为organisation,属性name='Aeropelican_Air_Services'的节点\nlabel为organisation,属性name='Serviços_Aéreos_Cruzeiro_do_Sul'的节点\nlabel为tag,属性name='Get_Ur_Freak_On'的节点\nlabel为tag,属性name='Subterranean_Jungle'的节点\nlabel为tag,属性name='Get_Buck_in_Here'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Aero_Tropical所在的地方的信息，包括地方的url、id以及Aero_Tropical的名称和id",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n1.name='Aero_Tropical' and n2.name='Angola' return n2.url, n2.id, n1.name, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Luiz_Inácio_Lula_da_Silva in Rio_de_Janeiro'的节点\nlabel为organisation,属性name='Instituto_Tecnológico_de_Oaxaca'的节点\nlabel为organisation,属性name='Universidad_del_Aconcagua'的节点\nlabel为organisation,属性name='Universidad_Argentina_de_la_Empresa'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为place,属性name='San_Pedro_Garza_García'的节点\nlabel为place,属性name='Ciudad_Obregón'的节点\nlabel为tag,属性name='Iparhi_Agapi_Edo'的节点\nlabel为tag,属性name='Al_otro_lado_del_río'的节点\nlabel为tag,属性name='Arantxa_Parra_Santonja'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找位于安哥拉的组织的网址和id，并按安哥拉名称排序",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n2.name='Angola' return n1.url, n1.id, n2.name order by n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Luiz_Inácio_Lula_da_Silva in Rio_de_Janeiro'的节点\nlabel为organisation,属性name='Instituto_Tecnológico_de_Oaxaca'的节点\nlabel为organisation,属性name='Jorge_Amado_University_Center'的节点\nlabel为organisation,属性name='Technological_Institute_of_Ensenada'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为place,属性name='Ciudad_Obregón'的节点\nlabel为tag,属性name='Iparhi_Agapi_Edo'的节点\nlabel为tag,属性name='Aro_Confederacy'的节点\nlabel为tag,属性name='Organisation_of_African_Unity'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找位于安哥拉的组织的id以及安哥拉的名称和网址",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n2.name='Angola' return n2.name, n2.url, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Luiz_Inácio_Lula_da_Silva in Rio_de_Janeiro'的节点\nlabel为forum,属性title='Group for Osama_bin_Laden in Toliara'的节点\nlabel为organisation,属性name='Airlangga_University'的节点\nlabel为organisation,属性name='Private_University_of_Angola'的节点\nlabel为organisation,属性name='Arellano_University'的节点\nlabel为place,属性name='Iloilo_City'的节点\nlabel为place,属性name='Ivanovo_Oblast'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为tag,属性name='Almas_del_Silencio'的节点\nlabel为tag,属性name='Iparhi_Agapi_Edo'的节点\nlabel为tag,属性name='Aro_Confederacy'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Air_Gemini的组织所在的位置的id和名称，位置名称为Angola",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n1.name='Air_Gemini' and n2.name='Angola' return n2.id, n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Luiz_Inácio_Lula_da_Silva in Rio_de_Janeiro'的节点\nlabel为organisation,属性name='Aerolínea_de_Antioquia'的节点\nlabel为organisation,属性name='Línea_Turística_Aereotuy'的节点\nlabel为organisation,属性name='Nordeste_Linhas_Aéreas_Regionais'的节点\nlabel为place,属性name='Anantapur_district'的节点\nlabel为place,属性name='Iloilo_City'的节点\nlabel为place,属性name='Chorrillos_District'的节点\nlabel为tag,属性name='Al_otro_lado_del_río'的节点\nlabel为tag,属性name='La_Isla_Bonita'的节点\nlabel为tag,属性name='Arantxa_Parra_Santonja'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Aeronáutica (Angola)所在地点的名称和id，限制返回10条结果",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n1.name='Aeronáutica_(Angola)' return n1.name, n2.name, n1.id limit 10"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Augustine_of_Hippo in Dazhou'的节点\nlabel为forum,属性title='Group for Miguel_de_Cervantes in Debre_Marqos'的节点\nlabel为forum,属性title='Group for Miguel_de_Cervantes in Rio_de_Janeiro'的节点\nlabel为organisation,属性name='Delgado_Community_College'的节点\nlabel为organisation,属性name='Instituto_Tecnológico_de_Oaxaca'的节点\nlabel为organisation,属性name='Diexim_Expresso'的节点\nlabel为place,属性name='Ciudad_Obregón'的节点\nlabel为place,属性name='Iloilo_City'的节点\nlabel为place,属性name='Pedro_Escobedo'的节点\nlabel为tag,属性name='Iparhi_Agapi_Edo'的节点\nlabel为tag,属性name='Cyber_City_Oedo_808'的节点\nlabel为tag,属性name='Al_otro_lado_del_río'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找位于安哥拉的Diexim_Expresso组织的名称、所在地点的id和名称、组织的网址和id，限制返回8条结果",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n2.name='Angola' and n1.name='Diexim_Expresso' return n1.name, n2.id, n2.name, n1.url, n1.id limit 8"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Radek_Štěpánek in Orlando'的节点\nlabel为forum,属性title='Group for Luiz_Inácio_Lula_da_Silva in Rio_de_Janeiro'的节点\nlabel为forum,属性title='Group for Nikolay_Davydenko in Ahmedpur_Sial'的节点\nlabel为organisation,属性name='Antenor_Orrego_Private_University'的节点\nlabel为organisation,属性name='Aerolínea_de_Antioquia'的节点\nlabel为organisation,属性name='Sundance_Air_Venezuela'的节点\nlabel为place,属性name='Iloilo_City'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为place,属性name='Ciudad_Obregón'的节点\nlabel为tag,属性name='Aro_Confederacy'的节点\nlabel为tag,属性name='Arantxa_Parra_Santonja'的节点\nlabel为tag,属性name='John_Lennon/Plastic_Ono_Band'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找位于安哥拉的SonAir组织的id，并按安哥拉名称排序返回安哥拉的名称",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n2.name='Angola' and n1.name='SonAir' return n1.id, n2.name order by n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Luiz_Inácio_Lula_da_Silva in Rio_de_Janeiro'的节点\nlabel为organisation,属性name='Universidad_Argentina_de_la_Empresa'的节点\nlabel为organisation,属性name='Universidad_del_Aconcagua'的节点\nlabel为organisation,属性name='Arellano_University'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为place,属性name='Ciudad_Obregón'的节点\nlabel为tag,属性name='Aro_Confederacy'的节点\nlabel为tag,属性name='Arantxa_Parra_Santonja'的节点\nlabel为tag,属性name='Iparhi_Agapi_Edo'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找位于安哥拉的组织的url、id以及安哥拉的url和名称，并按安哥拉的名称降序排列",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n2.name='Angola' return n2.url, n2.id, n1.url, n2.name order by n2.name desc"
    }
]