[
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Iran_University_of_Science_and_Technology'的节点\nlabel为organisation,属性name='Iran_University_of_Medical_Sciences'的节点\nlabel为organisation,属性name='Tehran_Psychiatric_Institute'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Ramadan_City'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Islamic_Courts_Union'的节点\nlabel为tag,属性name='United_Arab_Emirates'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在伊朗发布的帖子的创建日期、地点名称、地点URL、帖子语言、图片文件、内容、地点ID、帖子创建日期、帖子ID和位置IP，最多返回4条结果",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Iran' return r1.creationdate, n2.name, n2.url, n1.language, n1.imagefile, n1.content, n2.id, n1.creationdate, n1.id, n1.locationip limit 4"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为forum,属性title='Group for Mahmud_of_Ghazni in Raniganj'的节点\nlabel为forum,属性title='Group for Mustafa_Kemal_Atatürk in Indianapolis'的节点\nlabel为organisation,属性name='Iran_University_of_Science_and_Technology'的节点\nlabel为organisation,属性name='Iran_University_of_Medical_Sciences'的节点\nlabel为organisation,属性name='Iran_Broadcasting_College'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为place,属性name='Ramadan_City'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Dil_Dil_Pakistan'的节点\nlabel为tag,属性name='Islamic_Courts_Union'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在伊朗发布的帖子的详细信息，包括地点的URL和ID，帖子使用的浏览器、图片文件、长度、ID、内容、位置IP以及关系的创建日期",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Iran' return n2.url, n2.id, n1.browserused, n1.imagefile, n1.length, n1.id, n1.content, n1.locationip, r1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Iran_University_of_Medical_Sciences'的节点\nlabel为organisation,属性name='Iran_University_of_Science_and_Technology'的节点\nlabel为organisation,属性name='Iran_Broadcasting_College'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Islamic_Courts_Union'的节点\nlabel为tag,属性name='Dil_Dil_Pakistan'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在伊朗发布的帖子的IP地址、图片文件、创建日期、长度以及该关系的创建日期",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Iran' return n1.locationip, n1.imagefile, n1.creationdate, n1.length, r1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Iran_University_of_Medical_Sciences'的节点\nlabel为organisation,属性name='Iran_University_of_Science_and_Technology'的节点\nlabel为organisation,属性name='Iran_Air_Tours'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为tag,属性name='Iraqi_Kurdistan'的节点\nlabel为tag,属性name='Islamic_Courts_Union'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在伊朗发布的帖子的内容、id、关系的创建日期、帖子的创建日期、图片文件、语言、长度、地点的URL、帖子的IP地址和地点名称",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Iran' return n1.content, n1.id, r1.creationdate, n1.creationdate, n1.imagefile, n1.language, n1.length, n2.url, n1.locationip, n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Mahmud_of_Ghazni in Raniganj'的节点\nlabel为forum,属性title='Group for Genghis_Khan in Asadabad'的节点\nlabel为forum,属性title='Group for Genghis_Khan in Asadabad'的节点\nlabel为organisation,属性name='Iran_University_of_Science_and_Technology'的节点\nlabel为organisation,属性name='Iran_University_of_Medical_Sciences'的节点\nlabel为organisation,属性name='Iran_Air_Tours'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Ramadan_City'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Iraqi_Kurdistan'的节点\nlabel为tag,属性name='Arif_Mardin'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在伊朗发布的所有帖子的图片文件、创建日期、语言、浏览器信息及帖子id，同时返回伊朗的网址信息",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Iran' return n2.url, n1.imagefile, r1.creationdate, n1.language, n1.browserused, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为forum,属性title='Group for Mustafa_Kemal_Atatürk in Indianapolis'的节点\nlabel为forum,属性title='Group for Mahmud_of_Ghazni in Raniganj'的节点\nlabel为organisation,属性name='Iran_University_of_Science_and_Technology'的节点\nlabel为organisation,属性name='Iran_University_of_Medical_Sciences'的节点\nlabel为organisation,属性name='Iran_Broadcasting_College'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Dil_Dil_Pakistan'的节点\nlabel为tag,属性name='Internet_Leaks'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在伊朗发布的帖子的IP地址、图片文件、内容、长度和使用的浏览器信息",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Iran' return n1.locationip, n1.imagefile, n2.name, n1.content, n1.length, n1.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Mahmud_of_Ghazni in Raniganj'的节点\nlabel为forum,属性title='Group for Genghis_Khan in Asadabad'的节点\nlabel为forum,属性title='Group for Genghis_Khan in Asadabad'的节点\nlabel为organisation,属性name='Iran_University_of_Medical_Sciences'的节点\nlabel为organisation,属性name='Iran_University_of_Science_and_Technology'的节点\nlabel为organisation,属性name='Tehran_Psychiatric_Institute'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Islamic_Courts_Union'的节点\nlabel为tag,属性name='Dil_Dil_Pakistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在伊朗发布的帖子的图片文件、帖子id和伊朗的网址",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Iran' return n1.imagefile, n1.id, n2.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Iran_University_of_Science_and_Technology'的节点\nlabel为organisation,属性name='Iran_University_of_Medical_Sciences'的节点\nlabel为organisation,属性name='Iran_Air_Tours'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为tag,属性name='Iraqi_Kurdistan'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在伊朗发布的帖子的内容、帖子的id、地点的id、地点的名称、关系的创建日期以及帖子的语言，最多返回11条结果",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Iran' return n1.content, n2.id, n1.id, n2.name, r1.creationdate, n1.language limit 11"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Iran_University_of_Science_and_Technology'的节点\nlabel为organisation,属性name='Iran_University_of_Medical_Sciences'的节点\nlabel为organisation,属性name='Iran_Air_Tours'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Iraqi_Kurdistan'的节点\nlabel为tag,属性name='Islamic_Courts_Union'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在伊朗发布的帖子的图片文件、使用的浏览器、内容、关系的创建日期、帖子的id和创建日期、地点的url、帖子的长度和语言，以及地点的id和名称。",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Iran' return n1.imagefile, n1.browserused, n2.name, n1.content, r1.creationdate, n1.id, n1.creationdate, n2.url, n1.length, n2.id, n1.language"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Iran_University_of_Medical_Sciences'的节点\nlabel为organisation,属性name='Iran_University_of_Science_and_Technology'的节点\nlabel为organisation,属性name='Iranian_Mental_Health_Research_Network'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为place,属性name='Ramadan_City'的节点\nlabel为tag,属性name='Dil_Dil_Pakistan'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在伊朗发布的帖子的创建日期、语言、地点URL、IP地址、ID、浏览器使用情况、图片文件和创建日期，最多返回12条记录",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Iran' return r1.creationdate, n1.language, n2.url, n1.locationip, n1.id, n1.browserused, n1.imagefile, n1.creationdate limit 12"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 18 of Arjun Irani'的节点\nlabel为forum,属性title='Album 18 of Abdul Rahim Zaland'的节点\nlabel为forum,属性title='Album 18 of Ahmad Rafiq Irama'的节点\nlabel为organisation,属性name='Iran_University_of_Medical_Sciences'的节点\nlabel为organisation,属性name='Tehran_Psychiatric_Institute'的节点\nlabel为organisation,属性name='Iranian_Air_Transport'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为tag,属性name='Dil_Dil_Pakistan'的节点\nlabel为tag,属性name='Paresh_Rawal'的节点\nlabel为tag,属性name='Ahmad_Shah_Durrani'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n跳过18条记录，查找在伊朗发布的一篇帖子的详细信息，包括帖子的语言、长度、创建日期、图片文件，以及伊朗的URL和ID，返回其中一条记录。",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Iran' return n2.url, n1.language, n1.length, n2.id, n1.id, n1.creationdate, n1.imagefile skip 18 limit 1"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Iran_University_of_Science_and_Technology'的节点\nlabel为organisation,属性name='Iran_University_of_Medical_Sciences'的节点\nlabel为organisation,属性name='Iran_Broadcasting_College'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为tag,属性name='Dil_Dil_Pakistan'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在伊朗发布的帖子的创建日期、发布地点、使用的浏览器、语言和IP地址，限制返回10条记录",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Iran' return n1.creationdate, n2.name, n1.browserused, n1.language, n1.locationip limit 10"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Mahmud_of_Ghazni in Raniganj'的节点\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为forum,属性title='Group for Andy_Roddick in Ahmedpur_Sial'的节点\nlabel为organisation,属性name='Iran_University_of_Medical_Sciences'的节点\nlabel为organisation,属性name='Iran_University_of_Science_and_Technology'的节点\nlabel为organisation,属性name='Iran_Broadcasting_College'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为tag,属性name='Iraqi_Kurdistan'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\nlabel为tag,属性name='Zirid_dynasty'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找位于伊朗的前6个帖子的id和伊朗的id",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Iran' return n2.id, n1.id limit 6"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为organisation,属性name='Iran_University_of_Science_and_Technology'的节点\nlabel为organisation,属性name='Iran_University_of_Medical_Sciences'的节点\nlabel为organisation,属性name='Iran_Air_Tours'的节点\nlabel为place,属性name='Ramadan_City'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Iraqi_Kurdistan'的节点\nlabel为tag,属性name='Dil_Dil_Pakistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在伊朗发布的帖子的创建日期、地点URL、图片文件、地点ID、语言和内容",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Iran' return n1.creationdate, n2.url, n1.imagefile, n2.id, n1.locationip, n1.language, n1.content"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为organisation,属性name='Iran_University_of_Medical_Sciences'的节点\nlabel为organisation,属性name='Iran_University_of_Science_and_Technology'的节点\nlabel为organisation,属性name='Shahid_Rajaee_University'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Zirid_dynasty'的节点\nlabel为tag,属性name='Dil_Dil_Pakistan'的节点\nlabel为tag,属性name='Arif_Mardin'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在伊朗发布的所有帖子的长度和伊朗的id",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Iran' return n2.id, n1.length"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Iran_University_of_Science_and_Technology'的节点\nlabel为organisation,属性name='Iran_University_of_Medical_Sciences'的节点\nlabel为organisation,属性name='Tehran_Psychiatric_Institute'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Iraqi_Kurdistan'的节点\nlabel为tag,属性name='Islamic_Courts_Union'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在伊朗发布的帖子的图片文件、位置关系的创建日期、帖子的语言、帖子的创建日期、地点的id、帖子的内容、地点的名称、帖子的位置IP、帖子的id、地点的URL、帖子的长度和使用的浏览器。",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Iran' return n1.imagefile, r1.creationdate, n1.language, n1.creationdate, n2.id, n1.content, n2.name, n1.locationip, n1.id, n2.url, n1.length, n1.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为organisation,属性name='Iran_University_of_Medical_Sciences'的节点\nlabel为organisation,属性name='Iran_University_of_Science_and_Technology'的节点\nlabel为organisation,属性name='Iran_Air_Tours'的节点\nlabel为place,属性name='Ramadan_City'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Iraqi_Kurdistan'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Islamic_Courts_Union'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在伊朗发布的帖子的语言、内容、长度、图片文件、位置IP、创建日期，以及地点的名称、URL和ID，同时返回关系的创建日期",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Iran' return n1.language, n2.name, n2.url, n1.browserused, n2.id, n1.content, n1.length, n1.imagefile, n1.locationip, n1.creationdate, r1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Iran_University_of_Science_and_Technology'的节点\nlabel为organisation,属性name='Iran_University_of_Medical_Sciences'的节点\nlabel为organisation,属性name='Iran_Broadcasting_College'的节点\nlabel为tag,属性name='Iraqi_Kurdistan'的节点\nlabel为tag,属性name='Islamic_Courts_Union'的节点\nlabel为tag,属性name='Dil_Dil_Pakistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在伊朗发布的帖子的位置IP、语言、地点URL、关系创建日期、帖子长度、帖子创建日期和地点ID",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Iran' return n2.name, n1.locationip, n1.language, n2.url, r1.creationdate, n1.length, n1.creationdate, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Iran_University_of_Science_and_Technology'的节点\nlabel为organisation,属性name='Iran_University_of_Medical_Sciences'的节点\nlabel为organisation,属性name='Iran_Air_Tours'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为place,属性name='Ramadan_City'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Dil_Dil_Pakistan'的节点\nlabel为tag,属性name='Iraqi_Kurdistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在伊朗发布的帖子的信息，包括地点名称、帖子id、创建日期、使用的浏览器、帖子长度、位置IP、地点id、帖子内容、关系创建日期、地点URL和帖子图片文件，并按地点名称降序排列。",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Iran' return n2.name, n1.id, n1.creationdate, n1.browserused, n1.length, n1.locationip, n2.id, n1.content, r1.creationdate, n2.url, n1.imagefile order by n2.name desc"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为forum,属性title='Album 1 of Nikhil Irani'的节点\nlabel为forum,属性title='Group for Andy_Roddick in Ahmedpur_Sial'的节点\nlabel为organisation,属性name='Iran_University_of_Medical_Sciences'的节点\nlabel为organisation,属性name='Iran_University_of_Science_and_Technology'的节点\nlabel为organisation,属性name='Iran_Broadcasting_College'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Dil_Dil_Pakistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在伊朗发布的帖子的IP地址、id、图片文件、发布日期、地点的URL和使用的浏览器，限制返回9条记录",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Iran' return n1.locationip, n1.id, n1.imagefile, r1.creationdate, n2.url, n1.browserused limit 9"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Iran_University_of_Medical_Sciences'的节点\nlabel为organisation,属性name='Iran_University_of_Science_and_Technology'的节点\nlabel为organisation,属性name='Tehran_Psychiatric_Institute'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Ramadan_City'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\nlabel为tag,属性name='Dil_Dil_Pakistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在伊朗发布的帖子的信息，包括使用的浏览器、语言、位置URL、长度、创建日期、帖子ID、图片文件、关联关系的创建日期、IP地址和内容，按位置名称降序排列，限制返回3条记录。",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Iran' return n1.browserused, n2.name, n1.language, n2.url, n1.length, n1.creationdate, n1.id, n1.imagefile, r1.creationdate, n1.locationip, n1.content, n2.id order by n2.name desc limit 3"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 17 of Arjun Irani'的节点\nlabel为forum,属性title='Album 17 of Ahmad Rafiq Irama'的节点\nlabel为forum,属性title='Album 17 of Amjad Islam Ahsan'的节点\nlabel为organisation,属性name='Iran_University_of_Medical_Sciences'的节点\nlabel为organisation,属性name='Iranian_Air_Transport'的节点\nlabel为organisation,属性name='Iran_Air_Tours'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为place,属性name='Ramadan_City'的节点\nlabel为tag,属性name='Dil_Dil_Pakistan'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Iparhi_Agapi_Edo'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在伊朗发布的帖子的图片文件、位置IP、创建日期和内容，返回17条记录",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Iran' return n1.imagefile, n2.id, n1.locationip, n1.creationdate, n1.content limit 17"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Iran_University_of_Science_and_Technology'的节点\nlabel为organisation,属性name='Iran_University_of_Medical_Sciences'的节点\nlabel为organisation,属性name='Iran_Broadcasting_College'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Dil_Dil_Pakistan'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在伊朗发布的帖子的信息，包括位置的id、关系的创建日期、位置的名称、帖子的IP地址、帖子的id、内容、长度、图片文件、创建日期和使用的浏览器。",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Iran' return n2.id, r1.creationdate, n2.name, n1.locationip, n1.id, n1.content, n1.length, n1.imagefile, n1.creationdate, n1.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为forum,属性title='Group for Nikita_Khrushchev in Rahim_Yar_Khan'的节点\nlabel为forum,属性title='Group for Mahmud_of_Ghazni in Raniganj'的节点\nlabel为organisation,属性name='Iran_University_of_Medical_Sciences'的节点\nlabel为organisation,属性name='Iran_University_of_Science_and_Technology'的节点\nlabel为organisation,属性name='Iran_Broadcasting_College'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为tag,属性name='Dil_Dil_Pakistan'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Iparhi_Agapi_Edo'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在伊朗发布的帖子的语言、IP地址和图片文件",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Iran' return n1.language, n1.locationip, n1.imagefile"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Iran_University_of_Science_and_Technology'的节点\nlabel为organisation,属性name='Iran_University_of_Medical_Sciences'的节点\nlabel为organisation,属性name='Tehran_Psychiatric_Institute'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在伊朗发布的帖子的IP地址、位置关系的创建日期、帖子的创建日期、图片文件、语言、帖子ID、地点ID、帖子长度、地点名称、地点URL以及浏览器使用情况，限制返回19条记录。",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Iran' return n1.locationip, r1.creationdate, n1.creationdate, n1.imagefile, n1.language, n1.id, n2.id, n1.length, n2.name, n2.url, n1.browserused limit 19"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为forum,属性title='Group for Jawaharlal_Nehru in Rahim_Yar_Khan'的节点\nlabel为forum,属性title='Group for Mahmud_of_Ghazni in Raniganj'的节点\nlabel为organisation,属性name='Iran_University_of_Science_and_Technology'的节点\nlabel为organisation,属性name='Iran_Air_Tours'的节点\nlabel为organisation,属性name='Iran_University_of_Medical_Sciences'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Iran'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Iraqi_Kurdistan'的节点\nlabel为tag,属性name='Ahmad_Shah_Durrani'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在伊朗发布的所有帖子的内容、创建日期、图片文件、id、使用的浏览器，并返回伊朗的url、名称和id，按伊朗名称降序排列。",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Iran' return n2.url, n2.name, n2.id, n1.content, n1.creationdate, n1.imagefile, n1.id, n1.browserused order by n2.name desc"
    },
    {
        "instruction": "\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Shweta创建的评论的创建日期、评论id、创建者的邮箱、名字、姓氏、评论内容、位置IP、创建者的创建日期、浏览器使用情况、评论长度以及创建者的生日",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Shweta' return r1.creationdate, n1.id, n2.email, n2.firstname, n2.lastname, n1.creationdate, n1.content, n2.locationip, n2.creationdate, n1.browserused, n1.length, n2.birthday"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Allen_University'的节点\nlabel为organisation,属性name='Anna_University'的节点\nlabel为tag,属性name='Alan_Alda'的节点\nlabel为tag,属性name='Alan_Ladd'的节点\nlabel为tag,属性name='Adrian_Edmondson'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由名为Alexander的人创建的评论，返回评论者的名、评论的长度、创建关系的日期、评论者的邮箱、评论的创建日期、评论的位置IP、评论者的姓、评论使用的浏览器、评论者的生日和性别",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Alexander' return n2.firstname, n1.length, r1.creationdate, n2.email, n1.creationdate, n1.locationip, n2.lastname, n1.browserused, n2.birthday, n2.gender"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Allen_University'的节点\nlabel为organisation,属性name='Jorge_Amado_University_Center'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为place,属性name='Anantapur_district'的节点\nlabel为tag,属性name='Adrian_Edmondson'的节点\nlabel为tag,属性name='Alan_Alda'的节点\nlabel为tag,属性name='Alan_Ladd'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由名为Alexander的人创建的评论的id、位置IP、创建日期、内容，以及该人的姓氏、id、语言、生日、性别，同时返回关系的创建日期，限制结果为5条。",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Alexander' return n1.id, n2.lastname, n2.id, n1.locationip, n1.creationdate, n1.content, n2.language, r1.creationdate, n2.firstname, n2.birthday, n2.creationdate, n2.gender limit 5"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Deen_Dayal_Upadhyaya_College'的节点\nlabel为organisation,属性name='Addis_Ababa_University'的节点\nlabel为organisation,属性name='Addis_Continental_Institute_of_Public_Health'的节点\nlabel为place,属性name='Addis_Ababa'的节点\nlabel为tag,属性name='Alan_Ladd'的节点\nlabel为tag,属性name='Azad_Hind'的节点\nlabel为tag,属性name='André_Gide'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由名为Aad De的人创建的评论的相关信息，包括评论的长度、内容、创建日期、位置IP，以及该人的性别、电子邮件、生日、姓氏、创建日期、使用的语言、浏览器和ID。",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Aad De' return n2.gender, n2.email, n2.birthday, n2.lastname, n2.creationdate, n1.length, n2.language, n1.content, n2.browserused, n1.creationdate, n2.locationip, n1.locationip, r1.creationdate, n2.firstname, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Jamie_Lee_Curtis'的节点\nlabel为tag,属性name='Christine_Sixteen'的节点\nlabel为tag,属性name='Chris_Sabin'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由名为Chris的人创建的评论的性别、名字、创建日期、评论的IP地址、长度、浏览器、评论ID、邮箱、生日、IP地址和创建日期，跳过前11条记录，返回接下来的20条记录。",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Chris' return n2.gender, n2.firstname, r1.creationdate, n1.locationip, n2.birthday, n1.length, n1.browserused, n2.locationip, n1.id, n2.email, n2.creationdate skip 11 limit 20"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Sergio_Arboleda_University'的节点\nlabel为organisation,属性name='WebJet_Linhas_Aéreas'的节点\nlabel为organisation,属性name='Fundação_Armando_Alvares_Penteado'的节点\nlabel为tag,属性name='Pedro_I_of_Brazil'的节点\nlabel为tag,属性name='John_VI_of_Portugal'的节点\nlabel为tag,属性name='Brazilian_military_government'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Emperor of Brazil创建的评论的长度、创建日期和使用的浏览器，以及Emperor of Brazil的IP地址、性别、ID、生日、语言和姓氏",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Emperor of Brazil' return n1.length, n2.locationip, n2.firstname, n2.gender, n2.id, n2.birthday, n1.creationdate, n1.browserused, n2.language, n2.lastname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='SNDT_Women's_University'的节点\nlabel为organisation,属性name='SNDT_Women's_University'的节点\nlabel为organisation,属性name='Servicio_de_Publicaciones'的节点\nlabel为tag,属性name='Profiles'的节点\nlabel为tag,属性name='Pedro_I_of_Brazil'的节点\nlabel为tag,属性name='Strawberry_Letter_23'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Emperor of Brazil创建的评论的性别、浏览器使用情况、姓氏、位置IP、评论长度、创建日期、电子邮件、位置IP、语言、评论ID、评论内容、生日和浏览器使用情况",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Emperor of Brazil' return n2.gender, n2.browserused, n2.lastname, n2.locationip, n1.length, n2.creationdate, n1.creationdate, n2.email, n1.locationip, n2.language, n1.id, n1.content, n2.birthday, n1.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Sergio_Arboleda_University'的节点\nlabel为organisation,属性name='Fundação_Armando_Alvares_Penteado'的节点\nlabel为organisation,属性name='Brazilian_Naval_School'的节点\nlabel为tag,属性name='Pedro_I_of_Brazil'的节点\nlabel为tag,属性name='Brazilian_military_government'的节点\nlabel为tag,属性name='John_VI_of_Portugal'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Emperor of Brazil创建的评论及其相关信息，包括评论者的姓名、邮箱、浏览器、id、创建日期，评论的id、位置IP、内容、长度、使用的浏览器，以及评论者的性别和语言。",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Emperor of Brazil' return n2.firstname, n2.lastname, n2.email, n2.browserused, n2.id, r1.creationdate, n2.creationdate, n1.id, n1.locationip, n2.locationip, n1.content, n2.language, n1.length, n2.gender, n1.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Rafael_Nadal in Visonta'的节点\nlabel为organisation,属性name='Sergio_Arboleda_University'的节点\nlabel为organisation,属性name='Jorge_Amado_University_Center'的节点\nlabel为organisation,属性name='Andres_Soriano_College'的节点\nlabel为place,属性name='Antón_Lizardo'的节点\nlabel为place,属性name='João_Monlevade'的节点\nlabel为tag,属性name='Dario_Argento'的节点\nlabel为tag,属性name='Adrian_Edmondson'的节点\nlabel为tag,属性name='John_Eliot_Gardiner'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Alejandro的人创建的评论的id",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Alejandro' return n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Perimeter_Aviation'的节点\nlabel为organisation,属性name='Dhamar_University'的节点\nlabel为organisation,属性name='Jamia_Hamdard'的节点\nlabel为person,属性firstname='Daouda Malam'的节点\nlabel为person,属性firstname='Daouda Malam'的节点\nlabel为place,属性name='Dar_es_Salaam'的节点\nlabel为tag,属性name='Long_Tall_Sally'的节点\nlabel为tag,属性name='Long_Distance_Runaround'的节点\nlabel为tag,属性name='Long_Distance_Voyager'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Daouda Malam创建的评论的长度",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Daouda Malam' return n1.length"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Arturo_Prat_University'的节点\nlabel为organisation,属性name='Paul_Sabatier_University'的节点\nlabel为organisation,属性name='Ayit_Aviation_and_Tourism'的节点\nlabel为tag,属性name='Adam_Lambert'的节点\nlabel为tag,属性name='Peter_Abelard'的节点\nlabel为tag,属性name='Marv_Albert'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由名为Albert的人创建的评论的详细信息，包括评论的创建日期、内容、长度、位置IP和浏览器使用情况，以及创建者的IP位置、语言、性别、生日、姓氏、名字和电子邮件。",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Albert' return n2.locationip, r1.creationdate, n2.id, n2.language, n2.gender, n1.creationdate, n2.lastname, n1.content, n2.browserused, n1.browserused, n2.firstname, n1.length, n2.birthday, n1.locationip, n2.email"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Arturo_Prat_University'的节点\nlabel为organisation,属性name='Alberto_Hurtado_University'的节点\nlabel为organisation,属性name='Alberta_Citylink'的节点\nlabel为place,属性name='Ann_Arbor'的节点\nlabel为tag,属性name='Adam_Lambert'的节点\nlabel为tag,属性name='Peter_Abelard'的节点\nlabel为tag,属性name='Michael_Apted'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Albert的人创建的评论的详细信息，包括他的姓氏、位置IP、评论的创建日期、关系的创建日期、使用的浏览器、评论的ID、内容、长度、性别和使用的浏览器",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Albert' return n2.lastname, n2.firstname, n2.locationip, n1.creationdate, r1.creationdate, n1.browserused, n1.id, n1.content, n1.length, n2.gender, n2.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Arturo_Prat_University'的节点\nlabel为organisation,属性name='Paul_Sabatier_University'的节点\nlabel为organisation,属性name='Jorge_Amado_University_Center'的节点\nlabel为place,属性name='Anantapur_district'的节点\nlabel为tag,属性name='Peter_Abelard'的节点\nlabel为tag,属性name='Alan_Ladd'的节点\nlabel为tag,属性name='Marv_Albert'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Albert的人创建的评论的id、创建日期、语言和位置IP，以及评论的创建日期",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Albert' return n2.id, n2.creationdate, n2.language, n2.locationip, r1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Adam_Lambert'的节点\nlabel为tag,属性name='Peter_Abelard'的节点\nlabel为tag,属性name='Marv_Albert'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由名为Albert的人创建的评论的详细信息，包括评论者的语言、电子邮件、评论的创建日期、使用的浏览器、评论者的创建日期、名字、评论者ID、评论ID和评论长度。",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Albert' return n2.language, n2.email, n1.creationdate, n1.browserused, n2.browserused, n2.creationdate, n2.firstname, n2.id, n1.id, n1.length"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Allen_University'的节点\nlabel为organisation,属性name='Adamson_University'的节点\nlabel为organisation,属性name='Bidhan_Chandra_College,_Asansol'的节点\nlabel为place,属性name='Anantapur_district'的节点\nlabel为tag,属性name='Adrian_Edmondson'的节点\nlabel为tag,属性name='Alan_Alda'的节点\nlabel为tag,属性name='Alan_Ladd'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由名为Alexander的人创建的评论的内容、长度、位置IP，以及该人的性别、ID、名、浏览器使用情况、创建日期和语言，同时返回关系的创建日期和评论的ID。",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Alexander' return n2.gender, n2.id, n2.firstname, n2.browserused, n2.creationdate, n1.content, n2.language, r1.creationdate, n1.id, n2.locationip, n1.locationip, n1.length"
    }
]