[
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Miguel_de_Cervantes in Rio_de_Janeiro'的节点\nlabel为forum,属性title='Group for Luiz_Inácio_Lula_da_Silva in Rio_de_Janeiro'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为organisation,属性name='Fundação_Armando_Alvares_Penteado'的节点\nlabel为organisation,属性name='Jorge_Amado_University_Center'的节点\nlabel为organisation,属性name='Universidad_Argentina_de_la_Empresa'的节点\nlabel为place,属性name='http://maps.google.com/maps?ll=25.530889,69.017306&spn=0.01,0.01&t=m&q=25.530889,69.017306'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为place,属性name='San_Pedro_Garza_García'的节点\nlabel为tag,属性name='Arantxa_Sánchez_Vicario'的节点\nlabel为tag,属性name='Martín_Vassallo_Argüello'的节点\nlabel为tag,属性name='Arantxa_Parra_Santonja'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找位于阿根廷的组织的网址和阿根廷的网址",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n2.name='Argentina' return n2.url, n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Luiz_Inácio_Lula_da_Silva in Rio_de_Janeiro'的节点\nlabel为forum,属性title='Group for Miguel_de_Cervantes in Rio_de_Janeiro'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为organisation,属性name='Líneas_Aéreas_Privadas_Argentinas'的节点\nlabel为organisation,属性name='Ándalus_Líneas_Aéreas'的节点\nlabel为organisation,属性name='Aerolíneas_Argentinas'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为place,属性name='Los_Angeles'的节点\nlabel为place,属性name='Ciudad_Obregón'的节点\nlabel为tag,属性name='Al_otro_lado_del_río'的节点\nlabel为tag,属性name='Arantxa_Sánchez_Vicario'的节点\nlabel为tag,属性name='Las_Palabras_de_Amor'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找组织Líneas Aéreas Privadas Argentinas位于阿根廷的信息，返回组织和地点的id、url及组织名称，按组织名称降序排列，限制结果为18条",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n1.name='Líneas_Aéreas_Privadas_Argentinas' and n2.name='Argentina' return n1.id, n2.url, n1.url, n2.id, n1.name order by n1.name desc limit 18"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Luiz_Inácio_Lula_da_Silva in Rio_de_Janeiro'的节点\nlabel为forum,属性title='Group for Miguel_de_Cervantes in Rio_de_Janeiro'的节点\nlabel为organisation,属性name='Universidad_Argentina_de_la_Empresa'的节点\nlabel为organisation,属性name='Instituto_Tecnológico_de_Oaxaca'的节点\nlabel为organisation,属性name='Universidad_del_Aconcagua'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为place,属性name='San_Pedro_Garza_García'的节点\nlabel为place,属性name='Antón_Lizardo'的节点\nlabel为tag,属性name='Arantxa_Sánchez_Vicario'的节点\nlabel为tag,属性name='Iparhi_Agapi_Edo'的节点\nlabel为tag,属性name='Al_otro_lado_del_río'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找位于阿根廷的组织的id、名称、网址，并按组织名称降序排列，同时返回阿根廷的网址",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n2.name='Argentina' return n1.id, n1.name, n1.url, n2.url order by n1.name desc"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为organisation,属性name='CATA_Línea_Aérea'的节点\nlabel为organisation,属性name='Líneas_Aéreas_Azteca'的节点\nlabel为organisation,属性name='Aerolínea_de_Antioquia'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为place,属性name='Ratmalana_Airport'的节点\nlabel为place,属性name='San_Pedro_Garza_García'的节点\nlabel为tag,属性name='Arantxa_Sánchez_Vicario'的节点\nlabel为tag,属性name='Canto_della_Terra'的节点\nlabel为tag,属性name='Arantxa_Parra_Santonja'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找CATA_Línea_Aérea所在位置阿根廷的网址",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n1.name='CATA_Línea_Aérea' and n2.name='Argentina' return n2.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Luiz_Inácio_Lula_da_Silva in Rio_de_Janeiro'的节点\nlabel为organisation,属性name='Delgado_Community_College'的节点\nlabel为organisation,属性name='ALMA_de_México'的节点\nlabel为organisation,属性name='SETE_Linhas_Aéreas'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为place,属性name='Los_Angeles'的节点\nlabel为place,属性name='San_Pedro_Garza_García'的节点\nlabel为tag,属性name='Al_otro_lado_del_río'的节点\nlabel为tag,属性name='Diosdado_Macapagal'的节点\nlabel为tag,属性name='Dario_Argento'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找位于阿根廷的组织LADE的网址、组织名称、组织id，并按组织名称排序，返回前19条结果",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n2.name='Argentina' and n1.name='LADE' return n1.url, n2.name, n1.name, n1.id order by n1.name limit 19"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Luiz_Inácio_Lula_da_Silva in Rio_de_Janeiro'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为organisation,属性name='Universidad_Argentina_de_la_Empresa'的节点\nlabel为organisation,属性name='Universidad_del_Aconcagua'的节点\nlabel为organisation,属性name='Universidad_Autónoma_Agraria_Antonio_Narro'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为place,属性name='San_Pedro_Garza_García'的节点\nlabel为tag,属性name='Martín_Vassallo_Argüello'的节点\nlabel为tag,属性name='Arantxa_Sánchez_Vicario'的节点\nlabel为tag,属性name='Busca_una_mujer'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找位于阿根廷的组织的URL和阿根廷的名称",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n2.name='Argentina' return n2.name, n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为organisation,属性name='LAN_Argentina'的节点\nlabel为organisation,属性name='Líneas_Aéreas_Privadas_Argentinas'的节点\nlabel为organisation,属性name='Ándalus_Líneas_Aéreas'的节点\nlabel为place,属性name='Larkana_District'的节点\nlabel为place,属性name='San_Pedro_Garza_García'的节点\nlabel为place,属性name='Antón_Lizardo'的节点\nlabel为tag,属性name='Arantxa_Sánchez_Vicario'的节点\nlabel为tag,属性name='Arantxa_Parra_Santonja'的节点\nlabel为tag,属性name='Virginia_Ruano_Pascual'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找LAN_Argentina所在位置的信息，包括位置的id、网址和名称，以及LAN_Argentina的网址",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n1.name='LAN_Argentina' return n2.id, n2.url, n2.name, n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Luiz_Inácio_Lula_da_Silva in Rio_de_Janeiro'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为organisation,属性name='Sol_Líneas_Aéreas'的节点\nlabel为organisation,属性name='Sol_Linhas_Aéreas'的节点\nlabel为organisation,属性name='Ándalus_Líneas_Aéreas'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为place,属性name='Los_Angeles'的节点\nlabel为place,属性name='Ciudad_Obregón'的节点\nlabel为tag,属性name='Al_otro_lado_del_río'的节点\nlabel为tag,属性name='Arantxa_Sánchez_Vicario'的节点\nlabel为tag,属性name='In_Search_of_Sunrise_5:_Los_Angeles'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Sol_Líneas_Aéreas位于阿根廷的组织和地点的URL、组织名称和地点ID，并按组织名称排序，限制结果为9条记录",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n1.name='Sol_Líneas_Aéreas' and n2.name='Argentina' return n2.url, n1.url, n1.name, n2.id order by n1.name limit 9"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为organisation,属性name='Ándalus_Líneas_Aéreas'的节点\nlabel为organisation,属性name='Andes_Líneas_Aéreas'的节点\nlabel为organisation,属性name='Dinar_Líneas_Aéreas'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为tag,属性name='Al_otro_lado_del_río'的节点\nlabel为tag,属性name='Younes_El_Aynaoui'的节点\nlabel为tag,属性name='Antonio_López_de_Santa_Anna'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Andes_Líneas_Aéreas所在地点的网址，以及该组织的名称和id",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n1.name='Andes_Líneas_Aéreas' return n2.url, n1.name, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Silver_Sky_Airlines'的节点\nlabel为organisation,属性name='Isles_of_Scilly_Skybus'的节点\nlabel为organisation,属性name='Siem_Reap_Airways_International'的节点\nlabel为tag,属性name='S&M_Airlines'的节点\nlabel为tag,属性name='Welcome_to_Sky_Valley'的节点\nlabel为tag,属性name='Nashville_Skyline'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Silver_Sky_Airlines的网址、id和名称，以及它所在地点的网址、名称和id",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n1.name='Silver_Sky_Airlines' return n1.url, n1.id, n1.name, n2.url, n2.name, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Luiz_Inácio_Lula_da_Silva in Rio_de_Janeiro'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为organisation,属性name='Dinar_Líneas_Aéreas'的节点\nlabel为organisation,属性name='Ándalus_Líneas_Aéreas'的节点\nlabel为organisation,属性name='Andes_Líneas_Aéreas'的节点\nlabel为place,属性name='Pinar_del_Río'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为tag,属性name='Al_otro_lado_del_río'的节点\nlabel为tag,属性name='Dónde_Están_los_Ladrones?'的节点\nlabel为tag,属性name='Las_Palabras_de_Amor'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Dinar_Líneas_Aéreas所在的位置信息，返回组织名称、位置id和位置名称，并按组织名称降序排列",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n1.name='Dinar_Líneas_Aéreas' and n2.name='Argentina' return n1.name, n2.id, n2.name order by n1.name desc"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Luiz_Inácio_Lula_da_Silva in Rio_de_Janeiro'的节点\nlabel为organisation,属性name='Instituto_Tecnológico_de_Oaxaca'的节点\nlabel为organisation,属性name='Aerolínea_de_Antioquia'的节点\nlabel为organisation,属性name='Universidad_del_Aconcagua'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为place,属性name='Iloilo_City'的节点\nlabel为place,属性name='Ciudad_Obregón'的节点\nlabel为tag,属性name='Al_otro_lado_del_río'的节点\nlabel为tag,属性name='Orinoco_Flow'的节点\nlabel为tag,属性name='Busca_una_mujer'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Aerochaco所在地点的URL，Aerochaco的名称、URL、ID以及该地点的ID",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n1.name='Aerochaco' return n2.url, n1.name, n1.url, n1.id, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Australian_College_of_Natural_Medicine'的节点\nlabel为organisation,属性name='Australian_College_of_Natural_Medicine'的节点\nlabel为organisation,属性name='Australian_College_of_Natural_Medicine'的节点\nlabel为tag,属性name='United_States_Virgin_Islands'的节点\nlabel为tag,属性name='Somewhere_in_England'的节点\nlabel为tag,属性name='Seventeen_Provinces'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找位于澳大利亚的组织的id、组织的网址、地点的名称、地点的id和地点的网址，并按地点名称排序，限制结果为8条记录",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n2.name='Australia' return n1.id, n2.url, n2.name, n2.id, n1.url order by n2.name limit 8"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Australian_National_Centre_for_the_Public_Awareness_of_Science'的节点\nlabel为organisation,属性name='Australian_College_of_Natural_Medicine'的节点\nlabel为organisation,属性name='Australian_College_of_Natural_Medicine'的节点\nlabel为tag,属性name='United_States_Virgin_Islands'的节点\nlabel为tag,属性name='Somewhere_in_England'的节点\nlabel为tag,属性name='International_Energy_Agency'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找位于澳大利亚的组织的网址、id和名称",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n2.name='Australia' return n1.url, n1.id, n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Lindsay_Davenport in Ahmedpur_Sial'的节点\nlabel为organisation,属性name='East-West_Airlines_(Australia)'的节点\nlabel为organisation,属性name='Australian_air_Express'的节点\nlabel为organisation,属性name='Silver_Sky_Airlines'的节点\nlabel为place,属性name='Ratmalana_Airport'的节点\nlabel为tag,属性name='S&M_Airlines'的节点\nlabel为tag,属性name='Wings_over_America'的节点\nlabel为tag,属性name='Destination_Anywhere'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找位于澳大利亚的Skywest_Airlines的组织和地点的URL及地点的ID",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n2.name='Australia' and n1.name='Skywest_Airlines' return n2.url, n1.url, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='University_of_Western_Australia'的节点\nlabel为organisation,属性name='Blue_Mountains_International_Hotel_Management_School'的节点\nlabel为organisation,属性name='Webster_University_Vienna'的节点\nlabel为place,属性name='Freiburg_im_Breisgau'的节点\nlabel为place,属性name='http://maps.google.com/maps?ll=25.530889,69.017306&spn=0.01,0.01&t=m&q=25.530889,69.017306'的节点\nlabel为tag,属性name='British_Virgin_Islands'的节点\nlabel为tag,属性name='Somewhere_in_England'的节点\nlabel为tag,属性name='United_States_Virgin_Islands'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Virgin Blue所在的位置名称和其网址，已知位置名称为Australia",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n1.name='Virgin_Blue' and n2.name='Australia' return n2.name, n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='City_Star_Airlines'的节点\nlabel为organisation,属性name='City_Star_Airlines'的节点\nlabel为organisation,属性name='AlphaJet_Airlines'的节点\nlabel为place,属性name='http://maps.google.com/maps?ll=25.530889,69.017306&spn=0.01,0.01&t=m&q=25.530889,69.017306'的节点\nlabel为place,属性name='Ramadan_City'的节点\nlabel为place,属性name='Ratmalana_Airport'的节点\nlabel为tag,属性name='Destination_Anywhere'的节点\nlabel为tag,属性name='Recovering_the_Satellites'的节点\nlabel为tag,属性name='At_San_Quentin'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Jetstar Airways所在地点的id、名称和地点的URL，限制返回3条结果",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n1.name='Jetstar_Airways' return n1.id, n1.name, n2.url limit 3"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Kendell_Airlines'的节点\nlabel为organisation,属性name='Australian_air_Express'的节点\nlabel为organisation,属性name='East-West_Airlines_(Australia)'的节点\nlabel为place,属性name='Wilayah_Persekutuan_Kuala_Lumpur'的节点\nlabel为tag,属性name='Somewhere_in_England'的节点\nlabel为tag,属性name='Destination_Anywhere'的节点\nlabel为tag,属性name='Emirate_of_Granada'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Kendell_Airlines的组织位于Australia的地点名称和该组织的URL",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n1.name='Kendell_Airlines' and n2.name='Australia' return n2.name, n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Australian_air_Express'的节点\nlabel为organisation,属性name='Trans_Australia_Airlines'的节点\nlabel为organisation,属性name='East-West_Airlines_(Australia)'的节点\nlabel为place,属性name='Ratmalana_Airport'的节点\nlabel为tag,属性name='Wings_over_America'的节点\nlabel为tag,属性name='S&M_Airlines'的节点\nlabel为tag,属性name='United_States_Virgin_Islands'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找位于澳大利亚的Impulse_Airlines的id、网址，以及澳大利亚的id、网址和名称，并按澳大利亚的名称降序排列",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n2.name='Australia' and n1.name='Impulse_Airlines' return n1.id, n1.url, n2.url, n2.id, n2.name, n1.name order by n2.name desc"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Sunshine_Express_Airlines'的节点\nlabel为organisation,属性name='East-West_Airlines_(Australia)'的节点\nlabel为organisation,属性name='Australian_air_Express'的节点\nlabel为tag,属性name='S&M_Airlines'的节点\nlabel为tag,属性name='Anne_of_Austria'的节点\nlabel为tag,属性name='International_Energy_Agency'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Sunshine Express Airlines且位于Australia的组织的网址和名称",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n1.name='Sunshine_Express_Airlines' and n2.name='Australia' return n1.url, n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Australian_College_of_Natural_Medicine'的节点\nlabel为organisation,属性name='Australian_College_of_Natural_Medicine'的节点\nlabel为organisation,属性name='Australian_College_of_Natural_Medicine'的节点\nlabel为tag,属性name='United_States_Virgin_Islands'的节点\nlabel为tag,属性name='Islamic_Courts_Union'的节点\nlabel为tag,属性name='Somewhere_in_England'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找位于澳大利亚的组织的名称、id、组织的URL以及澳大利亚的URL和id",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n2.name='Australia' return n1.name, n1.id, n2.url, n2.name, n1.url, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Alliance_Airlines'的节点\nlabel为organisation,属性name='Air_Go_Airlines'的节点\nlabel为organisation,属性name='ItAli_Airlines'的节点\nlabel为place,属性name='Major_Cities'的节点\nlabel为tag,属性name='Islamic_Courts_Union'的节点\nlabel为tag,属性name='Calling_All_Stations'的节点\nlabel为tag,属性name='Organisation_of_Islamic_Cooperation'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Alliance_Airlines的组织信息及其所在地点的名称、URL和id，并按组织名称排序，返回组织的id、名称、URL以及地点的名称、URL和id",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n1.name='Alliance_Airlines' return n1.id, n2.name, n2.url, n2.id, n1.url, n1.name order by n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Australian_College_of_Natural_Medicine'的节点\nlabel为organisation,属性name='Australian_College_of_Natural_Medicine'的节点\nlabel为organisation,属性name='Australian_College_of_Natural_Medicine'的节点\nlabel为tag,属性name='Islamic_Courts_Union'的节点\nlabel为tag,属性name='United_States_Virgin_Islands'的节点\nlabel为tag,属性name='Somewhere_in_England'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找位于澳大利亚的组织的URL和ID，以及澳大利亚的URL",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n2.name='Australia' return n1.url, n1.id, n2.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Open_Universities_Australia'的节点\nlabel为organisation,属性name='Australian_College_of_Natural_Medicine'的节点\nlabel为organisation,属性name='Australian_College_of_Natural_Medicine'的节点\nlabel为tag,属性name='Islamic_Courts_Union'的节点\nlabel为tag,属性name='United_States_Virgin_Islands'的节点\nlabel为tag,属性name='Seventeen_Provinces'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找位于澳大利亚的组织的id、组织名称、组织URL和地点URL，限制返回16条结果",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n2.name='Australia' return n2.id, n1.name, n1.url, n2.url limit 16"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Emu_Airways'的节点\nlabel为organisation,属性name='United_Eagle_Airlines'的节点\nlabel为organisation,属性name='East-West_Airlines_(Australia)'的节点\nlabel为place,属性name='Ratmalana_Airport'的节点\nlabel为tag,属性name='Organisation_of_African_Unity'的节点\nlabel为tag,属性name='United_Arab_Emirates'的节点\nlabel为tag,属性name='United_States_of_Eurasia'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Emu_Airways的组织，其所在地点为Australia，返回该组织的网址、id、名称以及地点的名称和id，限制返回14条结果",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n1.name='Emu_Airways' and n2.name='Australia' return n1.url, n1.id, n1.name, n2.name, n2.id limit 14"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Australian_College_of_Natural_Medicine'的节点\nlabel为organisation,属性name='Australian_College_of_Natural_Medicine'的节点\nlabel为organisation,属性name='Australian_College_of_Natural_Medicine'的节点\nlabel为place,属性name='http://maps.google.com/maps?ll=25.530889,69.017306&spn=0.01,0.01&t=m&q=25.530889,69.017306'的节点\nlabel为tag,属性name='United_States_Virgin_Islands'的节点\nlabel为tag,属性name='Somewhere_in_England'的节点\nlabel为tag,属性name='Anne_of_Austria'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找位于澳大利亚的组织的网址和名称，限制返回5个结果",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n2.name='Australia' return n1.url, n1.name limit 5"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Robert_Louis_Stevenson in Thrissur'的节点\nlabel为organisation,属性name='Rossair_(Australia)'的节点\nlabel为organisation,属性name='SN_Brussels_Airlines'的节点\nlabel为organisation,属性name='Rossair_Europe'的节点\nlabel为place,属性name='Ratmalana_Airport'的节点\nlabel为tag,属性name='Roxy_&_Elsewhere'的节点\nlabel为tag,属性name='Where_the_Wild_Roses_Grow'的节点\nlabel为tag,属性name='Dustin_Rhodes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Rossair (Australia)所在地点的id、名称、网址以及Rossair (Australia)的id和网址",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n1.name='Rossair_(Australia)' return n2.id, n1.id, n2.url, n1.url, n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Airlines_of_Tasmania'的节点\nlabel为organisation,属性name='East-West_Airlines_(Australia)'的节点\nlabel为organisation,属性name='TAAG_Angola_Airlines'的节点\nlabel为place,属性name='Ratmalana_Airport'的节点\nlabel为place,属性name='Pathum_Thani_Province'的节点\nlabel为tag,属性name='S&M_Airlines'的节点\nlabel为tag,属性name='Cayman_Islands'的节点\nlabel为tag,属性name='United_States_Virgin_Islands'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Airlines_of_Tasmania所在的地点的id，以及Airlines_of_Tasmania的名称和id，条件是该地点名称为Australia",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n1.name='Airlines_of_Tasmania' and n2.name='Australia' return n2.id, n1.name, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Tasman_Cargo_Airlines'的节点\nlabel为organisation,属性name='TAAG_Angola_Airlines'的节点\nlabel为organisation,属性name='Tiger_Airways_Australia'的节点\nlabel为place,属性name='Ratmalana_Airport'的节点\nlabel为tag,属性name='Cayman_Islands'的节点\nlabel为tag,属性name='S&M_Airlines'的节点\nlabel为tag,属性name='International_Energy_Agency'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找位于澳大利亚的Tasman Cargo Airlines的id、网址以及澳大利亚的id和名称",
        "output": "match (n1:organisation)-[r1:islocatedinorgan]->(n2:place)  where n2.name='Australia' and n1.name='Tasman_Cargo_Airlines' return n2.id, n1.id, n1.url, n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Sorin_Hall'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Hannan_University'的节点\nlabel为tag,属性name='Hans_Holbein_the_Younger'的节点\nlabel为tag,属性name='Saddam_Hussein'的节点\nlabel为tag,属性name='Hans_Werner_Henze'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Hossein的人的兴趣标签，返回该人的性别、姓氏、创建日期、邮箱、ID、生日、位置IP、语言，以及兴趣标签的URL、名称和ID，还有兴趣关系的创建日期，跳过前9个结果，限制返回7个结果",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n1.firstname='Hossein' return n1.gender, n1.lastname, n1.creationdate, n2.url, n2.name, n1.email, n1.id, n1.birthday, n1.locationip, n2.id, r1.creationdate, n1.language skip 9 limit 7"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为forum,属性title='Group for Arthur_Miller in Poznań'的节点\nlabel为forum,属性title='Group for Brian_Wilson in Loikaw'的节点\nlabel为organisation,属性name='Mohammad_Ali_Jinnah_University'的节点\nlabel为organisation,属性name='Pennoni_Honors_College'的节点\nlabel为organisation,属性name='Daniel_Payne_College'的节点\nlabel为place,属性name='Borey_Seang_Nam'的节点\nlabel为place,属性name='Birni_Nkonni'的节点\nlabel为tag,属性name='Brian_Mulroney'的节点\nlabel为tag,属性name='Brian_Michael_Bendis'的节点\nlabel为tag,属性name='Paolo_Maldini'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找对Brian_Mulroney感兴趣的14个人的浏览器使用情况、姓氏、电子邮件、兴趣创建日期、标签的URL和生日以及标签的id",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n2.name='Brian_Mulroney' return n1.browserused, n1.lastname, n1.email, r1.creationdate, n2.url, n1.birthday, n2.id limit 14"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Louis_XIV_of_France in Indianapolis'的节点\nlabel为forum,属性title='Group for Albert_Günther in Loikaw'的节点\nlabel为forum,属性title='Group for Robert_Redford in Ljubljana'的节点\nlabel为organisation,属性name='Gabriel_Dumont_Institute'的节点\nlabel为organisation,属性name='Gallaudet_University'的节点\nlabel为organisation,属性name='Paris_Diderot_University'的节点\nlabel为tag,属性name='Gilbert_du_Motier,_marquis_de_Lafayette'的节点\nlabel为tag,属性name='Joseph_Louis_Lagrange'的节点\nlabel为tag,属性name='Gustave_Courbet'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找对Gilbert_du_Motier,_marquis_de_Lafayette感兴趣的人员的电子邮件、标签的URL、使用的浏览器和性别",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n2.name='Gilbert_du_Motier,_marquis_de_Lafayette' return n1.email, n2.url, n1.browserused, n1.gender"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Georg_Wilhelm_Friedrich_Hegel in Tarakan'的节点\nlabel为forum,属性title='Group for Howard_Hughes in Gardēz'的节点\nlabel为organisation,属性name='Gheorghe_Zane_University'的节点\nlabel为organisation,属性name='Gaston_Berger_University'的节点\nlabel为organisation,属性name='Gabriel_Dumont_Institute'的节点\nlabel为tag,属性name='George_Frideric_Handel'的节点\nlabel为tag,属性name='Georg_Wilhelm_Friedrich_Hegel'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找对George_Frideric_Handel感兴趣的人员的邮箱、性别、语言和姓氏，并返回标签的URL和名称，结果按标签名称排序",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n2.name='George_Frideric_Handel' return n2.url, n1.email, n2.name, n1.lastname, n1.gender, n1.language order by n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Sorin_Hall'的节点\nlabel为organisation,属性name='Hans_Raj_College'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为tag,属性name='Hans_Werner_Henze'的节点\nlabel为tag,属性name='Hans_Holbein_the_Younger'的节点\nlabel为tag,属性name='Hermann_Hesse'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Hossein的人的兴趣标签的名称，该人的创建日期，兴趣关系的创建日期以及该人的性别",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n1.firstname='Hossein' return n1.creationdate, n2.name, r1.creationdate, n1.gender"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Friedrich_Nietzsche in Poznań'的节点\nlabel为organisation,属性name='Gheorghe_Zane_University'的节点\nlabel为organisation,属性name='Hesser_College'的节点\nlabel为organisation,属性name='Hesser_College'的节点\nlabel为tag,属性name='Hans_Werner_Henze'的节点\nlabel为tag,属性name='Heinz-Harald_Frentzen'的节点\nlabel为tag,属性name='Fridtjof_Nansen'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找对Friedrich_Nietzsche感兴趣的名为Hossein的人的性别、使用的浏览器、标签的URL、电子邮件、姓氏、语言、标签的id和名称、生日、人的id以及兴趣关系的创建日期",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n2.name='Friedrich_Nietzsche' and n1.firstname='Hossein' return n1.gender, n1.browserused, n2.url, n1.email, n1.lastname, n1.language, n2.id, n2.name, n1.birthday, n1.id, r1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Friedrich_Nietzsche in Poznań'的节点\nlabel为forum,属性title='Group for Henry_VI_of_England in Vitebsk'的节点\nlabel为forum,属性title='Group for Robert_Louis_Stevenson in Poznań'的节点\nlabel为organisation,属性name='Swiss_German_University'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Hogeschool_van_Amsterdam'的节点\nlabel为place,属性name='Freiburg_im_Breisgau'的节点\nlabel为tag,属性name='Hermann_von_Helmholtz'的节点\nlabel为tag,属性name='Hermann_Hesse'的节点\nlabel为tag,属性name='Hans_Werner_Henze'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找对Wilhelm_II,_German_Emperor感兴趣的名为Hossein的人的姓名、性别、语言、姓氏、URL、生日、使用的浏览器、创建日期以及兴趣关系的创建日期",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n2.name='Wilhelm_II,_German_Emperor' and n1.firstname='Hossein' return n1.firstname, n2.id, n1.gender, n1.language, n1.lastname, n2.url, n1.birthday, n1.browserused, n1.creationdate, r1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Hesser_College'的节点\nlabel为organisation,属性name='Hesser_College'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为tag,属性name='Michael_Heseltine'的节点\nlabel为tag,属性name='Marlene_Dietrich'的节点\nlabel为tag,属性name='Menachem_Mendel_Schneerson'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Hossein且对Marlene Dietrich感兴趣的人员的IP地址、语言、姓氏、浏览器、兴趣创建日期、生日、ID、以及标签的ID和URL，同时返回该人员的创建日期。",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n1.firstname='Hossein' and n2.name='Marlene_Dietrich' return n1.locationip, n1.language, n1.lastname, n1.browserused, r1.creationdate, n1.birthday, n1.id, n2.id, n1.firstname, n2.url, n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Robert_Louis_Stevenson in Poznań'的节点\nlabel为forum,属性title='Group for John_Lennon in Chaozhou'的节点\nlabel为organisation,属性name='Pawan_Hans'的节点\nlabel为organisation,属性name='Daniel_Payne_College'的节点\nlabel为organisation,属性name='Paul_Cézanne_University'的节点\nlabel为tag,属性name='Leander_Paes'的节点\nlabel为tag,属性name='Rob_Paulsen'的节点\nlabel为tag,属性name='Peter_Paul_Rubens'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Hossein且对Leander_Paes感兴趣的人员的姓氏、语言、性别、电子邮件、创建日期、兴趣标签名称、人员ID、兴趣关系创建日期、浏览器使用情况、生日、名字以及兴趣标签的URL",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n1.firstname='Hossein' and n2.name='Leander_Paes' return n1.lastname, n1.language, n1.gender, n1.email, n1.creationdate, n2.name, n1.id, r1.creationdate, n1.browserused, n1.birthday, n1.firstname, n2.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Sorin_Hall'的节点\nlabel为organisation,属性name='Hesser_College'的节点\nlabel为organisation,属性name='Hesser_College'的节点\nlabel为tag,属性name='Hans_Holbein_the_Younger'的节点\nlabel为tag,属性name='Hans_Werner_Henze'的节点\nlabel为tag,属性name='Michael_Heseltine'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Hossein的人的兴趣标签，并返回他的语言信息",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n1.firstname='Hossein' return n1.language"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Louis_XIV_of_France in Indianapolis'的节点\nlabel为forum,属性title='Group for Luiz_Inácio_Lula_da_Silva in Rio_de_Janeiro'的节点\nlabel为forum,属性title='Group for Louis_Philippe_I in Dali'的节点\nlabel为organisation,属性name='Rafael_Belloso_Chacin_University'的节点\nlabel为organisation,属性name='Sergio_Arboleda_University'的节点\nlabel为organisation,属性name='Diego_Portales_University'的节点\nlabel为place,属性name='Presidencia_Roque_Sáenz_Peña'的节点\nlabel为place,属性name='Antón_Lizardo'的节点\nlabel为place,属性name='San_Pedro_Garza_García'的节点\nlabel为tag,属性name='Philip_II_of_Spain'的节点\nlabel为tag,属性name='Philip_IV_of_Spain'的节点\nlabel为tag,属性name='Philip_V_of_Spain'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找对Philip_II_of_Spain感兴趣的人员的姓名、创建日期、标签id、语言、生日、使用的浏览器、人员id、关系创建日期、性别和邮箱",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n2.name='Philip_II_of_Spain' return n1.firstname, n1.creationdate, n2.id, n1.language, n2.url, n1.birthday, n1.browserused, n1.id, r1.creationdate, n1.gender, n1.email"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Heinz_Guderian in Dire_Dawa'的节点\nlabel为forum,属性title='Group for Heinz_Guderian in Dire_Dawa'的节点\nlabel为forum,属性title='Group for Heinz_Guderian in Dire_Dawa'的节点\nlabel为organisation,属性name='Andres_Soriano_College'的节点\nlabel为organisation,属性name='Sorin_Hall'的节点\nlabel为organisation,属性name='Rafael_Belloso_Chacin_University'的节点\nlabel为place,属性name='Chorrillos_District'的节点\nlabel为tag,属性name='Doremi_Fasol_Latido'的节点\nlabel为tag,属性name='Denny_Hamlin'的节点\nlabel为tag,属性name='Ahmad_Shah_Durrani'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Hossein的人对Salvador_Dalí标签的兴趣，返回该人的创建日期、使用的浏览器、生日以及兴趣的创建日期",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n1.firstname='Hossein' and n2.name='Salvador_Dalí' return n1.creationdate, n1.browserused, n1.birthday, r1.creationdate"
    }
]