[
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Al-Ahliyya_Amman_University'的节点\nlabel为organisation,属性name='Admas_College'的节点\nlabel为organisation,属性name='Assam_University'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为tag,属性name='Damon_Albarn'的节点\nlabel为tag,属性name='Arif_Mardin'的节点\nlabel为tag,属性name='Martin_Damm'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Ammar的人的姓名、生日、姓氏、id、语言、性别以及他喜欢的评论的id和浏览器使用情况，同时返回喜欢关系的创建日期",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='Ammar' return n1.firstname, n1.birthday, n1.lastname, n1.id, n2.id, n1.language, n2.browserused, n1.gender, r1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为forum,属性title='Group for Mahmud_of_Ghazni in Raniganj'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为organisation,属性name='Jamal_Mohamed_College'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Sindh_Madrasatul_Islam'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为place,属性name='New_Muslim_Town'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Mohammad_Mosaddegh'的节点\nlabel为tag,属性name='Mahmoud_Ahmadinejad'的节点\nlabel为tag,属性name='Mohammed_Zahir_Shah'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Mohamed的人喜欢的评论的详细信息，包括Mohamed的名、评论的长度、喜欢的创建日期、评论的id、Mohamed的位置IP、Mohamed的创建日期、评论的浏览器使用情况、Mohamed的电子邮件、Mohamed的生日、Mohamed的语言、Mohamed的性别以及评论的位置IP。",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='Mohamed' return n1.firstname, n2.length, r1.creationdate, n2.id, n1.locationip, n1.creationdate, n2.browserused, n1.email, n1.birthday, n1.language, n1.gender, n2.locationip"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for John_Edward_Gray in Shah_Alam'的节点\nlabel为organisation,属性name='Al_Akhawayn_University'的节点\nlabel为organisation,属性name='El_Asher_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为place,属性name='Ulan_Bator'的节点\nlabel为tag,属性name='Damon_Albarn'的节点\nlabel为tag,属性name='Edward_Asner'的节点\nlabel为tag,属性name='Arif_Mardin'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Aharon的人喜欢的评论所使用的浏览器，以及Aharon的性别和他所使用的浏览器",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='Aharon' return n2.browserused, n1.firstname, n1.gender, n1.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Paul_Sabatier_University'的节点\nlabel为organisation,属性name='Palo_Alto_College'的节点\nlabel为organisation,属性name='Diego_Portales_University'的节点\nlabel为place,属性name='Pedro_Escobedo'的节点\nlabel为tag,属性name='Paul_Is_Live'的节点\nlabel为tag,属性name='Paul_Rudd'的节点\nlabel为tag,属性name='Pier_Paolo_Pasolini'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Paulo的人喜欢的评论，返回Paulo的id、姓名、语言、生日，以及他喜欢的评论的id、创建日期、内容和喜欢操作的创建日期，限制返回17条结果",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='Paulo' return n1.id, n2.id, n1.firstname, n1.language, n2.creationdate, n2.content, n1.birthday, r1.creationdate limit 17"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Fatima_Jinnah_Women_University'的节点\nlabel为organisation,属性name='Jimma_University'的节点\nlabel为organisation,属性name='Yogi_Vemana_University'的节点\nlabel为tag,属性name='My_Kinda_Party'的节点\nlabel为tag,属性name='Ida_Lupino'的节点\nlabel为tag,属性name='Funky_Cold_Medina'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Chutima的人喜欢的评论的创建日期、喜欢关系的创建日期、Chutima的生日、姓氏、语言、性别，以及评论的id、长度、位置IP，跳过1条结果，返回11条结果",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='Chutima' return n2.creationdate, r1.creationdate, n1.birthday, n1.lastname, n1.language, n2.id, n1.creationdate, n2.length, n2.locationip, n1.gender skip 1 limit 11"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Emanuel_University'的节点\nlabel为organisation,属性name='Sergio_Arboleda_University'的节点\nlabel为organisation,属性name='Jorge_Amado_University_Center'的节点\nlabel为place,属性name='Antón_Lizardo'的节点\nlabel为place,属性name='El_Salvador'的节点\nlabel为tag,属性name='Edward_James_Olmos'的节点\nlabel为tag,属性name='Edwin_Edwards'的节点\nlabel为tag,属性name='Hans_Christian_Andersen'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Evangelos的人使用的浏览器、生日、喜欢的评论的创建日期、评论长度、此人姓氏、使用的语言、此人的创建日期以及性别，同时返回该评论的id。",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='Evangelos' return n1.browserused, n1.birthday, n2.creationdate, n1.lastname, n2.length, n1.language, n1.creationdate, n2.id, n1.gender"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Allen_University'的节点\nlabel为organisation,属性name='Anna_University'的节点\nlabel为organisation,属性name='Al-Ahliyya_Amman_University'的节点\nlabel为place,属性name='Ann_Arbor'的节点\nlabel为tag,属性name='Alan_Alda'的节点\nlabel为tag,属性name='Alan_Ladd'的节点\nlabel为tag,属性name='Adrian_Edmondson'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Angel的人喜欢的评论，返回该人的IP地址、创建日期、生日、浏览器使用情况、名、姓，以及评论的浏览器使用情况、ID、长度、IP地址、创建日期和内容。",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='Angel' return n1.locationip, n1.creationdate, n2.browserused, n1.birthday, n1.firstname, n2.id, n2.length, n1.browserused, n1.lastname, n2.locationip, n2.creationdate, n2.content"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 17 of Abdoulatifou Aly'的节点\nlabel为organisation,属性name='Alberto_Hurtado_University'的节点\nlabel为organisation,属性name='Allameh_Tabatabai_University'的节点\nlabel为organisation,属性name='Sam_Ratulangi_University'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\nlabel为tag,属性name='Zulfikar_Ali_Bhutto'的节点\nlabel为tag,属性name='Iparhi_Agapi_Edo'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Abdoulatifou的人喜欢的评论，返回该人的语言、浏览器、电子邮件、性别、生日以及评论的id、内容、评论的创建日期和喜欢关系的创建日期，跳过前12条记录，限制返回17条记录。",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='Abdoulatifou' return n1.language, n1.browserused, n1.email, n2.id, n1.gender, n1.id, n2.content, r1.creationdate, n1.birthday, n2.creationdate skip 12 limit 17"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为organisation,属性name='Jamal_Mohamed_College'的节点\nlabel为organisation,属性name='Michael_Madhusudan_Memorial_College'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为place,属性name='Ramadan_City'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Mohammad_Mosaddegh'的节点\nlabel为tag,属性name='Arif_Mardin'的节点\nlabel为tag,属性name='Mahmoud_Ahmadinejad'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Mohamed喜欢的评论的创建日期、评论内容、Mohamed的邮箱、性别、姓氏、生日、喜欢的创建日期以及评论的位置IP",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='Mohamed' return n2.creationdate, n1.firstname, n2.content, n1.email, n1.gender, n1.lastname, n1.birthday, r1.creationdate, n2.locationip"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Pamir_University'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为tag,属性name='Arif_Mardin'的节点\nlabel为tag,属性name='Hyder_Ali'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Fatmir的人所喜欢的评论，返回该人的浏览器使用情况、IP位置、姓氏、所喜欢评论的浏览器使用情况、长度、IP位置、邮箱、ID、语言、创建日期、性别、评论的ID、内容、生日和名字",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='Fatmir' return n1.browserused, n1.locationip, n1.lastname, n2.browserused, n2.length, n2.locationip, n1.email, n1.id, n1.language, n1.creationdate, r1.creationdate, n1.gender, n2.id, n2.content, n1.birthday, n1.firstname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为organisation,属性name='Jamal_Mohamed_College'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Sindh_Madrasatul_Islam'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为place,属性name='Al_Hudaydah'的节点\nlabel为tag,属性name='Mohammad_Mosaddegh'的节点\nlabel为tag,属性name='Mahmoud_Ahmadinejad'的节点\nlabel为tag,属性name='Arif_Mardin'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Mohamed的人喜欢的评论的长度、IP地址、id，以及该人的IP地址、生日、姓氏、语言、名字和id，还有评论的内容。",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='Mohamed' return n2.length, n2.locationip, n2.id, n1.locationip, n1.birthday, n1.lastname, n1.language, n1.firstname, n1.id, n2.content"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Paul_Sabatier_University'的节点\nlabel为place,属性name='Siem_Reap'的节点\nlabel为tag,属性name='No_Said_Date'的节点\nlabel为tag,属性name='Time_of_the_Season'的节点\nlabel为tag,属性name='Remember_the_Time'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Samuel喜欢的评论的创建日期",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='Samuel' return n2.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Daniel_Payne_College'的节点\nlabel为organisation,属性name='Jordan_Aviation'的节点\nlabel为organisation,属性name='Bar_XH_Air'的节点\nlabel为tag,属性name='Johnny_One_Note'的节点\nlabel为tag,属性name='Day_&_Age'的节点\nlabel为tag,属性name='John_Gay'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Jan的人的生日，以及他喜欢的评论所使用的浏览器、评论内容、评论长度、评论创建日期和Jan的创建日期",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='Jan' return n1.birthday, n2.browserused, r1.creationdate, n2.content, n2.length, n2.creationdate, n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Jordan_Aviation'的节点\nlabel为organisation,属性name='Jacksonville_University'的节点\nlabel为organisation,属性name='Andrew_Jackson_High_School'的节点\nlabel为tag,属性name='John_Madden'的节点\nlabel为tag,属性name='John_Jay'的节点\nlabel为tag,属性name='John_Gay'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为John的人喜欢的评论内容、喜欢的时间、John的性别、使用的浏览器、评论的长度、John的姓氏和语言，限制返回3条结果",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='John' return n2.content, r1.creationdate, n1.gender, n1.browserused, n2.length, n1.lastname, n1.language limit 3"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Admas_College'的节点\nlabel为tag,属性name='No_Said_Date'的节点\nlabel为tag,属性name='Daniel_arap_Moi'的节点\nlabel为tag,属性name='Rebel_Meets_Rebel'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Arap的人喜欢的评论的创建日期",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='Arap' return n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为organisation,属性name='Maulana_Azad_College'的节点\nlabel为organisation,属性name='Jamia_Hamdard'的节点\nlabel为organisation,属性name='José_Rizal_University'的节点\nlabel为person,属性firstname='Mohammad Reza'的节点\nlabel为place,属性name='Ramadan_City'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为tag,属性name='Muhammad_ibn_Zakariya_al-Razi'的节点\nlabel为tag,属性name='Mohammad_Reza_Pahlavi'的节点\nlabel为tag,属性name='Mahmoud_Ahmadinejad'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Mohammad Reza的人喜欢的评论，返回第11到第20个人的id和性别信息",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='Mohammad Reza' return n1.id, n1.gender skip 10 limit 10"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='University_of_Pittsburgh_School_of_Education'的节点\nlabel为organisation,属性name='PEC_University_of_Technology'的节点\nlabel为organisation,属性name='Terry_Parker_High_School'的节点\nlabel为tag,属性name='Peter_Pan'的节点\nlabel为tag,属性name='Peter_Paul_Rubens'的节点\nlabel为tag,属性name='Peter_the_Great'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Peter的人喜欢的评论的详细信息，包括Peter的性别、喜欢的时间、位置IP、评论的id和内容、Peter的邮箱、评论的创建时间、Peter的语言、Peter的生日、评论使用的浏览器、Peter的id、评论的位置IP、Peter使用的浏览器以及Peter的姓氏。",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='Peter' return n1.gender, r1.creationdate, n1.locationip, n2.id, n2.content, n1.email, n2.creationdate, n1.language, n1.firstname, n1.birthday, n2.browserused, n1.id, n2.locationip, n1.browserused, n1.lastname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Palo_Alto_College'的节点\nlabel为organisation,属性name='Sergio_Arboleda_University'的节点\nlabel为organisation,属性name='Diego_Portales_University'的节点\nlabel为tag,属性name='Pier_Paolo_Pasolini'的节点\nlabel为tag,属性name='Alessandro_Del_Piero'的节点\nlabel为tag,属性name='Pedro_I_of_Brazil'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Pablo的人的生日、id和创建日期，以及他喜欢的评论所使用的浏览器、评论的长度和内容，同时返回喜欢关系的创建日期。",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='Pablo' return n1.birthday, n1.id, n1.creationdate, n2.browserused, r1.creationdate, n2.length, n2.content"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='DG_Vaishnav_College'的节点\nlabel为organisation,属性name='Gabriel_Dumont_Institute'的节点\nlabel为organisation,属性name='Daeduk_College'的节点\nlabel为tag,属性name='David_Nalbandian'的节点\nlabel为tag,属性name='David_Niven'的节点\nlabel为tag,属性name='David_Lee_Roth'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找David喜欢的评论的创建日期、id、长度以及David的IP地址",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='David' return n2.creationdate, n2.id, n2.length, n1.locationip"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Mofid_University'的节点\nlabel为organisation,属性name='Fanshawe_College'的节点\nlabel为organisation,属性name='Hamdard_University'的节点\nlabel为tag,属性name='Roger_Federer'的节点\nlabel为tag,属性name='Ric_Flair'的节点\nlabel为tag,属性name='Fred_Frith'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Fred的人喜欢的评论的浏览器使用情况、他的姓氏、创建日期以及评论的位置IP和他自己的id",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='Fred' return n1.id, n2.browserused, n1.lastname, n1.creationdate, n2.locationip"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Nathan_Bedford_Forrest_High_School'的节点\nlabel为organisation,属性name='Ravenshaw_University'的节点\nlabel为organisation,属性name='Ravenshaw_University'的节点\nlabel为tag,属性name='Lynn_Redgrave'的节点\nlabel为tag,属性name='Rob_Schneider'的节点\nlabel为tag,属性name='Gene_Roddenberry'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Rainford的人喜欢的评论的IP地址、性别、姓氏、评论长度、语言、喜欢的时间、评论内容、电子邮件、评论创建时间、名、生日、创建时间、IP地址、ID、浏览器信息。同时返回该人的相关信息。",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='Rainford' return n2.locationip, n1.gender, n1.lastname, n2.length, n1.language, r1.creationdate, n2.content, n1.email, n2.creationdate, n1.firstname, n1.birthday, n1.creationdate, n1.locationip, n1.id, n2.id, n2.browserused, n1.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为forum,属性title='Group for John_Edward_Gray in Shah_Alam'的节点\nlabel为forum,属性title='Group for Andy_Roddick in Ahmedpur_Sial'的节点\nlabel为organisation,属性name='Avadh_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Maulana_Azad_College'的节点\nlabel为person,属性firstname='Salim Ahmed'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Al_Hudaydah'的节点\nlabel为tag,属性name='Arif_Mardin'的节点\nlabel为tag,属性name='Azad_Hind'的节点\nlabel为tag,属性name='Mahmoud_Ahmadinejad'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Ahmad的人喜欢的评论的内容、使用的浏览器，以及Ahmad的id和名字",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='Ahmad' return n2.content, n2.browserused, n1.id, n1.firstname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Aichi_Mizuho_College'的节点\nlabel为organisation,属性name='Aichi_Gakusen_University'的节点\nlabel为organisation,属性name='Aichi_Gakusen_University'的节点\nlabel为tag,属性name='Dog_Man_Star'的节点\nlabel为tag,属性name='Get_Like_Me'的节点\nlabel为tag,属性name='Strawberry_Letter_23'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Takeshi的人喜欢的评论，返回该人的邮箱、IP地址、ID、创建日期、生日和浏览器信息，以及评论的IP地址、长度和喜欢操作的创建日期",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='Takeshi' return n1.email, n1.locationip, n1.id, n1.creationdate, n2.locationip, n2.length, r1.creationdate, n1.birthday, n1.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='José_Rizal_University'的节点\nlabel为organisation,属性name='Shahid_Rajaee_University'的节点\nlabel为tag,属性name='Ric_Flair'的节点\nlabel为tag,属性name='Frank_Lampard'的节点\nlabel为tag,属性name='Roger_Federer'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Rafael的人喜欢的评论的详细信息，包括关系的创建日期、人的语言、评论的IP地址、人的ID、评论的浏览器、人的创建日期、人的姓氏、评论的创建日期、人的IP地址、评论的ID、人的名字、评论的内容、人的生日、人的性别、人的浏览器和人的邮箱。",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='Rafael' return r1.creationdate, n1.language, n2.locationip, n1.id, n2.browserused, n1.creationdate, n1.lastname, n2.creationdate, n1.locationip, n2.id, n1.firstname, n2.content, n1.birthday, n1.gender, n1.browserused, n1.email"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Hogeschool_van_Amsterdam'的节点\nlabel为organisation,属性name='Webster_University_Geneva'的节点\nlabel为organisation,属性name='Webster_University_Vienna'的节点\nlabel为tag,属性name='Jimmy_Wales'的节点\nlabel为tag,属性name='Ralph_Vaughan_Williams'的节点\nlabel为tag,属性name='Somdev_Devvarman'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Wilhelm的人的创建日期、使用的浏览器、位置IP和生日",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='Wilhelm' return n1.creationdate, n1.browserused, n1.locationip, n1.birthday"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='William_Carey_University'的节点\nlabel为organisation,属性name='Keen_College'的节点\nlabel为organisation,属性name='Bar_XH_Air'的节点\nlabel为tag,属性name='Hyder_Ali'的节点\nlabel为tag,属性name='Ric_Flair'的节点\nlabel为tag,属性name='Katy_Lied'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Carey的人喜欢的评论的内容、长度、评论的id和位置IP，以及喜欢关系的创建日期、Carey的语言和创建日期",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='Carey' return n2.content, n2.length, r1.creationdate, n1.language, n1.creationdate, n1.lastname, n2.id, n2.locationip"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for John_Lennon in Chaozhou'的节点\nlabel为forum,属性title='Group for Mahmud_of_Ghazni in Raniganj'的节点\nlabel为forum,属性title='Group for Leonard_Cohen in Chikusa-ku'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Hirosaki_Gakuin_University'的节点\nlabel为organisation,属性name='Hannan_University'的节点\nlabel为tag,属性name='Honus_Wagner'的节点\nlabel为tag,属性name='Zora_Neale_Hurston'的节点\nlabel为tag,属性name='Justine_Henin'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Zanjan University学习且名为Hossein的人的创建日期和性别",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n2.name='Zanjan_University' and n1.firstname='Hossein' return n1.creationdate, n1.gender"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Daniel_Payne_College'的节点\nlabel为organisation,属性name='John_Glenn_School_of_Public_Affairs'的节点\nlabel为organisation,属性name='Jackson_School_of_Geosciences'的节点\nlabel为tag,属性name='The_Jean_Genie'的节点\nlabel为tag,属性name='John_Isner'的节点\nlabel为tag,属性name='Jennifer_Jason_Leigh'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Jan的人的学习经历，包括他的名字、关系的创建日期、毕业年份、位置IP、浏览器使用情况、电子邮件、性别、创建日期、姓氏、生日、学习的组织名称以及他的id",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n1.firstname='Jan' return n1.firstname, r1.creationdate, r1.classyear, n1.locationip, n1.browserused, n1.email, n1.gender, n1.creationdate, n1.lastname, n1.birthday, n2.name, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Friedrich_Nietzsche in Poznań'的节点\nlabel为forum,属性title='Group for William_Shakespeare in Vitebsk'的节点\nlabel为forum,属性title='Group for James_K._Polk in Valdivia'的节点\nlabel为organisation,属性name='Cardinal_Stefan_Wyszyński_University_in_Warsaw'的节点\nlabel为organisation,属性name='Adam_Mickiewicz_University_in_Poznań'的节点\nlabel为organisation,属性name='Wrocław_University_of_Technology'的节点\nlabel为person,属性firstname='Wojciech'的节点\nlabel为person,属性firstname='Wojciech'的节点\nlabel为place,属性name='Ivanovo_Oblast'的节点\nlabel为tag,属性name='Alexander_Vladimirovich_Volkov'的节点\nlabel为tag,属性name='Andrzej_Wajda'的节点\nlabel为tag,属性name='Aleksandra_Wozniak'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Wojciech的人的姓氏，这些人在某个组织学习过",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n1.firstname='Wojciech' return n1.lastname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为forum,属性title='Wall of Ahmad Zakii Lee'的节点\nlabel为forum,属性title='Group for Nikolay_Davydenko in Ahmedpur_Sial'的节点\nlabel为organisation,属性name='Azim_Premji_University'的节点\nlabel为organisation,属性name='Aliah_University'的节点\nlabel为organisation,属性name='Mohammad_Ali_Jinnah_University'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\nlabel为tag,属性name='Muhammad_Ali'的节点\nlabel为tag,属性name='Hyder_Ali'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Ali的人的姓氏以及他学习过的组织的id和名称",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n1.firstname='Ali' return n1.lastname, n2.id, n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为organisation,属性name='Al-Ahliyya_Amman_University'的节点\nlabel为organisation,属性name='Aliah_University'的节点\nlabel为organisation,属性name='Al-Isra_University'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为tag,属性name='Muhammad_Ali'的节点\nlabel为tag,属性name='Islamic_Courts_Union'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Ali的人学习过的组织的URL、关系的创建日期、毕业年份、使用的浏览器、电子邮件、ID、生日、组织名称和姓氏，并按组织名称排序",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n1.firstname='Ali' return n1.firstname, n2.url, r1.creationdate, r1.classyear, n1.browserused, n1.email, n1.id, n1.birthday, n2.name, n1.lastname order by n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Luiz_Inácio_Lula_da_Silva in Rio_de_Janeiro'的节点\nlabel为forum,属性title='Group for Miguel_de_Cervantes in Rio_de_Janeiro'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为organisation,属性name='Jorge_Amado_University_Center'的节点\nlabel为organisation,属性name='Escuela_Normal_Miguel_F._Martínez'的节点\nlabel为organisation,属性name='Universidad_Centroccidental_Lisandro_Alvarado'的节点\nlabel为place,属性name='Antón_Lizardo'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为place,属性name='João_Monlevade'的节点\nlabel为tag,属性name='Juan_Ignacio_Chela'的节点\nlabel为tag,属性name='Martín_Vassallo_Argüello'的节点\nlabel为tag,属性name='Emilio_Aguinaldo'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Alejandro的人在Escuela Normal Miguel F. Martínez学习的信息，包括该组织的网址，Alejandro的语言、学习关系的创建日期、Alejandro的邮箱、创建日期、位置IP、姓氏、性别、生日、以及Alejandro的id和毕业年份。",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n1.firstname='Alejandro' and n2.name='Escuela_Normal_Miguel_F._Martínez' return n2.url, n1.language, r1.creationdate, n1.email, n1.creationdate, n1.locationip, n1.lastname, n1.gender, n1.birthday, r1.classyear, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Augustine_of_Hippo in Dazhou'的节点\nlabel为forum,属性title='Group for James_K._Polk in Valdivia'的节点\nlabel为forum,属性title='Group for Kevin_Rudd in Zhukovsky'的节点\nlabel为organisation,属性name='Deakin_University'的节点\nlabel为organisation,属性name='Deakin_University'的节点\nlabel为organisation,属性name='Daeduk_College'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为tag,属性name='Steven_Pinker'的节点\nlabel为tag,属性name='David_Rikl'的节点\nlabel为tag,属性name='Philip_K._Dick'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Deepak的人的详细信息，包括其id、语言、浏览器、IP地址、姓氏、性别、创建日期以及他们学习的组织的id和关系的创建日期，限制返回5条记录",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n1.firstname='Deepak' return n1.id, n1.language, n1.browserused, n1.locationip, n1.lastname, n2.id, n1.gender, n1.creationdate, n1.firstname, r1.creationdate limit 5"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Vytautas in Banda_Aceh'的节点\nlabel为forum,属性title='Group for Vytautas in Banda_Aceh'的节点\nlabel为organisation,属性name='Alexandru_Ioan_Cuza_University'的节点\nlabel为organisation,属性name='Manav_Rachna_International_University'的节点\nlabel为organisation,属性name='CEU_San_Pablo_University'的节点\nlabel为tag,属性name='Abbas_I_of_Persia'的节点\nlabel为tag,属性name='Paul_I_of_Russia'的节点\nlabel为tag,属性name='Peter_Paul_Rubens'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名字为Albaye Papa且在RUSTA学习的人的邮箱、RUSTA的id、该人的id以及他使用的语言",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n1.firstname='Albaye Papa' and n2.name='RUSTA' return n1.email, n2.id, n1.id, n1.language"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Friedrich_Nietzsche in Poznań'的节点\nlabel为organisation,属性name='Adam_Mickiewicz_University_in_Poznań'的节点\nlabel为organisation,属性name='Gheorghe_Zane_University'的节点\nlabel为organisation,属性name='Zaoksky_Adventist_University'的节点\nlabel为person,属性firstname='Zdenek'的节点\nlabel为person,属性firstname='Zdenek'的节点\nlabel为tag,属性name='Zakk_Wylde'的节点\nlabel为tag,属性name='Lutka_sa_naslovne_strane'的节点\nlabel为tag,属性name='Peter_Luczak'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Zdenek的人在Palacký University学习的信息，包括关系的创建日期、该人的浏览器使用情况、性别、组织的网址、该人的语言、id、生日、组织的id、该人的姓氏、创建日期、组织名称、名字和电子邮件。",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n2.name='Palacký_University' and n1.firstname='Zdenek' return r1.creationdate, n1.browserused, n1.gender, n2.url, n1.language, n1.id, n1.birthday, n2.id, n1.lastname, n1.creationdate, n2.name, n1.firstname, n1.email"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='José_Rizal_University'的节点\nlabel为organisation,属性name='Universidad_Juárez_Autónoma_de_Tabasco'的节点\nlabel为organisation,属性name='Diego_Portales_University'的节点\nlabel为tag,属性name='Jesse_Ventura'的节点\nlabel为tag,属性name='Joe_Quesada'的节点\nlabel为tag,属性name='Joan_Baez'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在University of Barcelona学习且名为Jose的人的浏览器使用情况、名、组织id、位置IP、姓、性别、语言、入学年份以及创建日期",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n2.name='University_of_Barcelona' and n1.firstname='Jose' return n1.browserused, n1.firstname, n2.id, n1.locationip, n1.lastname, n1.gender, n1.language, r1.classyear, n1.creationdate, r1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for P._G._Wodehouse in Cali'的节点\nlabel为organisation,属性name='Paul_Sabatier_University'的节点\nlabel为organisation,属性name='Sardar_Patel_University'的节点\nlabel为organisation,属性name='Sardar_Patel_University'的节点\nlabel为tag,属性name='Andrei_Pavel'的节点\nlabel为tag,属性name='Paul_Revere'的节点\nlabel为tag,属性name='Paul_Verhoeven'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Pavel的人的创建日期、姓氏以及他学习过的组织的名称",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n1.firstname='Pavel' return n1.creationdate, n1.lastname, n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Electric_Power_University'的节点\nlabel为organisation,属性name='Chenab_College,_Ahmedpur_Sial'的节点\nlabel为organisation,属性name='Chalmers_University_of_Technology'的节点\nlabel为tag,属性name='The_Electric_Co.'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Cam的人在Electric_Power_University学习的信息，包括组织的id、人的位置IP、邮箱、浏览器、入学年份、语言、人的id、名、关系的创建日期、性别、生日、组织的网址、人的姓、人的创建日期，并按组织名称排序。",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n2.name='Electric_Power_University' and n1.firstname='Cam' return n2.id, n1.locationip, n1.email, n1.browserused, r1.classyear, n1.language, n1.id, n1.firstname, r1.creationdate, n1.gender, n1.birthday, n2.url, n1.lastname, n1.creationdate, n2.name order by n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Kinnaird_College'的节点\nlabel为organisation,属性name='Cleveland_State_Community_College'的节点\nlabel为organisation,属性name='Aklan_Catholic_College'的节点\nlabel为tag,属性name='Ken_Burns'的节点\nlabel为tag,属性name='The_Köln_Concert'的节点\nlabel为tag,属性name='Christian_IX_of_Denmark'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Karen Baptist Convention学习的人的生日、毕业年份、语言、组织id、使用的浏览器、性别、IP地址、姓氏、id和名字",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n2.name='Karen_Baptist_Convention' return n1.birthday, r1.classyear, n1.language, n2.id, n1.browserused, n1.gender, n1.locationip, n1.lastname, n1.id, n1.firstname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为organisation,属性name='Ferdowsi_University_of_Mashhad'的节点\nlabel为organisation,属性name='Maulana_Azad_College'的节点\nlabel为organisation,属性name='Pamir_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Mohammad_Reza_Pahlavi'的节点\nlabel为tag,属性name='Pervez_Musharraf'的节点\nlabel为tag,属性name='Mohammed_Zahir_Shah'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Parviz且在Ferdowsi University of Mashhad学习的人的电子邮件、组织URL、创建日期、位置IP、毕业年份、生日、语言、性别、组织名称、名、浏览器、组织ID、姓氏和关系创建日期，并按组织名称降序排列",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n1.firstname='Parviz' and n2.name='Ferdowsi_University_of_Mashhad' return n1.email, n2.url, n1.creationdate, n1.locationip, r1.classyear, n1.birthday, n1.language, n1.gender, n2.name, n1.firstname, n1.browserused, n2.id, n1.lastname, r1.creationdate order by n2.name desc"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Latitude_Varsity'的节点\nlabel为organisation,属性name='DG_Vaishnav_College'的节点\nlabel为organisation,属性name='Northwest_Vista_College'的节点\nlabel为tag,属性name='Steve_Davis'的节点\nlabel为tag,属性name='David_Niven'的节点\nlabel为tag,属性name='Denzel_Washington'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为David且在Latitude Varsity学习的人的电子邮件、组织ID、位置IP、名、浏览器、ID、创建日期、语言、组织URL、姓、性别、生日以及他们在该组织的学习年份和关系的创建日期。",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n1.firstname='David' and n2.name='Latitude_Varsity' return n1.email, n2.id, n1.locationip, n1.firstname, n1.browserused, n1.id, n1.creationdate, n1.language, n2.url, n1.lastname, n1.gender, n1.birthday, r1.classyear, r1.creationdate, n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Huron_University_College'的节点\nlabel为organisation,属性name='Burnett_Honors_College'的节点\nlabel为organisation,属性name='Hannan_University'的节点\nlabel为tag,属性name='Harlan_Ellison'的节点\nlabel为tag,属性name='Harlan_Howard'的节点\nlabel为tag,属性name='Harold_Arlen'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在海伦布隆大学学习过的人的信息，包括他们使用的浏览器、毕业年份、组织id、个人id、关系创建日期、组织名称、性别、语言和组织网址。",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n2.name='Heilbronn_University' return n1.browserused, r1.classyear, n2.id, n1.id, r1.creationdate, n2.name, n1.gender, n1.language, n2.url"
    }
]