[
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Nikolay_Davydenko in Ahmedpur_Sial'的节点\nlabel为forum,属性title='Group for Mustafa_Kemal_Atatürk in Indianapolis'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为organisation,属性name='Khyber_Afghan_Airlines'的节点\nlabel为organisation,属性name='Chabahar_Airlines'的节点\nlabel为organisation,属性name='Azov_Avia_Airlines'的节点\nlabel为place,属性name='Islamabad/Rawalpindi,Lahore'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\nlabel为tag,属性name='Adil_Shahi_dynasty'的节点\nlabel为tag,属性name='Osama_bin_Laden'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Khalifa_Airways工作的人员的id，并按组织名称降序排列，限制返回4条记录",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n2.name='Khalifa_Airways' return n2.name, n1.id order by n2.name desc limit 4"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为forum,属性title='Group for Mustafa_Kemal_Atatürk in Indianapolis'的节点\nlabel为forum,属性title='Group for Nawaz_Sharif in Cali'的节点\nlabel为organisation,属性name='Sky_Work_Airlines'的节点\nlabel为organisation,属性name='Air_Go_Airlines'的节点\nlabel为organisation,属性name='Chabahar_Airlines'的节点\nlabel为tag,属性name='S&M_Airlines'的节点\nlabel为tag,属性name='Hyder_Ali'的节点\nlabel为tag,属性name='Steve_Jobs'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Khalifa_Airways工作的前4个人的浏览器使用情况、组织名称、位置IP、工作开始时间、人员ID和名字",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n2.name='Khalifa_Airways' return n1.browserused, n2.name, n1.locationip, r1.workfrom, n1.id, n1.firstname limit 4"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Nawaz_Sharif in Cali'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为organisation,属性name='Khalifa_Airways'的节点\nlabel为organisation,属性name='Khyber_Afghan_Airlines'的节点\nlabel为organisation,属性name='Chabahar_Airlines'的节点\nlabel为place,属性name='Ratmalana_Airport'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\nlabel为tag,属性name='Saif_Ali_Khan'的节点\nlabel为tag,属性name='Wiz_Khalifa'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Khalifa_Airways工作的人员的姓氏、id以及工作关系的创建日期，并返回Khalifa_Airways的网址，限制返回7条结果",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n2.name='Khalifa_Airways' return n2.url, n1.lastname, n1.id, r1.creationdate limit 7"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Khyber_Afghan_Airlines'的节点\nlabel为organisation,属性name='Khalifa_Airways'的节点\nlabel为organisation,属性name='Chabahar_Airlines'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\nlabel为tag,属性name='S&M_Airlines'的节点\nlabel为tag,属性name='Islamic_Courts_Union'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Khalifa_Airways工作的人员的组织URL、关系创建日期、人员创建日期、姓氏、ID、浏览器使用情况、生日、名字和语言，最多返回4条记录。",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n2.name='Khalifa_Airways' return n2.url, r1.creationdate, n1.creationdate, n1.lastname, n1.id, n1.browserused, n1.birthday, n1.firstname, n1.language limit 4"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Alicia_Keys in Jalpaiguri'的节点\nlabel为forum,属性title='Group for Akira_Kurosawa in Kerala'的节点\nlabel为forum,属性title='Group for Nawaz_Sharif in Cali'的节点\nlabel为organisation,属性name='Khyber_Afghan_Airlines'的节点\nlabel为organisation,属性name='Sky_Work_Airlines'的节点\nlabel为organisation,属性name='Chabahar_Airlines'的节点\nlabel为tag,属性name='Wiz_Khalifa'的节点\nlabel为tag,属性name='Saif_Ali_Khan'的节点\nlabel为tag,属性name='S&M_Airlines'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Khalifa_Airways工作的人员的语言和生日",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n2.name='Khalifa_Airways' return n1.language, n1.birthday"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Asia_University'的节点\nlabel为organisation,属性name='Asia_LIFE_University'的节点\nlabel为organisation,属性name='Asia_e_University'的节点\nlabel为place,属性name='Addis_Ababa'的节点\nlabel为place,属性name='Anantapur_district'的节点\nlabel为place,属性name='Jiaganj_Azimganj'的节点\nlabel为tag,属性name='Iparhi_Agapi_Edo'的节点\nlabel为tag,属性name='South_Asian_Association_for_Regional_Cooperation'的节点\nlabel为tag,属性name='Spanish_East_Indies'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找属于亚洲的地方的id、名称和URL，以及亚洲的id、名称和URL",
        "output": "match (n1:place)-[r1:ispartof]->(n2:place)  where n2.name='Asia' return n1.id, n2.url, n2.name, n2.id, n1.url, n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Private_University_of_Angola'的节点\nlabel为organisation,属性name='Arellano_University'的节点\nlabel为organisation,属性name='Arellano_University'的节点\nlabel为place,属性name='Anantapur_district'的节点\nlabel为place,属性name='Chorrillos_District'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为tag,属性name='Italian_East_Africa'的节点\nlabel为tag,属性name='French_Equatorial_Africa'的节点\nlabel为tag,属性name='Afrika_Bambaataa'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Angola所属的非洲地区的URL、名称和ID，同时返回Angola的URL和名称",
        "output": "match (n1:place)-[r1:ispartof]->(n2:place)  where n2.name='Africa' and n1.name='Angola' return n2.url, n1.url, n1.name, n2.name, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Centre_Européen_de_Recherches_Internationales_et_Stratégiques'的节点\nlabel为organisation,属性name='European_University_Institute'的节点\nlabel为organisation,属性name='European_Institute_of_Education'的节点\nlabel为place,属性name='Iloilo_City'的节点\nlabel为place,属性name='Major_Cities'的节点\nlabel为place,属性name='Ústí_nad_Labem'的节点\nlabel为tag,属性name='Council_of_Europe'的节点\nlabel为tag,属性name='German_East_Africa'的节点\nlabel为tag,属性name='Organization_for_Security_and_Co-operation_in_Europe'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找属于Europe的所有地点的id和名称，并按名称排序",
        "output": "match (n1:place)-[r1:ispartof]->(n2:place)  where n2.name='Europe' return n2.id, n1.name order by n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Azerbaijan_International_University'的节点\nlabel为organisation,属性name='Addis_Ababa_University'的节点\nlabel为organisation,属性name='Azerbaijan_Medical_University'的节点\nlabel为place,属性name='Addis_Ababa'的节点\nlabel为place,属性name='Jiaganj_Azimganj'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Azerbaijan_Democratic_Republic'的节点\nlabel为tag,属性name='United_Arab_Emirates'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Azerbaijan所属的地区名称、Azerbaijan的URL以及该地区的ID，已知该地区属于Asia",
        "output": "match (n1:place)-[r1:ispartof]->(n2:place)  where n2.name='Asia' and n1.name='Azerbaijan' return n2.name, n1.url, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Southern_States_University'的节点\nlabel为organisation,属性name='South-West_State_University'的节点\nlabel为organisation,属性name='Texas_Southern_University'的节点\nlabel为place,属性name='South_America'的节点\nlabel为place,属性name='North_America'的节点\nlabel为place,属性name='Greater_Noida'的节点\nlabel为tag,属性name='Idlewild_South'的节点\nlabel为tag,属性name='Southern_Accents'的节点\nlabel为tag,属性name='South_Pacific_Mandate'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找属于South_America的地方的id、名称和URL，以及South_America的id、名称和URL，按South_America的名称降序排列，限制返回一条记录",
        "output": "match (n1:place)-[r1:ispartof]->(n2:place)  where n2.name='South_America' return n1.id, n1.name, n2.name, n2.url, n2.id, n1.url order by n2.name desc limit 1"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Bing_Crosby in Belgorod'的节点\nlabel为forum,属性title='Group for Sergei_Eisenstein in Bijie'的节点\nlabel为organisation,属性name='American_University_in_Bosnia_and_Herzegovina'的节点\nlabel为organisation,属性name='Nordic_Regional'的节点\nlabel为organisation,属性name='European_Institute_of_Education'的节点\nlabel为place,属性name='Bosnia_and_Herzegovina'的节点\nlabel为place,属性name='Distrito_de_Bellavista'的节点\nlabel为place,属性name='Ivanovo_Oblast'的节点\nlabel为tag,属性name='Bosnia_and_Herzegovina'的节点\nlabel为tag,属性name='Federation_of_Bosnia_and_Herzegovina'的节点\nlabel为tag,属性name='Organization_for_Security_and_Co-operation_in_Europe'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Bosnia_and_Herzegovina作为Europe的一部分的地方id",
        "output": "match (n1:place)-[r1:ispartof]->(n2:place)  where n1.name='Bosnia_and_Herzegovina' and n2.name='Europe' return n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='New_Bulgarian_University'的节点\nlabel为organisation,属性name='Aer_Lingus_Regional'的节点\nlabel为organisation,属性name='Global_Urban_Research_Unit'的节点\nlabel为place,属性name='Distrito_de_Bellavista'的节点\nlabel为place,属性name='Wilayah_Persekutuan_Kuala_Lumpur'的节点\nlabel为place,属性name='Bosnia_and_Herzegovina'的节点\nlabel为tag,属性name='Kingdom_of_Bulgaria'的节点\nlabel为tag,属性name='Principality_of_Bulgaria'的节点\nlabel为tag,属性name='Volga_Bulgaria'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Bulgaria所属的地区名称、Bulgaria的URL以及该地区的id和URL，已知该地区名称为Europe",
        "output": "match (n1:place)-[r1:ispartof]->(n2:place)  where n2.name='Europe' and n1.name='Bulgaria' return n2.name, n1.url, n2.id, n2.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Africa_One'的节点\nlabel为organisation,属性name='Catholic_University_of_Eastern_Africa'的节点\nlabel为organisation,属性name='Africa_Nazarene_University'的节点\nlabel为place,属性name='South_Africa'的节点\nlabel为place,属性name='Africa'的节点\nlabel为place,属性name='Zamboanga_City'的节点\nlabel为tag,属性name='South-West_Africa'的节点\nlabel为tag,属性name='Afrika_Bambaataa'的节点\nlabel为tag,属性name='French_Equatorial_Africa'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找属于非洲的地方的名称",
        "output": "match (n1:place)-[r1:ispartof]->(n2:place)  where n2.name='Africa' return n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Croatia_Airlines'的节点\nlabel为organisation,属性name='Centre_Européen_de_Recherches_Internationales_et_Stratégiques'的节点\nlabel为organisation,属性name='Eurojet_Romania'的节点\nlabel为place,属性name='Cagayan_de_Oro'的节点\nlabel为place,属性name='Bosnia_and_Herzegovina'的节点\nlabel为tag,属性name='Kingdom_of_Croatia-Slavonia'的节点\nlabel为tag,属性name='Serbia_and_Montenegro'的节点\nlabel为tag,属性name='Republic_of_Serbian_Krajina'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找属于欧洲的克罗地亚的名称",
        "output": "match (n1:place)-[r1:ispartof]->(n2:place)  where n2.name='Europe' and n1.name='Croatia' return n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Southern_States_University'的节点\nlabel为organisation,属性name='South-West_State_University'的节点\nlabel为organisation,属性name='Northwest_University_for_Nationalities'的节点\nlabel为place,属性name='North_America'的节点\nlabel为place,属性name='South_America'的节点\nlabel为place,属性name='Greater_Noida'的节点\nlabel为tag,属性name='Province_of_New_York'的节点\nlabel为tag,属性name='Idlewild_South'的节点\nlabel为tag,属性name='Search_for_the_New_Land'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找属于North_America的地点的id、网址、名称以及North_America的名称和id，限制返回5条结果",
        "output": "match (n1:place)-[r1:ispartof]->(n2:place)  where n2.name='North_America' return n1.id, n1.url, n2.name, n1.name, n2.id limit 5"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='European_University_at_Saint_Petersburg'的节点\nlabel为organisation,属性name='Centre_Européen_de_Recherches_Internationales_et_Stratégiques'的节点\nlabel为organisation,属性name='European_Institute_of_Education'的节点\nlabel为place,属性name='Europe'的节点\nlabel为place,属性name='Ústí_nad_Labem'的节点\nlabel为place,属性name='Distrito_de_Bellavista'的节点\nlabel为tag,属性name='Council_of_Europe'的节点\nlabel为tag,属性name='Serbia_and_Montenegro'的节点\nlabel为tag,属性name='Live_over_Europe_2007'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找属于Europe的地方名称，最多返回9个结果",
        "output": "match (n1:place)-[r1:ispartof]->(n2:place)  where n2.name='Europe' return n2.name limit 9"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Friedrich_Nietzsche in Poznań'的节点\nlabel为organisation,属性name='European_University_Institute'的节点\nlabel为organisation,属性name='Farnair_Switzerland'的节点\nlabel为organisation,属性name='Viadrina_European_University'的节点\nlabel为place,属性name='Freiburg_im_Breisgau'的节点\nlabel为place,属性name='Fuling_District'的节点\nlabel为tag,属性name='Western_European_Union'的节点\nlabel为tag,属性name='Austrian_Silesia'的节点\nlabel为tag,属性name='Live_over_Europe_2007'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找芬兰属于欧洲的信息，包括芬兰和欧洲的url、名称和id",
        "output": "match (n1:place)-[r1:ispartof]->(n2:place)  where n1.name='Finland' and n2.name='Europe' return n1.url, n2.name, n2.id, n1.id, n1.name, n2.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Southern_States_University'的节点\nlabel为organisation,属性name='North_American_College'的节点\nlabel为organisation,属性name='South-West_State_University'的节点\nlabel为place,属性name='North_America'的节点\nlabel为place,属性name='South_America'的节点\nlabel为place,属性name='North_Wales'的节点\nlabel为tag,属性name='British_North_America'的节点\nlabel为tag,属性name='Province_of_New_York'的节点\nlabel为tag,属性name='Great_Southern_Land'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找属于North_America的地方的名称",
        "output": "match (n1:place)-[r1:ispartof]->(n2:place)  where n2.name='North_America' return n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Asia_University'的节点\nlabel为organisation,属性name='University_of_East_Asia'的节点\nlabel为organisation,属性name='South_Asian_University'的节点\nlabel为place,属性name='Yongkang_District'的节点\nlabel为place,属性name='Hung_Yen_province'的节点\nlabel为place,属性name='Songjiang_District'的节点\nlabel为tag,属性name='South_Asian_Association_for_Regional_Cooperation'的节点\nlabel为tag,属性name='Japanese_occupation_of_Hong_Kong'的节点\nlabel为tag,属性name='Southern_Han'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Hong_Kong所属的亚洲地区的url和名称",
        "output": "match (n1:place)-[r1:ispartof]->(n2:place)  where n1.name='Hong_Kong' and n2.name='Asia' return n1.url, n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Asia_University'的节点\nlabel为organisation,属性name='Asia_LIFE_University'的节点\nlabel为organisation,属性name='University_of_East_Asia'的节点\nlabel为place,属性name='Addis_Ababa'的节点\nlabel为place,属性name='Anantapur_district'的节点\nlabel为place,属性name='Jiaganj_Azimganj'的节点\nlabel为tag,属性name='Iparhi_Agapi_Edo'的节点\nlabel为tag,属性name='South_Asian_Association_for_Regional_Cooperation'的节点\nlabel为tag,属性name='Aceh_Sultanate'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找属于亚洲的地方的id、名称以及亚洲的URL",
        "output": "match (n1:place)-[r1:ispartof]->(n2:place)  where n2.name='Asia' return n1.id, n1.name, n2.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Joseph_Haydn in Solapur'的节点\nlabel为forum,属性title='Group for Julie_Andrews in Shah_Alam'的节点\nlabel为organisation,属性name='Air_Arabia_Jordan'的节点\nlabel为organisation,属性name='Al-Zaytoonah_University_of_Jordan'的节点\nlabel为organisation,属性name='Jordan_Aviation'的节点\nlabel为place,属性name='Jiaganj_Azimganj'的节点\nlabel为place,属性name='Central_Jakarta'的节点\nlabel为place,属性name='Anantapur_district'的节点\nlabel为tag,属性name='Michael_Jordan'的节点\nlabel为tag,属性name='Abdullah_II_of_Jordan'的节点\nlabel为tag,属性name='Hussein_of_Jordan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Jordan所属的Asia的信息，包括Asia的名称、URL和ID，以及Jordan的ID、名称和URL",
        "output": "match (n1:place)-[r1:ispartof]->(n2:place)  where n2.name='Asia' and n1.name='Jordan' return n2.name, n2.url, n1.id, n1.name, n1.url, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Malayan_Colleges_Laguna'的节点\nlabel为organisation,属性name='University_of_South_Asia,_Lahore'的节点\nlabel为organisation,属性name='LAN_Perú'的节点\nlabel为place,属性name='Kuala_Lumpur'的节点\nlabel为place,属性name='Wilayah_Persekutuan_Kuala_Lumpur'的节点\nlabel为place,属性name='Bandar_Lampung'的节点\nlabel为tag,属性name='Papua_New_Guinea'的节点\nlabel为tag,属性name='Kingdom_of_Laos'的节点\nlabel为tag,属性name='South_Asian_Association_for_Regional_Cooperation'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找亚洲下的老挝的名称和网址，并按名称排序，返回前11条结果",
        "output": "match (n1:place)-[r1:ispartof]->(n2:place)  where n2.name='Asia' and n1.name='Laos' return n1.name, n1.url order by n1.name limit 11"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Explora_Italia'的节点\nlabel为organisation,属性name='Air_Transport_Europe'的节点\nlabel为organisation,属性name='European_University_Institute'的节点\nlabel为tag,属性name='Seventeen_Provinces'的节点\nlabel为tag,属性name='Live_over_Europe_2007'的节点\nlabel为tag,属性name='German_East_Africa'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n跳过16条记录，限制返回7条记录，查找属于Europe的地方的url、id以及这些地方的id、名称和url",
        "output": "match (n1:place)-[r1:ispartof]->(n2:place)  where n2.name='Europe' return n2.url, n2.id, n1.id, n1.name, n1.url skip 16 limit 7"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Osama_bin_Laden in Toliara'的节点\nlabel为organisation,属性name='University_of_Liberia'的节点\nlabel为organisation,属性name='Libyan_International_Medical_University'的节点\nlabel为organisation,属性name='University_of_Libya'的节点\nlabel为place,属性name='Larkana_District'的节点\nlabel为tag,属性name='La_Isla_Bonita'的节点\nlabel为tag,属性name='Italian_East_Africa'的节点\nlabel为tag,属性name='Afrika_Bambaataa'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Liberia的id、URL和名称，并按名称排序，其中Liberia属于非洲",
        "output": "match (n1:place)-[r1:ispartof]->(n2:place)  where n2.name='Africa' and n1.name='Liberia' return n1.id, n1.url, n1.name order by n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Libyan_International_Medical_University'的节点\nlabel为organisation,属性name='Air_Lithuania'的节点\nlabel为organisation,属性name='Libyan_Airlines'的节点\nlabel为place,属性name='Wilayah_Persekutuan_Kuala_Lumpur'的节点\nlabel为place,属性name='Iloilo_City'的节点\nlabel为place,属性name='Larkana_District'的节点\nlabel为tag,属性name='Illyrian_Provinces'的节点\nlabel为tag,属性name='Lithuanian_Soviet_Socialist_Republic'的节点\nlabel为tag,属性name='Kingdom_of_León'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Lithuania所属的地方的名称、Lithuania的url、所属地方的id以及Lithuania的id，并按所属地方的名称排序",
        "output": "match (n1:place)-[r1:ispartof]->(n2:place)  where n1.name='Lithuania' return n2.name, n1.url, n2.id, n1.id order by n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='European_University_Institute'的节点\nlabel为organisation,属性name='European_Institute_of_Education'的节点\nlabel为organisation,属性name='Centre_Européen_de_Recherches_Internationales_et_Stratégiques'的节点\nlabel为tag,属性name='Western_European_Union'的节点\nlabel为tag,属性name='Live_over_Europe_2007'的节点\nlabel为tag,属性name='European_Son'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找属于Europe的地方的URL和id，以及Europe的id和URL",
        "output": "match (n1:place)-[r1:ispartof]->(n2:place)  where n2.name='Europe' return n1.url, n2.id, n2.url, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Africa_Nazarene_University'的节点\nlabel为organisation,属性name='Africa_Beza_College'的节点\nlabel为organisation,属性name='Africa_Beza_College'的节点\nlabel为place,属性name='South_Africa'的节点\nlabel为place,属性name='http://maps.google.com/maps?ll=25.530889,69.017306&spn=0.01,0.01&t=m&q=25.530889,69.017306'的节点\nlabel为tag,属性name='Afrika_Bambaataa'的节点\nlabel为tag,属性name='South-West_Africa'的节点\nlabel为tag,属性name='Union_of_South_Africa'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找属于非洲的地方的URL",
        "output": "match (n1:place)-[r1:ispartof]->(n2:place)  where n2.name='Africa' return n2.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Mariano_Marcos_State_University'的节点\nlabel为organisation,属性name='University_of_Mauritius'的节点\nlabel为organisation,属性name='Universidad_Metropolitana_de_Monterrey'的节点\nlabel为place,属性name='Chorrillos_District'的节点\nlabel为place,属性name='Tiruvallur_district'的节点\nlabel为place,属性name='Wilayah_Persekutuan_Kuala_Lumpur'的节点\nlabel为tag,属性name='Illyrian_Provinces'的节点\nlabel为tag,属性name='Sultanate_of_Maguindanao'的节点\nlabel为tag,属性name='Sovereign_Military_Order_of_Malta'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Mauritius所属的地方的信息，包括上级地点的URL、Mauritius的URL、Mauritius的名称、上级地点的名称、上级地点的id和Mauritius的id，并按上级地点的名称排序",
        "output": "match (n1:place)-[r1:ispartof]->(n2:place)  where n1.name='Mauritius' return n2.url, n1.url, n1.name, n2.name, n2.id, n1.id order by n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Mahmud_of_Ghazni in Raniganj'的节点\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为forum,属性title='Group for Genghis_Khan in Asadabad'的节点\nlabel为organisation,属性name='Mongolia_International_University'的节点\nlabel为organisation,属性name='Mongolian_University_of_Science_and_Technology'的节点\nlabel为organisation,属性name='MIAT_Mongolian_Airlines'的节点\nlabel为place,属性name='Kemerovo_Oblast'的节点\nlabel为place,属性name='Mongolia'的节点\nlabel为place,属性name='Manokwari_Regency'的节点\nlabel为tag,属性name='Mongol_Empire'的节点\nlabel为tag,属性name='Mongolia'的节点\nlabel为tag,属性name='Timurid_dynasty'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找蒙古所属的地方的名称、id、网址以及蒙古自身的名称、id和网址",
        "output": "match (n1:place)-[r1:ispartof]->(n2:place)  where n1.name='Mongolia' return n1.name, n2.id, n2.url, n1.url, n2.name, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Africa_Beza_College'的节点\nlabel为organisation,属性name='Africa_Beza_College'的节点\nlabel为organisation,属性name='Africa_Beza_College'的节点\nlabel为place,属性name='Addis_Ababa'的节点\nlabel为place,属性name='South_Africa'的节点\nlabel为tag,属性name='Italian_East_Africa'的节点\nlabel为tag,属性name='Central_African_Republic'的节点\nlabel为tag,属性name='Afrika_Bambaataa'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找属于非洲的地方的id和非洲的网址",
        "output": "match (n1:place)-[r1:ispartof]->(n2:place)  where n2.name='Africa' return n1.id, n2.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Open_Universities_Australia'的节点\nlabel为organisation,属性name='Open_University_in_the_Netherlands'的节点\nlabel为organisation,属性name='UCLA_School_of_Nursing'的节点\nlabel为place,属性name='http://maps.google.com/maps?ll=25.530889,69.017306&spn=0.01,0.01&t=m&q=25.530889,69.017306'的节点\nlabel为tag,属性name='Norfolk_Island'的节点\nlabel为tag,属性name='Netherlands_New_Guinea'的节点\nlabel为tag,属性name='Anne_of_Austria'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找新西兰在澳大利亚中的URL信息",
        "output": "match (n1:place)-[r1:ispartof]->(n2:place)  where n1.name='New_Zealand' and n2.name='Australia' return n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Nordic_Regional'的节点\nlabel为organisation,属性name='National_University_of_Ireland'的节点\nlabel为organisation,属性name='National_College_of_Ireland'的节点\nlabel为place,属性name='Northern_Ireland'的节点\nlabel为place,属性name='North_Wales'的节点\nlabel为place,属性name='Republic_of_Ireland'的节点\nlabel为tag,属性name='Northern_Ireland'的节点\nlabel为tag,属性name='Idlewild_South'的节点\nlabel为tag,属性name='Danish_West_Indies'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Northern_Ireland所属的欧洲地区的id和Northern_Ireland的名称",
        "output": "match (n1:place)-[r1:ispartof]->(n2:place)  where n1.name='Northern_Ireland' and n2.name='Europe' return n2.id, n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Friedrich_Nietzsche in Poznań'的节点\nlabel为organisation,属性name='Escadrille_Nationale_du_Niger'的节点\nlabel为organisation,属性name='Norway_Airlines'的节点\nlabel为organisation,属性name='Norwegian_Air_Lines'的节点\nlabel为place,属性name='Norway'的节点\nlabel为tag,属性name='Nordic_countries'的节点\nlabel为tag,属性name='Kingdom_of_the_Netherlands'的节点\nlabel为tag,属性name='Kingdom_of_Nekor'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找属于欧洲的挪威的名字",
        "output": "match (n1:place)-[r1:ispartof]->(n2:place)  where n1.name='Norway' and n2.name='Europe' return n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Okan_University'的节点\nlabel为organisation,属性name='Anadolu_University'的节点\nlabel为organisation,属性name='Universitas_Methodist_Indonesia'的节点\nlabel为place,属性name='Ciudad_Obregón'的节点\nlabel为place,属性name='Wilayah_Persekutuan_Kuala_Lumpur'的节点\nlabel为place,属性name='Addis_Ababa'的节点\nlabel为tag,属性name='Osama_bin_Laden'的节点\nlabel为tag,属性name='Odoru_Pompokolin'的节点\nlabel为tag,属性name='Solomon_Islands'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Oman所属的亚洲地区的url、id，以及Oman的id、名称和url，并按Oman的名称排序",
        "output": "match (n1:place)-[r1:ispartof]->(n2:place)  where n2.name='Asia' and n1.name='Oman' return n2.url, n2.id, n1.id, n1.name, n1.url order by n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Latin_University_of_Panama'的节点\nlabel为organisation,属性name='National_University_of_La_Pampa'的节点\nlabel为organisation,属性name='Technological_University_of_Panama'的节点\nlabel为place,属性name='Panama_City'的节点\nlabel为tag,属性name='In_Search_of_Sunrise_3:_Panama'的节点\nlabel为tag,属性name='Las_Palabras_de_Amor'的节点\nlabel为tag,属性name='Territory_of_Papua'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Panama所属的地方的url和名称，最多返回2个结果",
        "output": "match (n1:place)-[r1:ispartof]->(n2:place)  where n1.name='Panama' return n2.url, n2.name limit 2"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Vytautas in Banda_Aceh'的节点\nlabel为forum,属性title='Group for Vytautas in Banda_Aceh'的节点\nlabel为forum,属性title='Group for Benny_Goodman in Vadodara'的节点\nlabel为organisation,属性name='International_Balkan_University'的节点\nlabel为organisation,属性name='Indonesian_Adventist_University'的节点\nlabel为organisation,属性name='Indonesia_University_of_Education'的节点\nlabel为place,属性name='Papua_New_Guinea'的节点\nlabel为tag,属性name='Papua_New_Guinea'的节点\nlabel为tag,属性name='United_States_Virgin_Islands'的节点\nlabel为tag,属性name='La_Isla_Bonita'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找澳大利亚包含的巴布亚新几内亚的id以及澳大利亚的id",
        "output": "match (n1:place)-[r1:ispartof]->(n2:place)  where n2.name='Australia' and n1.name='Papua_New_Guinea' return n2.id, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为organisation,属性name='Rio_Branco_Institute'的节点\nlabel为organisation,属性name='Diponegoro_University'的节点\nlabel为organisation,属性name='MIP_Politecnico_di_Milano'的节点\nlabel为place,属性name='Pinar_del_Río'的节点\nlabel为place,属性name='Puerto_Rico'的节点\nlabel为place,属性name='Chorrillos_District'的节点\nlabel为tag,属性name='Al_otro_lado_del_río'的节点\nlabel为tag,属性name='Spanish_East_Indies'的节点\nlabel为tag,属性name='Benicio_del_Toro'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Puerto_Rico所属的北美洲的URL，以及Puerto_Rico的名称和ID",
        "output": "match (n1:place)-[r1:ispartof]->(n2:place)  where n1.name='Puerto_Rico' and n2.name='North_America' return n2.url, n1.name, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='European_University_Institute'的节点\nlabel为organisation,属性name='European_Institute_of_Education'的节点\nlabel为organisation,属性name='Centre_Européen_de_Recherches_Internationales_et_Stratégiques'的节点\nlabel为place,属性name='Ústí_nad_Labem'的节点\nlabel为place,属性name='Iloilo_City'的节点\nlabel为tag,属性name='Western_European_Union'的节点\nlabel为tag,属性name='Council_of_Europe'的节点\nlabel为tag,属性name='Organization_for_Security_and_Co-operation_in_Europe'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找属于Europe的地方的URL、地方的id、名字以及Europe的名字",
        "output": "match (n1:place)-[r1:ispartof]->(n2:place)  where n2.name='Europe' return n2.url, n1.id, n1.name, n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='University_of_Macedonia'的节点\nlabel为organisation,属性name='Mariano_Marcos_State_University'的节点\nlabel为organisation,属性name='Mordovian_State_University'的节点\nlabel为place,属性name='Republic_of_Macedonia'的节点\nlabel为place,属性name='Quezon_City'的节点\nlabel为tag,属性name='Republic_of_Macedonia'的节点\nlabel为tag,属性name='Kingdom_of_Montenegro'的节点\nlabel为tag,属性name='Province_of_Maryland'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Republic_of_Macedonia所属的地方的信息，包括它的名称、网址、所属地的id和名称，以及它自己的id，结果按所属地名称排序",
        "output": "match (n1:place)-[r1:ispartof]->(n2:place)  where n1.name='Republic_of_Macedonia' return n1.name, n1.url, n2.id, n2.name, n1.id order by n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Catholic_University_of_Eastern_Africa'的节点\nlabel为organisation,属性name='Africa_Nazarene_University'的节点\nlabel为organisation,属性name='Africa_Beza_College'的节点\nlabel为place,属性name='South_Africa'的节点\nlabel为tag,属性name='Italian_East_Africa'的节点\nlabel为tag,属性name='Central_African_Republic'的节点\nlabel为tag,属性name='Union_of_South_Africa'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找非洲所属的地方的url和id",
        "output": "match (n1:place)-[r1:ispartof]->(n2:place)  where n2.name='Africa' return n2.url, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='European_University_Institute'的节点\nlabel为organisation,属性name='Iaşi_Institute_of_European_Studies'的节点\nlabel为organisation,属性name='Viadrina_European_University'的节点\nlabel为place,属性name='Northern_Ireland'的节点\nlabel为tag,属性name='Anglo-Egyptian_Sudan'的节点\nlabel为tag,属性name='Western_European_Union'的节点\nlabel为tag,属性name='Austrian_Silesia'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找属于欧洲的苏格兰的id",
        "output": "match (n1:place)-[r1:ispartof]->(n2:place)  where n2.name='Europe' and n1.name='Scotland' return n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='South_Asian_University'的节点\nlabel为organisation,属性name='Singapore_Airlines'的节点\nlabel为organisation,属性name='Serviços_Aéreos_Cruzeiro_do_Sul'的节点\nlabel为place,属性name='SingaporeCity'的节点\nlabel为place,属性name='Singapore'的节点\nlabel为place,属性name='Nakhon_Pathom_Province'的节点\nlabel为tag,属性name='South_Asian_Association_for_Regional_Cooperation'的节点\nlabel为tag,属性name='Sri_Aurobindo'的节点\nlabel为tag,属性name='Japanese_occupation_of_Singapore'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找新加坡所属的亚洲地区的名称、URL和新加坡的名称，并按新加坡的名称排序",
        "output": "match (n1:place)-[r1:ispartof]->(n2:place)  where n1.name='Singapore' and n2.name='Asia' return n2.name, n2.url, n1.name order by n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='NetJets_Europe'的节点\nlabel为organisation,属性name='Explora_Italia'的节点\nlabel为organisation,属性name='Ege_University'的节点\nlabel为place,属性name='http://maps.google.com/maps?ll=25.530889,69.017306&spn=0.01,0.01&t=m&q=25.530889,69.017306'的节点\nlabel为tag,属性name='Seventeen_Provinces'的节点\nlabel为tag,属性name='Live_over_Europe_2007'的节点\nlabel为tag,属性name='California_Über_Alles'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n跳过11个结果，返回属于欧洲的地点的URL，限制返回3个结果",
        "output": "match (n1:place)-[r1:ispartof]->(n2:place)  where n2.name='Europe' return n2.url skip 11 limit 3"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Centre_Européen_de_Recherches_Internationales_et_Stratégiques'的节点\nlabel为organisation,属性name='European_University_Institute'的节点\nlabel为organisation,属性name='European_Institute_of_Education'的节点\nlabel为place,属性name='Major_Cities'的节点\nlabel为place,属性name='Iloilo_City'的节点\nlabel为place,属性name='Europe'的节点\nlabel为tag,属性name='Seventeen_Provinces'的节点\nlabel为tag,属性name='German_East_Africa'的节点\nlabel为tag,属性name='Live_over_Europe_2007'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找属于Europe的14个地方的id和名称",
        "output": "match (n1:place)-[r1:ispartof]->(n2:place)  where n2.name='Europe' return n2.id, n1.name limit 14"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Zamboanga_National_High_School_West'的节点\nlabel为organisation,属性name='University_of_Swaziland'的节点\nlabel为organisation,属性name='Northwestern_Visayan_Colleges'的节点\nlabel为place,属性name='Sittwe_District'的节点\nlabel为place,属性name='Zamboanga_City'的节点\nlabel为place,属性name='Wilayah_Persekutuan_Kuala_Lumpur'的节点\nlabel为tag,属性name='County_of_Savoy'的节点\nlabel为tag,属性name='South_Georgia_and_the_South_Sandwich_Islands'的节点\nlabel为tag,属性name='Union_of_South_Africa'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Swaziland所属的地区名称，以及该地区的上级地区名称",
        "output": "match (n1:place)-[r1:ispartof]->(n2:place)  where n1.name='Swaziland' and n2.name='Africa' return n2.name, n1.name"
    }
]