[
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 20 of Zdenek Balcar'的节点\nlabel为forum,属性title='Album 21 of Zdenek Balcar'的节点\nlabel为forum,属性title='Album 22 of Zdenek Balcar'的节点\nlabel为organisation,属性name='Gheorghe_Zane_University'的节点\nlabel为organisation,属性name='Zaoksky_Adventist_University'的节点\nlabel为organisation,属性name='Gdańsk_University_of_Technology'的节点\nlabel为tag,属性name='Zakk_Wylde'的节点\nlabel为tag,属性name='The_Dethalbum'的节点\nlabel为tag,属性name='Glenn_Danzig'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Zdenek Balcar的Album 20的管理员Zdenek的信息，包括管理员的名、论坛的标题、管理员的创建日期、论坛的id、管理员的id、管理员的邮箱、论坛的创建日期、管理员的姓、管理员的性别、管理员使用的浏览器和语言",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n2.firstname='Zdenek' and n1.title='Album 20 of Zdenek Balcar' return n2.firstname, n1.title, n2.creationdate, n1.id, n2.id, n2.email, n1.creationdate, n2.lastname, n2.gender, n2.browserused, n2.language"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Wall of Sven Persson'的节点\nlabel为forum,属性title='Group for Robert_Louis_Stevenson in Poznań'的节点\nlabel为forum,属性title='Album 29 of Sven Persson'的节点\nlabel为organisation,属性name='Webster_University_Vienna'的节点\nlabel为organisation,属性name='PEF_Private_University_of_Management_Vienna'的节点\nlabel为organisation,属性name='Sigmund_Freud_University_Vienna'的节点\nlabel为person,属性firstname='Sven'的节点\nlabel为person,属性firstname='Sven'的节点\nlabel为tag,属性name='Shel_Silverstein'的节点\nlabel为tag,属性name='Robert_Penn_Warren'的节点\nlabel为tag,属性name='John_Paul_Stevens'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Sven且是Wall of Sven Persson论坛管理员的个人信息，包括他的语言、创建日期、id、位置IP，以及论坛的id和标题",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n2.firstname='Sven' and n1.title='Wall of Sven Persson' return n2.language, n2.creationdate, n2.id, n2.locationip, n1.id, n1.title"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Sigmund_Freud_University_Vienna'的节点\nlabel为organisation,属性name='Sigmund_Freud_University_Vienna'的节点\nlabel为organisation,属性name='Jenderal_Soedirman_University'的节点\nlabel为tag,属性name='Steve_Allen'的节点\nlabel为tag,属性name='Wingspan:_Hits_and_History'的节点\nlabel为tag,属性name='Somdev_Devvarman'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Sven担任管理员的论坛的id、标题以及Sven的id、性别、邮箱、IP地址、语言、名字、论坛的创建日期、Sven使用的浏览器、生日和创建日期，同时返回关系的创建日期",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n2.firstname='Sven' return n1.id, n1.title, n2.id, n2.gender, n2.email, n2.locationip, n2.language, n2.firstname, n1.creationdate, n2.browserused, n2.birthday, n2.creationdate, r1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='DG_Vaishnav_College'的节点\nlabel为organisation,属性name='Gateway_Community_College'的节点\nlabel为tag,属性name='My_Back_Pages'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Wall of Dith Chau的管理员使用的浏览器信息",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n1.title='Wall of Dith Chau' return n2.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Diederich_College_of_Communication'的节点\nlabel为organisation,属性name='Daeduk_College'的节点\nlabel为organisation,属性name='DIT_Faculty_of_Science'的节点\nlabel为tag,属性name='David_H._DePatie'的节点\nlabel为tag,属性name='Denis_Diderot'的节点\nlabel为tag,属性name='Ted_DiBiase'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名字为Dith的人作为管理员的论坛的详细信息，包括该人的浏览器使用情况、名字、创建日期、姓氏、性别、电子邮件、生日、位置IP、语言，以及论坛的标题、创建日期和关系的创建日期。",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n2.firstname='Dith' return n2.browserused, n2.firstname, n2.creationdate, n2.lastname, n2.gender, n1.title, n2.email, n2.birthday, n2.locationip, n2.language, n1.creationdate, r1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Vignan_University'的节点\nlabel为organisation,属性name='Vignan_Institute_of_Technology_and_Science'的节点\nlabel为organisation,属性name='Vincent_Aviation'的节点\nlabel为tag,属性name='Martin_Van_Buren'的节点\nlabel为tag,属性name='Allen_Iverson'的节点\nlabel为tag,属性name='Richard_Owen'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Ivan担任管理员的论坛，返回Ivan的生日、邮箱、所在论坛的标题、使用的浏览器、Ivan的id、关系创建日期、论坛的创建日期、Ivan的语言、Ivan的创建日期、Ivan的性别、Ivan的名、Ivan的位置IP以及论坛的id，限制返回5条结果。",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n2.firstname='Ivan' return n2.birthday, n2.email, n1.title, n2.browserused, n2.id, r1.creationdate, n1.creationdate, n2.language, n2.creationdate, n2.gender, n2.firstname, n2.locationip, n1.id limit 5"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Telfer_School_of_Management'的节点\nlabel为organisation,属性name='Macquarie_Graduate_School_of_Management'的节点\nlabel为organisation,属性name='Maastricht_School_of_Management'的节点\nlabel为tag,属性name='My_December'的节点\nlabel为tag,属性name='The_Secret_Sessions'的节点\nlabel为tag,属性name='7_of_the_Month_Club'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由名为Mee的人管理的论坛的详细信息，包括管理者的浏览器使用情况、论坛的创建日期、管理者的性别、姓氏、创建日期、论坛的id、管理者的生日、邮箱和id，跳过前13条记录，返回接下来的11条记录。",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n2.firstname='Mee' return n2.browserused, n1.creationdate, n2.gender, n2.lastname, n2.creationdate, n1.id, n2.birthday, n2.email, n2.id skip 13 limit 11"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Wall of Bechir Cardinale'的节点\nlabel为forum,属性title='Group for Patrick_Vieira in Insein_Township'的节点\nlabel为forum,属性title='Group for Joseph_Stalin in Bijie'的节点\nlabel为organisation,属性name='Xavier_Institute_of_Management,_Bhubaneswar'的节点\nlabel为organisation,属性name='Basanti_Devi_College'的节点\nlabel为organisation,属性name='Pasquerilla_East_Hall'的节点\nlabel为tag,属性name='Archbishopric_of_Mainz'的节点\nlabel为tag,属性name='Welcome_Interstate_Managers'的节点\nlabel为tag,属性name='Cardinal_Mazarin'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Wall of Bechir Cardinale的管理员的姓氏、论坛的id、管理员的IP地址和性别",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n1.title='Wall of Bechir Cardinale' return n2.lastname, n1.id, n2.locationip, n2.gender"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 0 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 4 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 0 of Hassan Forouhar'的节点\nlabel为organisation,属性name='Michael_Madhusudan_Memorial_College'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Sardar_Patel_University'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\nlabel为tag,属性name='Leander_Paes'的节点\nlabel为tag,属性name='The_Punisher:_The_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 0 of Hossein Forouhar中包含Leander_Paes标签的信息，返回该标签的id、关联关系的创建日期、标签的URL、论坛的创建日期、论坛的标题以及标签的名称，最多返回4条记录。",
        "output": "match (n1:forum)-[r1:hastagforum]->(n2:tag)  where n2.name='Leander_Paes' and n1.title='Album 0 of Hossein Forouhar' return n2.id, r1.creationdate, n2.url, n1.creationdate, n1.title, n2.name limit 4"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 1 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 1 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 3 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Xavier_Institute_of_Management,_Bhubaneswar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为place,属性name='Vallabh_Vidhyanagar'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='WWF_The_Music,_Vol._3'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 1 of Hossein Forouhar中具有Ralph_Vaughan_Williams标签的信息，返回标签的URL、论坛的标题和创建日期、标签的名称和创建日期、以及标签的ID，最多返回3条记录。",
        "output": "match (n1:forum)-[r1:hastagforum]->(n2:tag)  where n1.title='Album 1 of Hossein Forouhar' and n2.name='Ralph_Vaughan_Williams' return n2.url, n1.title, n1.creationdate, n2.name, r1.creationdate, n2.id limit 3"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 2 of Abdullah Koksal'的节点\nlabel为forum,属性title='Album 2 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 0 of Abdullah Koksal'的节点\nlabel为organisation,属性name='Harimohan_Ghosh_College'的节点\nlabel为organisation,属性name='Al_Kabir_Polytechnic'的节点\nlabel为organisation,属性name='Curtis_Institute_of_Music'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='The_Grind_Date'的节点\nlabel为tag,属性name='Gangsta_Grillz:_The_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 2 of Hossein Forouhar中包含标签Gold_Digger的关联关系的创建日期",
        "output": "match (n1:forum)-[r1:hastagforum]->(n2:tag)  where n2.name='Gold_Digger' and n1.title='Album 2 of Hossein Forouhar' return r1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 3 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 3 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 13 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Sindh_Madrasatul_Islam'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='WWF_The_Music,_Vol._3'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 3 of Hossein Forouhar的具有的标签信息的id，论坛的id、创建日期、标题以及标签名称",
        "output": "match (n1:forum)-[r1:hastagforum]->(n2:tag)  where n1.title='Album 3 of Hossein Forouhar' return n2.id, n1.id, n1.creationdate, n2.name, n1.title"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 4 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 4 of Abdul Haris Balawan'的节点\nlabel为forum,属性title='Album 4 of Hassan Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Blair_School_of_Music'的节点\nlabel为organisation,属性name='Shahid_Beheshti_University'的节点\nlabel为tag,属性name='The_Help_Album'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='Islamic_Courts_Union'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 4 of Hossein Forouhar与标签Wooly_Bully之间的关系，返回论坛的标题、id、创建日期，标签的名称和URL，以及关系的创建日期",
        "output": "match (n1:forum)-[r1:hastagforum]->(n2:tag)  where n1.title='Album 4 of Hossein Forouhar' and n2.name='Wooly_Bully' return n1.title, n1.id, n2.name, n1.creationdate, r1.creationdate, n2.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 14 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 5 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 14 of Hassan Forouhar'的节点\nlabel为organisation,属性name='Rafael_Belloso_Chacin_University'的节点\nlabel为organisation,属性name='University_of_Naples_Federico_II'的节点\nlabel为organisation,属性name='Adolfo_Ibáñez_University'的节点\nlabel为place,属性name='Chorrillos_District'的节点\nlabel为tag,属性name='Philip_IV_of_Spain'的节点\nlabel为tag,属性name='Philip_II_of_Spain'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 5 of Hossein Forouhar中与Philip_II_of_Spanish相关的标签的URL，关系的创建日期，论坛的标题和创建日期，以及标签的名称，限制结果为14条。",
        "output": "match (n1:forum)-[r1:hastagforum]->(n2:tag)  where n1.title='Album 5 of Hossein Forouhar' and n2.name='Philip_II_of_Spain' return n2.url, r1.creationdate, n1.title, n1.creationdate, n2.name limit 14"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Open_Society_Archives'的节点\nlabel为organisation,属性name='Fatima_Jinnah_Women_University'的节点\nlabel为organisation,属性name='Link_Campus_University'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与Ella_Fitzgerald标签关联的论坛的创建日期、关系的创建日期、标签的id、论坛的id、论坛的标题和标签的URL",
        "output": "match (n1:forum)-[r1:hastagforum]->(n2:tag)  where n2.name='Ella_Fitzgerald' return n1.creationdate, r1.creationdate, n2.id, n1.id, n1.title, n2.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 7 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 7 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 27 of Hassan Forouhar'的节点\nlabel为organisation,属性name='Harimohan_Ghosh_College'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为tag,属性name='Jazz_from_Hell'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='Hussein_of_Jordan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 7 of Hossein Forouhar与Henry_James标签之间的关联创建日期",
        "output": "match (n1:forum)-[r1:hastagforum]->(n2:tag)  where n2.name='Henry_James' and n1.title='Album 7 of Hossein Forouhar' return r1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Link_Campus_University'的节点\nlabel为organisation,属性name='Ralph_J._Bunche_International_Affairs_Center'的节点\nlabel为organisation,属性name='Union_Theological_Seminary'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='The_Ball_Street_Journal'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与标签Bulletproof_Wallets关联的论坛的创建日期、论坛的id和标签的URL",
        "output": "match (n1:forum)-[r1:hastagforum]->(n2:tag)  where n2.name='Bulletproof_Wallets' return r1.creationdate, n1.id, n2.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 12 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 13 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 11 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Eastern_Fare_Music_Foundation'的节点\nlabel为organisation,属性name='Eastern_Fare_Music_Foundation'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为tag,属性name='Left_of_the_Middle'的节点\nlabel为tag,属性name='Left_Behind'的节点\nlabel为tag,属性name='Behind_the_Front'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 12 of Hossein Forouhar中包含标签Left_Behind的信息，返回标签的URL、论坛的标题、论坛的id、论坛的创建日期和标签的名称，最多返回18条记录",
        "output": "match (n1:forum)-[r1:hastagforum]->(n2:tag)  where n2.name='Left_Behind' and n1.title='Album 12 of Hossein Forouhar' return n2.url, n1.title, n1.id, n1.creationdate, n2.name limit 18"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 13 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 33 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 13 of Rahim Zaland'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Paul_Sabatier_University'的节点\nlabel为organisation,属性name='Baghlan_University'的节点\nlabel为place,属性name='Sahiwal_Division'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\nlabel为tag,属性name='Leander_Paes'的节点\nlabel为tag,属性name='Live_Phish_Volume_13'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 13 of Hossein Forouhar中具有Leander_Paes标签的信息，返回标签名称、论坛标题、关系的创建日期和论坛的创建日期，并按标签名称排序",
        "output": "match (n1:forum)-[r1:hastagforum]->(n2:tag)  where n1.title='Album 13 of Hossein Forouhar' and n2.name='Leander_Paes' return n2.name, n1.title, r1.creationdate, n1.creationdate order by n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 13 of Rudolf Engel'的节点\nlabel为forum,属性title='Album 13 of Jurgen Bettens'的节点\nlabel为forum,属性title='Album 13 of Bertin Bona'的节点\nlabel为organisation,属性name='Humboldt_University_of_Berlin'的节点\nlabel为organisation,属性name='Brighton_Institute_of_Modern_Music'的节点\nlabel为organisation,属性name='Brighton_Institute_of_Modern_Music'的节点\nlabel为tag,属性name='Ivan_Lendl'的节点\nlabel为tag,属性name='Led_Zeppelin_IV'的节点\nlabel为tag,属性name='Ludwig_Wittgenstein'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Ludwig van Beethoven的标签的id",
        "output": "match (n1:forum)-[r1:hastagforum]->(n2:tag)  where n2.name='Ludwig_van_Beethoven' return n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Open_Society_Archives'的节点\nlabel为tag,属性name='7_of_the_Month_Club'的节点\nlabel为tag,属性name='Days_of_Purgatory'的节点\nlabel为tag,属性name='Strawberry_Fields_Forever'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与标签Bulletproof_Wallets相关的论坛关系的创建日期，限制返回17条结果",
        "output": "match (n1:forum)-[r1:hastagforum]->(n2:tag)  where n2.name='Bulletproof_Wallets' return r1.creationdate limit 17"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 16 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 8 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 16 of Yasir Hussain'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Bahria_College_Islamabad'的节点\nlabel为organisation,属性name='Shahid_Beheshti_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='New_Muslim_Town'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='The_Help_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 16 of Hossein Forouhar中具有Wooly Buly标签的信息，包括论坛的创建日期、id、标题，标签的id、名称、URL，以及关系的创建日期，最多返回8条结果。",
        "output": "match (n1:forum)-[r1:hastagforum]->(n2:tag)  where n1.title='Album 16 of Hossein Forouhar' and n2.name='Wooly_Bully' return n1.creationdate, n1.id, n1.title, n2.id, n2.name, n2.url, r1.creationdate limit 8"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Open_Society_Archives'的节点\nlabel为organisation,属性name='John_Glenn_School_of_Public_Affairs'的节点\nlabel为organisation,属性name='Menno_Simons_College'的节点\nlabel为tag,属性name='Samuel_L._Jackson'的节点\nlabel为tag,属性name='John_Paul_Stevens'的节点\nlabel为tag,属性name='Samuel_Johnson'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与Samuel_Johnson标签关联的论坛关系的创建日期",
        "output": "match (n1:forum)-[r1:hastagforum]->(n2:tag)  where n2.name='Samuel_Johnson' return r1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Open_Society_Archives'的节点\nlabel为organisation,属性name='Debre_Markos_University'的节点\nlabel为organisation,属性name='Gabriel_Dumont_Institute'的节点\nlabel为tag,属性name='7_of_the_Month_Club'的节点\nlabel为tag,属性name='Bill_Davis'的节点\nlabel为tag,属性name='The_Dirtchamber_Sessions_Volume_One'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与Miles_Davis标签相关的论坛的信息，包括关系的创建日期、论坛的id、标签的id以及论坛的创建日期，跳过前14条记录，返回接下来的19条记录",
        "output": "match (n1:forum)-[r1:hastagforum]->(n2:tag)  where n2.name='Miles_Davis' return r1.creationdate, n1.id, n2.id, n1.creationdate skip 14 limit 19"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 19 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 19 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 19 of Faisal Ahmed'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Sindh_Madrasatul_Islam'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='The_Help_Album'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 19 of Hossein Forouhar的id、它具有的标签名称、关系的创建日期、论坛的创建日期和标题",
        "output": "match (n1:forum)-[r1:hastagforum]->(n2:tag)  where n1.title='Album 19 of Hossein Forouhar' return n1.id, n2.name, r1.creationdate, n1.creationdate, n1.title"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 20 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 20 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 21 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Sarajevo_Music_Academy'的节点\nlabel为organisation,属性name='Jamal_Mohamed_College'的节点\nlabel为place,属性name='Sahiwal_Division'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Wallis_and_Futuna'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 20 of Hossein Forouhar与Walter_Scott标签之间的关系创建日期，论坛的创建日期，标签的URL和名称",
        "output": "match (n1:forum)-[r1:hastagforum]->(n2:tag)  where n1.title='Album 20 of Hossein Forouhar' and n2.name='Walter_Scott' return r1.creationdate, n1.creationdate, n2.url, n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 21 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 21 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 21 of Mohamed Hassan'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Shahid_Beheshti_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='The_Help_Album'的节点\nlabel为tag,属性name='Some_Bizzare_Album'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 21 of Hossein Forouhar具有Bulletproof_Wallets标签的论坛id",
        "output": "match (n1:forum)-[r1:hastagforum]->(n2:tag)  where n1.title='Album 21 of Hossein Forouhar' and n2.name='Bulletproof_Wallets' return n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 21 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 22 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 24 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Obirin_Junior_College'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 22 of Hossein Forouhar与Roy Orbison标签之间的关系的创建日期，以及标签的id和名称，论坛的标题和创建日期",
        "output": "match (n1:forum)-[r1:hastagforum]->(n2:tag)  where n2.name='Roy_Orbison' and n1.title='Album 22 of Hossein Forouhar' return r1.creationdate, n2.name, n2.id, n1.title, n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 24 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 24 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 34 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Swathi_Thirunal_College_of_Music'的节点\nlabel为organisation,属性name='Sarajevo_Music_Academy'的节点\nlabel为organisation,属性name='Curtis_Institute_of_Music'的节点\nlabel为tag,属性name='For_the_Record'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='Franks_Wild_Years'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 24 of Hossein Forouhar与标签Walter Scott之间的关系的创建日期，以及Album 24 of Hossein Forouhar的创建日期，最多返回4条记录",
        "output": "match (n1:forum)-[r1:hastagforum]->(n2:tag)  where n2.name='Walter_Scott' and n1.title='Album 24 of Hossein Forouhar' return r1.creationdate, n1.creationdate limit 4"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 24 of Mohamed Hassan'的节点\nlabel为forum,属性title='Album 23 of Mohamed Hassan'的节点\nlabel为forum,属性title='Album 21 of Mohamed Hassan'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Michael_Madhusudan_Memorial_College'的节点\nlabel为organisation,属性name='Hugo_Lambrechts_Music_Centre'的节点\nlabel为place,属性name='New_Muslim_Town'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\nlabel为tag,属性name='Islamic_Courts_Union'的节点\nlabel为tag,属性name='Martin_Luther'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 25 of Hossein Forouhar中包含Martin_Luther标签的信息，返回关系的创建日期、标签的URL、名称、论坛的标题、标签的id以及论坛的创建日期，最多返回7条结果。",
        "output": "match (n1:forum)-[r1:hastagforum]->(n2:tag)  where n2.name='Martin_Luther' and n1.title='Album 25 of Hossein Forouhar' return r1.creationdate, n2.url, n2.name, n1.title, n2.id, n1.creationdate limit 7"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 26 of Amjad Islam Ahsan'的节点\nlabel为forum,属性title='Album 31 of Amjad Islam Ahsan'的节点\nlabel为forum,属性title='Group for Joseph_Haydn in Solapur'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Paul_Sabatier_University'的节点\nlabel为organisation,属性name='Sardar_Patel_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为place,属性name='Sahiwal_Division'的节点\nlabel为tag,属性name='Adil_Shahi_dynasty'的节点\nlabel为tag,属性name='Damon_Albarn'的节点\nlabel为tag,属性name='Philip_Sheridan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 26 of Hossein Forouhar中具有Adam_Sandler标签的信息，返回论坛的id、关系的创建日期、标签的名称和URL、标签的id、论坛的标题和论坛的创建日期，并按标签名称排序",
        "output": "match (n1:forum)-[r1:hastagforum]->(n2:tag)  where n1.title='Album 26 of Hossein Forouhar' and n2.name='Adam_Sandler' return n1.id, r1.creationdate, n2.name, n2.url, n2.id, n1.title, n1.creationdate order by n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Open_Society_Archives'的节点\nlabel为organisation,属性name='Huston–Tillotson_University'的节点\nlabel为organisation,属性name='Shafston_College'的节点\nlabel为tag,属性name='Charlton_Heston'的节点\nlabel为tag,属性name='John_Coltrane_and_Johnny_Hartman'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与标签Charlton_Heston相关的论坛，返回关系的创建日期、论坛的标题和创建日期、标签的URL和名称，以及它们的id",
        "output": "match (n1:forum)-[r1:hastagforum]->(n2:tag)  where n2.name='Charlton_Heston' return r1.creationdate, n1.title, n2.url, n2.name, n1.id, n2.id, n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 28 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 28 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 31 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Madarastul_Falaah_Kibra'的节点\nlabel为organisation,属性name='Al_Jamea_tus_Saifiyah'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='The_Help_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 28 of Hossein Forouhar的创建日期",
        "output": "match (n1:forum)-[r1:hastagforum]->(n2:tag)  where n1.title='Album 28 of Hossein Forouhar' return n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 29 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 27 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 31 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 29 of Hossein Forouhar的关联标签的创建日期、论坛的创建日期、标签的URL、论坛的id和标题，限制返回7条结果",
        "output": "match (n1:forum)-[r1:hastagforum]->(n2:tag)  where n1.title='Album 29 of Hossein Forouhar' return r1.creationdate, n1.creationdate, n2.url, n1.id, n1.title limit 7"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 30 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 30 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 31 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Al_Jamea_tus_Saifiyah'的节点\nlabel为organisation,属性name='Al_Jamea_tus_Saifiyah'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='20_Years_of_Jethro_Tull'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 30 of Hossein Forouhar中与Thomas_Jefferson相关的标签名称及其关联的创建日期，并按标签名称排序，限制返回7条结果",
        "output": "match (n1:forum)-[r1:hastagforum]->(n2:tag)  where n2.name='Thomas_Jefferson' and n1.title='Album 30 of Hossein Forouhar' return n2.name, r1.creationdate order by n2.name limit 7"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 31 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 31 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 31 of Amjad Islam Ahsan'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为tag,属性name='Islamic_Courts_Union'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 31 of Hossein Forouhar与Isaac Newton标签之间的关系，返回论坛的标题和id，标签的id和url，以及关系的创建日期",
        "output": "match (n1:forum)-[r1:hastagforum]->(n2:tag)  where n1.title='Album 31 of Hossein Forouhar' and n2.name='Isaac_Newton' return n1.title, n2.id, n1.id, n2.url, r1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 34 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 32 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 29 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Qazvin_Islamic_Azad_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Sahiwal_Division'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\nlabel为tag,属性name='Behind_These_Hazel_Eyes'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 32 of Hossein Forouhar具有的名为Shadow_Zone的标签的名称、论坛的id、标签的url以及关系的创建日期，最多返回9条结果",
        "output": "match (n1:forum)-[r1:hastagforum]->(n2:tag)  where n1.title='Album 32 of Hossein Forouhar' and n2.name='Shadow_Zone' return n2.name, n1.id, n2.url, r1.creationdate limit 9"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 33 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 33 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 30 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\nlabel为tag,属性name='Hussein_of_Jordan'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 33 of Hossein Forouhar与Samuel_Johnson标签关联的信息，返回论坛的创建日期、标签名称、论坛的id以及关系的创建日期",
        "output": "match (n1:forum)-[r1:hastagforum]->(n2:tag)  where n2.name='Samuel_Johnson' and n1.title='Album 33 of Hossein Forouhar' return n1.creationdate, n2.name, n1.id, r1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 31 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 30 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 31 of Hassan Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Vardhman_Mahavir_Medical_College'的节点\nlabel为organisation,属性name='Qazvin_Islamic_Azad_University'的节点\nlabel为place,属性name='Vallabh_Vidhyanagar'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\nlabel为tag,属性name='Ralph_Vaughan_Williams'的节点\nlabel为tag,属性name='The_Help_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 35 of Hossein Forouhar中具有Ralph_Vaughan_Williams标签的论坛的id、创建日期和标题，限制返回6条结果",
        "output": "match (n1:forum)-[r1:hastagforum]->(n2:tag)  where n1.title='Album 35 of Hossein Forouhar' and n2.name='Ralph_Vaughan_Williams' return n1.id, n1.creationdate, n1.title limit 6"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Admas_College'的节点\nlabel为organisation,属性name='Link_Campus_University'的节点\nlabel为organisation,属性name='Richard_J._Daley_College'的节点\nlabel为tag,属性name='Andy_Ram'的节点\nlabel为tag,属性name='Ayn_Rand'的节点\nlabel为tag,属性name='Alan_Ladd'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与标签Andy_Ram关联的论坛的id，以及该关系的创建日期和标签的URL和id",
        "output": "match (n1:forum)-[r1:hastagforum]->(n2:tag)  where n2.name='Andy_Ram' return r1.creationdate, n1.id, n2.url, n2.id"
    }
]