[
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Richard_Widmark'的节点\nlabel为tag,属性name='Wild_Bill_Hickok'的节点\nlabel为tag,属性name='Ike_Turner'的节点\nlabel为tagclass,属性name='IceHockeyPlayer'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为IceHockeyPlayer的标签类的id",
        "output": "match (n1:tagclass)  where n1.name='IceHockeyPlayer' return n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='USC_School_of_Architecture'的节点\nlabel为organisation,属性name='Tulane_School_of_Architecture'的节点\nlabel为organisation,属性name='Link_Campus_University'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Architect的标签类的URL",
        "output": "match (n1:tagclass)  where n1.name='Architect' return n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='IBAT_College'的节点\nlabel为organisation,属性name='IBAT_College'的节点\nlabel为tag,属性name='Bobby_Jindal'的节点\nlabel为tag,属性name='Zlatan_Ibrahimović'的节点\nlabel为tag,属性name='Pinball_Wizard'的节点\nlabel为tagclass,属性name='GridironFootballPlayer'的节点\nlabel为tagclass,属性name='BasketballPlayer'的节点\nlabel为tagclass,属性name='BaseballPlayer'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找标签类名为BasketballPlayer的id",
        "output": "match (n1:tagclass)  where n1.name='BasketballPlayer' return n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Škoda_Auto_University'的节点\nlabel为organisation,属性name='DAV_Public_School_Nerul'的节点\nlabel为organisation,属性name='UCLA_School_of_Nursing'的节点\nlabel为tag,属性name='Chasing_Cars'的节点\nlabel为tag,属性name='Devil_Gate_Drive'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tagclass,属性name='NascarDriver'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名称为NascarDriver的标签类的名称和URL",
        "output": "match (n1:tagclass)  where n1.name='NascarDriver' return n1.name, n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Baku_State_University'的节点\nlabel为organisation,属性name='Bulacan_State_University'的节点\nlabel为organisation,属性name='Paul_Sabatier_University'的节点\nlabel为tag,属性name='Geezer_Butler'的节点\nlabel为tag,属性name='Get_Ur_Freak_On'的节点\nlabel为tag,属性name='Hullabaloo_Soundtrack'的节点\nlabel为tagclass,属性name='BaseballPlayer'的节点\nlabel为tagclass,属性name='AmericanFootballPlayer'的节点\nlabel为tagclass,属性name='BasketballPlayer'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找BaseballPlayer的URL",
        "output": "match (n1:tagclass)  where n1.name='BaseballPlayer' return n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Episcopal_Divinity_School'的节点\nlabel为organisation,属性name='Martin_Luther_Christian_University'的节点\nlabel为organisation,属性name='Andrés_Bello_Catholic_University'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='On_My_Way_to_Church'的节点\nlabel为tag,属性name='Bishopric_of_Constance'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名称为ChristianBishop的标签类的url，最多返回5个结果",
        "output": "match (n1:tagclass)  where n1.name='ChristianBishop' return n1.url limit 5"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Cardonald_College'的节点\nlabel为organisation,属性name='Link_Campus_University'的节点\nlabel为organisation,属性name='De_La_Salle_John_Bosco_College'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名称为Chancellor的标签类的id、名称和URL，仅返回一条记录",
        "output": "match (n1:tagclass)  where n1.name='Chancellor' return n1.id, n1.name, n1.url limit 1"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Link_Campus_University'的节点\nlabel为organisation,属性name='Unitec_Institute_of_Technology'的节点\nlabel为organisation,属性name='Gordon_Institute_of_Business_Science'的节点\nlabel为tag,属性name='Islamic_Courts_Union'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名称为Organisation的标签类别的id和URL",
        "output": "match (n1:tagclass)  where n1.name='Organisation' return n1.id, n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Kobe_Shukugawa_Gakuin_University'的节点\nlabel为tag,属性name='The_Boxer'的节点\nlabel为tag,属性name='Juke_Box_Hero'的节点\nlabel为tag,属性name='Bob_Dylan_at_Budokan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Boxer的url、名称和id",
        "output": "match (n1:tagclass)  where n1.name='Boxer' return n1.url, n1.name, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='University_of_Florida_Athletic_Association'的节点\nlabel为organisation,属性name='Aerolloyd_Iguassu'的节点\nlabel为organisation,属性name='American_Indian_College'的节点\nlabel为tag,属性name='Adrian_Edmondson'的节点\nlabel为tag,属性name='AT&T_Team_USA_Soundtrack'的节点\nlabel为tag,属性name='Allen_Iverson'的节点\nlabel为tagclass,属性name='AmericanFootballPlayer'的节点\nlabel为tagclass,属性name='GridironFootballPlayer'的节点\nlabel为tagclass,属性name='SportsTeamMember'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找AmericanFootballPlayer的id",
        "output": "match (n1:tagclass)  where n1.name='AmericanFootballPlayer' return n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Vidya_Devi_Jindal_School'的节点\nlabel为organisation,属性name='Ida_Scudder_School'的节点\nlabel为organisation,属性name='Gorseinon_College'的节点\nlabel为tag,属性name='Richard_Brinsley_Sheridan'的节点\nlabel为tag,属性name='Bobby_Jindal'的节点\nlabel为tag,属性name='I_Got_Id'的节点\nlabel为tagclass,属性name='GridironFootballPlayer'的节点\nlabel为tagclass,属性name='SportsTeamMember'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为GridironFootballPlayer的标签类的id",
        "output": "match (n1:tagclass)  where n1.name='GridironFootballPlayer' return n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='SRM_Nightingale_School'的节点\nlabel为organisation,属性name='Link_Campus_University'的节点\nlabel为organisation,属性name='Strathclyde_Law_School'的节点\nlabel为tag,属性name='Snoop_Dogg'的节点\nlabel为tag,属性name='Jack_Straw'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tagclass,属性name='SnookerChamp'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为SnookerChamp的标签类的URL",
        "output": "match (n1:tagclass)  where n1.name='SnookerChamp' return n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Hogeschool_Gent'的节点\nlabel为organisation,属性name='Gachongil_College'的节点\nlabel为organisation,属性name='Antenor_Orrego_Private_University'的节点\nlabel为tag,属性name='Goon_Affiliated'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Governor的标签类的名称、id和URL",
        "output": "match (n1:tagclass)  where n1.name='Governor' return n1.name, n1.id, n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Model_Engineering_College'的节点\nlabel为organisation,属性name='Link_Campus_University'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名称为Model的标签类的url和id",
        "output": "match (n1:tagclass)  where n1.name='Model' return n1.url, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Link_Campus_University'的节点\nlabel为organisation,属性name='Ural_Federal_University'的节点\nlabel为organisation,属性name='Holy_Name_University'的节点\nlabel为tag,属性name='Psyence_Fiction'的节点\nlabel为tag,属性name='John_Legend'的节点\nlabel为tag,属性name='Gimme_Fiction'的节点\nlabel为tagclass,属性name='FictionalCharacter'的节点\nlabel为tagclass,属性name='ComicsCharacter'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找FictionalCharacter的url、id和名称",
        "output": "match (n1:tagclass)  where n1.name='FictionalCharacter' return n1.url, n1.id, n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Institute_of_Criminology_and_Criminal_Justice'的节点\nlabel为organisation,属性name='PLM_Graduate_School_of_Law'的节点\nlabel为organisation,属性name='John_Jay_College_of_Criminal_Justice'的节点\nlabel为tag,属性name='Smooth_Criminal'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Criminal的标签类的url、id和名称，并按名称排序",
        "output": "match (n1:tagclass)  where n1.name='Criminal' return n1.url, n1.id, n1.name order by n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Link_Campus_University'的节点\nlabel为organisation,属性name='John_Glenn_School_of_Public_Affairs'的节点\nlabel为organisation,属性name='UCLA_School_of_Public_Affairs'的节点\nlabel为tag,属性name='The_Complete_Library_of_Congress_Recordings'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Rebel_Meets_Rebel'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Congressman的标签类的URL",
        "output": "match (n1:tagclass)  where n1.name='Congressman' return n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Met_Film_School'的节点\nlabel为organisation,属性name='DOC_Film_Institute'的节点\nlabel为organisation,属性name='National_Film_School_in_Łódź'的节点\nlabel为tag,属性name='Girls_on_Film'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名称为Film的标签类的名称、URL和id",
        "output": "match (n1:tagclass)  where n1.name='Film' return n1.name, n1.url, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Link_Campus_University'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名称为Work的标签类的url和id",
        "output": "match (n1:tagclass)  where n1.name='Work' return n1.url, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Link_Campus_University'的节点\nlabel为organisation,属性name='Charles_O._Bick_College'的节点\nlabel为organisation,属性name='Cardonald_College'的节点\nlabel为tag,属性name='I_Love_College'的节点\nlabel为tagclass,属性name='CollegeCoach'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为CollegeCoach的标签类的id和名称",
        "output": "match (n1:tagclass)  where n1.name='CollegeCoach' return n1.id, n1.name"
    },
    {
        "instruction": "\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名称为AdultActor的标签类的url、id和名称",
        "output": "match (n1:tagclass)  where n1.name='AdultActor' return n1.url, n1.id, n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名称为Single的标签类的url、id和名称，并按名称降序排列",
        "output": "match (n1:tagclass)  where n1.name='Single' return n1.url, n1.id, n1.name order by n1.name desc"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 11 of Amjad Islam Ahsan'的节点\nlabel为organisation,属性name='Music_Industry_Arts'的节点\nlabel为organisation,属性name='Shepherd_School_of_Music'的节点\nlabel为organisation,属性name='An_Music_School'的节点\nlabel为tag,属性name='Complete_Music_Video_Collection'的节点\nlabel为tag,属性name='Gangsta_Grillz:_The_Album'的节点\nlabel为tag,属性name='Music_for_18_Musicians'的节点\nlabel为tagclass,属性name='MusicalWork'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名称为MusicalWork的标签类的id、url和名称，最多返回11条记录",
        "output": "match (n1:tagclass)  where n1.name='MusicalWork' return n1.id, n1.url, n1.name limit 11"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 1 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 1 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 31 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 1 of Hossein Forouhar包含的帖子的语言、论坛的id、关联关系的创建日期、帖子的id、帖子的长度和论坛的标题",
        "output": "match (n1:forum)-[r1:containerOf]->(n2:post)  where n1.title='Album 1 of Hossein Forouhar' return n2.language, n1.id, r1.creationdate, n2.id, n2.length, n1.title"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 1 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 1 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 31 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 1 of Hossein Forouhar包含的帖子的长度、论坛标题、帖子语言、图片文件、内容、论坛id、帖子id和创建日期",
        "output": "match (n1:forum)-[r1:containerOf]->(n2:post)  where n1.title='Album 1 of Hossein Forouhar' return n2.length, n1.title, n2.language, n2.imagefile, n2.content, n1.id, n2.id, n2.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 1 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 1 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 1 of Mohammad Ali Hosseini'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 1 of Hossein Forouhar包含的帖子的创建日期、论坛标题、帖子的IP地址、内容、语言、长度、关联关系的创建日期、帖子的ID、论坛的创建日期和帖子使用的浏览器。",
        "output": "match (n1:forum)-[r1:containerOf]->(n2:post)  where n1.title='Album 1 of Hossein Forouhar' return n2.creationdate, n1.title, n2.locationip, n2.content, n2.language, n2.length, r1.creationdate, n2.id, n1.creationdate, n2.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 1 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 1 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 17 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 1 of Hossein Forouhar及其包含的帖子的创建日期、帖子长度和关系的创建日期，限制返回7条结果",
        "output": "match (n1:forum)-[r1:containerOf]->(n2:post)  where n1.title='Album 1 of Hossein Forouhar' return n1.creationdate, n2.length, r1.creationdate limit 7"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 1 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 29 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 1 of Hassan Forouhar'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 1 of Hossein Forouhar包含的9个帖子的图片文件、关联关系的创建日期、帖子的语言、帖子的id、使用的浏览器、论坛的创建日期、帖子的位置IP和论坛的id",
        "output": "match (n1:forum)-[r1:containerOf]->(n2:post)  where n1.title='Album 1 of Hossein Forouhar' return n2.imagefile, r1.creationdate, n2.language, n2.id, n2.browserused, n1.creationdate, n2.locationip, n1.id limit 9"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 1 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 1 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 31 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 1 of Hossein Forouhar包含的帖子的创建日期、语言、长度、论坛的id、帖子的图片文件和帖子的创建日期",
        "output": "match (n1:forum)-[r1:containerOf]->(n2:post)  where n1.title='Album 1 of Hossein Forouhar' return r1.creationdate, n2.language, n2.length, n1.id, n2.imagefile, n2.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 1 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 1 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 31 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Fatehgarh_Sahib'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Islamic_Courts_Union'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 1 of Hossein Forouhar包含的帖子的IP地址、长度以及关系的创建日期",
        "output": "match (n1:forum)-[r1:containerOf]->(n2:post)  where n1.title='Album 1 of Hossein Forouhar' return n2.locationip, n2.length, r1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 5 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 1 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 5 of Hassan Forouhar'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Jiaganj_Azimganj'的节点\nlabel为place,属性name='Fatehgarh_Sahib'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='The_Help_Album'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 1 of Hossein Forouhar的创建日期及其包含的帖子的id，并返回前5个结果，同时返回该论坛的id",
        "output": "match (n1:forum)-[r1:containerOf]->(n2:post)  where n1.title='Album 1 of Hossein Forouhar' return n1.creationdate, n2.id, n1.id limit 5"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 1 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 1 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 31 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 1 of Hossein Forouhar包含的帖子的图片文件、id、位置IP、内容、论坛标题、论坛创建日期、帖子长度和帖子创建日期",
        "output": "match (n1:forum)-[r1:containerOf]->(n2:post)  where n1.title='Album 1 of Hossein Forouhar' return n2.imagefile, n2.id, n2.locationip, n2.content, n1.title, n1.creationdate, n2.length, n2.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 1 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 1 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 0 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 1 of Hossein Forouhar包含的帖子的浏览器使用情况、内容、语言，并返回该论坛的标题",
        "output": "match (n1:forum)-[r1:containerOf]->(n2:post)  where n1.title='Album 1 of Hossein Forouhar' return n2.browserused, n2.content, n2.language, n1.title"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 1 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 31 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 0 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 1 of Hossein Forouhar包含的帖子的关联关系创建日期和帖子创建日期",
        "output": "match (n1:forum)-[r1:containerOf]->(n2:post)  where n1.title='Album 1 of Hossein Forouhar' return r1.creationdate, n2.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 1 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 1 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 31 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Long_Play_Album'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Long_Tall_Sally'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 1 of Hossein Forouhar包含的帖子的长度",
        "output": "match (n1:forum)-[r1:containerOf]->(n2:post)  where n1.title='Album 1 of Hossein Forouhar' return n2.length"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 1 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 11 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 1 of Hassan Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 1 of Hossein Forouhar包含的帖子的长度、论坛标题、关系创建日期和帖子的图片文件，限制返回10条结果",
        "output": "match (n1:forum)-[r1:containerOf]->(n2:post)  where n1.title='Album 1 of Hossein Forouhar' return n2.length, n1.title, r1.creationdate, n2.imagefile limit 10"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 1 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 1 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 1 of Mohammad Ali Hosseini'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 1 of Hossein Forouhar包含的帖子的创建日期、使用的浏览器、帖子id、关系创建日期、帖子长度、IP地址、语言和内容",
        "output": "match (n1:forum)-[r1:containerOf]->(n2:post)  where n1.title='Album 1 of Hossein Forouhar' return n1.creationdate, n2.browserused, n2.id, r1.creationdate, n2.length, n2.locationip, n2.language, n2.content"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 1 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 31 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 1 of Hassan Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为person,属性firstname='Mamoon Eshaq 0'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Rock_Against_Bush,_Vol._1'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 1 of Hossein Forouhar包含的帖子的创建日期",
        "output": "match (n1:forum)-[r1:containerOf]->(n2:post)  where n1.title='Album 1 of Hossein Forouhar' return n2.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 1 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 1 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 1 of Mohammad Ali Hosseini'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 1 of Hossein Forouhar的帖子的详细信息，包括论坛的id、帖子的内容长度、关联关系的创建日期、帖子使用的浏览器、帖子的创建日期、帖子的内容、论坛的标题、帖子的图片文件、帖子的位置IP以及论坛的创建日期",
        "output": "match (n1:forum)-[r1:containerOf]->(n2:post)  where n1.title='Album 1 of Hossein Forouhar' return n1.id, n2.length, r1.creationdate, n2.browserused, n2.creationdate, n2.content, n1.title, n2.imagefile, n2.locationip, n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 1 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 1 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 1 of Mohammad Ali Hosseini'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Sindh_Madrasatul_Islam'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 1 of Hossein Forouhar包含的帖子的长度、图片文件、id、内容，以及论坛的id和标题",
        "output": "match (n1:forum)-[r1:containerOf]->(n2:post)  where n1.title='Album 1 of Hossein Forouhar' return n2.length, n2.imagefile, n2.id, n2.content, n1.id, n1.title"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 2 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 1 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 2 of Hassan Forouhar'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Fatehgarh_Sahib'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 2 of Hossein Forouhar包含的帖子的内容、图片文件、长度、创建日期、位置IP，以及论坛和帖子的id和创建日期",
        "output": "match (n1:forum)-[r1:containerOf]->(n2:post)  where n1.title='Album 2 of Hossein Forouhar' return r1.creationdate, n2.content, n2.imagefile, n1.id, n2.length, n2.creationdate, n2.id, n2.locationip, n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 2 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 15 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 2 of Hassan Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 2 of Hossein Forouhar及其包含的帖子的信息，包括论坛的标题、创建日期、帖子的语言、长度、论坛的id、帖子的创建日期、图片文件、内容、位置IP、帖子的id、使用的浏览器以及关系的创建日期，限制返回15条结果",
        "output": "match (n1:forum)-[r1:containerOf]->(n2:post)  where n1.title='Album 2 of Hossein Forouhar' return n1.title, n1.creationdate, n2.language, n2.length, n1.id, n2.creationdate, n2.imagefile, n2.content, n2.locationip, n2.id, n2.browserused, r1.creationdate limit 15"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 2 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 2 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 22 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 2 of Hossein Forouhar包含的帖子的语言、图片文件、长度、使用的浏览器和帖子的id",
        "output": "match (n1:forum)-[r1:containerOf]->(n2:post)  where n1.title='Album 2 of Hossein Forouhar' return n2.language, n2.imagefile, n2.length, n2.browserused, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 2 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 32 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 22 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Rock_Against_Bush,_Vol._2'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 2 of Hossein Forouhar包含的帖子的创建日期",
        "output": "match (n1:forum)-[r1:containerOf]->(n2:post)  where n1.title='Album 2 of Hossein Forouhar' return n2.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 22 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 32 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 12 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='The_Help_Album'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 2 of Hossein Forouhar的创建日期及其包含的帖子的创建日期，限制返回12条结果",
        "output": "match (n1:forum)-[r1:containerOf]->(n2:post)  where n1.title='Album 2 of Hossein Forouhar' return n1.creationdate, r1.creationdate limit 12"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 2 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 3 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 13 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='New_Muslim_Town'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 2 of Hossein Forouhar包含的帖子，跳过前3个，返回接下来12个帖子的论坛id、帖子的语言、论坛标题、帖子长度、帖子id、帖子内容和帖子创建日期",
        "output": "match (n1:forum)-[r1:containerOf]->(n2:post)  where n1.title='Album 2 of Hossein Forouhar' return n1.id, n2.language, n1.title, n2.length, n2.id, n2.content, n2.creationdate skip 3 limit 12"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 2 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 2 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 1 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 2 of Hossein Forouhar包含的帖子的创建日期、长度、语言、关联关系的创建日期、帖子的id、位置IP、论坛的创建日期、论坛的id、帖子的图片文件、论坛的标题、帖子使用的浏览器和内容",
        "output": "match (n1:forum)-[r1:containerOf]->(n2:post)  where n1.title='Album 2 of Hossein Forouhar' return n2.creationdate, n2.length, n2.language, r1.creationdate, n2.id, n2.locationip, n1.creationdate, n1.id, n2.imagefile, n1.title, n2.browserused, n2.content"
    }
]