[
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Allen_University'的节点\nlabel为organisation,属性name='Amsterdam_University_College'的节点\nlabel为organisation,属性name='Jorge_Amado_University_Center'的节点\nlabel为place,属性name='Anantapur_district'的节点\nlabel为tag,属性name='Adrian_Edmondson'的节点\nlabel为tag,属性name='Alan_Ladd'的节点\nlabel为tag,属性name='Alan_Alda'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由名为Alexander的人创建的评论的详细信息，包括评论的id、创建日期、位置IP、浏览器使用情况、内容，以及该人的id、创建日期、位置IP、生日、电子邮件、姓氏、性别、浏览器使用情况和语言，仅返回一条记录。",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Alexander' return n2.id, n2.creationdate, n2.locationip, n1.id, n2.birthday, n2.email, n1.browserused, n1.creationdate, n1.locationip, r1.creationdate, n1.content, n2.lastname, n2.gender, n2.browserused, n2.language limit 1"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='El_Asher_University'的节点\nlabel为organisation,属性name='Alrosa_Mirny_Air_Enterprise'的节点\nlabel为organisation,属性name='Perimeter_Aviation'的节点\nlabel为tag,属性name='Alex_Shelley'的节点\nlabel为tag,属性name='Adil_Shahi_dynasty'的节点\nlabel为tag,属性name='Hyder_Ali'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Ashley的人创建的评论的创建日期和长度",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Ashley' return r1.creationdate, n1.length"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Rebel_Meets_Rebel'的节点\nlabel为tag,属性name='Sete_Gibernau'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Bechir创建的评论的浏览器使用情况、长度、评论的id、创建者的姓氏和评论的IP地址",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Bechir' return n1.browserused, n1.length, n2.language, n1.id, n2.lastname, n1.locationip"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Hector_Berlioz'的节点\nlabel为tag,属性name='Gerhard_Berger'的节点\nlabel为tag,属性name='Geezer_Butler'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Bechir创建的评论的详细信息，包括评论者的id、语言、评论的IP地址、评论者的姓名、性别、评论的创建日期、使用的浏览器、评论者的创建日期、生日、姓氏、邮箱和评论的长度。",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Bechir' return n2.id, n2.language, n1.locationip, n2.firstname, n2.gender, n1.creationdate, n1.browserused, n2.creationdate, n2.birthday, n2.lastname, n2.email, n1.length"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Martin_College'的节点\nlabel为organisation,属性name='Martin_College'的节点\nlabel为organisation,属性name='McMaster_Arts_and_Science'的节点\nlabel为tag,属性name='Michael_McKean'的节点\nlabel为tag,属性name='Mark_McGwire'的节点\nlabel为tag,属性name='Michael_Kamen'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Michael创建的评论内容",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Michael' return n1.content"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Michael_Madhusudan_Memorial_College'的节点\nlabel为organisation,属性name='Martin_College'的节点\nlabel为organisation,属性name='Martin_College'的节点\nlabel为tag,属性name='Michael_McKean'的节点\nlabel为tag,属性name='Michael_Kamen'的节点\nlabel为tag,属性name='Mark_Martin'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Michael创建的评论内容、位置IP、评论ID、评论长度、Michael的位置IP、生日、邮箱、创建日期、浏览器使用情况、Michael的ID、名字、姓氏以及关系的创建日期，限制返回13条记录",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Michael' return n1.content, n2.locationip, n2.id, n1.locationip, n2.birthday, n1.length, n2.email, n2.creationdate, r1.creationdate, n2.firstname, n2.lastname, n2.browserused, n1.id limit 13"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Michael_Kamen'的节点\nlabel为tag,属性name='Chrome,_Smoke_&_BBQ'的节点\nlabel为tag,属性name='Strawberry_Letter_23'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Michael创建的评论所使用的浏览器，并返回前7条结果，包括评论者和评论使用的浏览器信息",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Michael' return n1.browserused, n2.browserused limit 7"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='GainJet_Aviation'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Jun创建的评论内容",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Jun' return n1.content"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Jackson_Junior_High_School'的节点\nlabel为organisation,属性name='Nihon_University_Junior_College'的节点\nlabel为tag,属性name='John_Bunyan'的节点\nlabel为tag,属性name='Jennifer_Jason_Leigh'的节点\nlabel为tag,属性name='Jennifer_Juniper'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由名为Jun的人创建的评论，返回评论的长度、内容、id、浏览器使用情况、位置IP，以及该人的性别、浏览器使用情况、电子邮件、生日、姓氏、id和位置IP，跳过前10条记录，限制返回2条记录。",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Jun' return n1.length, n2.gender, n1.id, n2.browserused, n2.email, n2.birthday, n1.content, n1.locationip, n1.browserused, n2.lastname, n2.id, n2.locationip skip 10 limit 2"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Maulana_Azad_College'的节点\nlabel为organisation,属性name='Deen_Dayal_Upadhyaya_College'的节点\nlabel为organisation,属性name='Daeduk_College'的节点\nlabel为tag,属性name='Alan_Ladd'的节点\nlabel为tag,属性name='Alan_Alda'的节点\nlabel为tag,属性name='Arif_Mardin'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由名为Aad De的人创建的评论的长度、评论的IP地址、创建者的ID、性别和生日，以及创建者的邮箱",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Aad De' return n2.id, n2.gender, n1.length, n2.birthday, n1.locationip, n2.email"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Perimeter_Aviation'的节点\nlabel为tag,属性name='Go_the_Distance'的节点\nlabel为tag,属性name='Long_Tall_Sally'的节点\nlabel为tag,属性name='Long_Distance_Runaround'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Aad De创建的评论的长度",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Aad De' return n1.length"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Gachongil_College'的节点\nlabel为organisation,属性name='Baiko_Gakuin_University'的节点\nlabel为organisation,属性name='Gogte_Institute_of_Technology'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Sete_Gibernau'的节点\nlabel为tag,属性name='Swagga_Like_Us'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Gheorghe创建的评论的浏览器使用情况、长度、内容、id、创建日期、位置IP，以及Gheorghe的浏览器使用情况、姓氏、电子邮件、id、创建日期和语言",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Gheorghe' return n1.browserused, n1.length, n2.browserused, n2.firstname, n2.lastname, n2.email, n1.id, r1.creationdate, n2.creationdate, n2.language, n1.creationdate, n1.locationip, n2.id, n1.content"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Gachon_University_of_Medicine_and_Science'的节点\nlabel为organisation,属性name='Gaston_Berger_University'的节点\nlabel为organisation,属性name='Gachongil_College'的节点\nlabel为tag,属性name='Sete_Gibernau'的节点\nlabel为tag,属性name='Live_at_the_Gorge_05/06'的节点\nlabel为tag,属性name='John_Gay'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Gheorghe创建的评论，返回Gheorghe的名、姓、评论的IP地址、Gheorghe的ID、评论使用的浏览器、评论内容、评论ID、关系创建日期、Gheorghe的创建日期、Gheorghe的语言、Gheorghe的IP地址和Gheorghe的邮箱，限制返回16条结果。",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Gheorghe' return n2.firstname, n2.lastname, n1.locationip, n2.id, n1.browserused, n1.content, n1.id, r1.creationdate, n2.creationdate, n2.language, n2.locationip, n2.email limit 16"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Gachongil_College'的节点\nlabel为organisation,属性name='Hogeschool_Gent'的节点\nlabel为organisation,属性name='Aéreo_Servicio_Guerrero'的节点\nlabel为place,属性name='Jagüey_Grande'的节点\nlabel为tag,属性name='Gary_Gygax'的节点\nlabel为tag,属性name='Eddie_Guerrero'的节点\nlabel为tag,属性name='Germaine_Greer'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Gheorghe创建的评论的创建者的名字",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Gheorghe' return n2.firstname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Greer_Garson'的节点\nlabel为tag,属性name='Richard_Gere'的节点\nlabel为tag,属性name='Geezer_Butler'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Gheorghe创建的评论的信息，包括评论者的电子邮件、创建日期、评论内容、性别、生日、评论者ID、评论长度、评论创建日期、评论者使用的浏览器以及评论ID。",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Gheorghe' return n2.email, n2.creationdate, n1.content, n2.gender, n2.birthday, n2.id, n1.length, n1.creationdate, n2.browserused, n1.id, n1.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Chris_Sabin'的节点\nlabel为tag,属性name='Jamie_Lee_Curtis'的节点\nlabel为tag,属性name='Cryptic_Writings'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Chris创建的评论的详细信息，包括评论的语言、长度、位置IP、浏览器使用情况、内容，以及Chris的位置IP、电子邮件、浏览器使用情况、创建日期，还有评论和人的创建日期",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Chris' return n2.language, n1.length, n2.locationip, n2.email, n1.locationip, n2.browserused, n2.firstname, r1.creationdate, n2.creationdate, n1.creationdate, n1.browserused, n1.content"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Patricia_Stevens_College'的节点\nlabel为tag,属性name='Sarah_Jessica_Parker'的节点\nlabel为tag,属性name='Strawberry_Letter_23'的节点\nlabel为tag,属性name='Tatiana_Poutchek'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由名为Patricia的人创建的评论内容、他们的姓氏、评论的创建日期、使用的浏览器、评论的id和他们的语言，限制返回7条结果",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Patricia' return n1.content, n2.lastname, n1.creationdate, n2.browserused, n1.id, n2.language limit 7"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Patricia_Stevens_College'的节点\nlabel为organisation,属性name='Patrician_College'的节点\nlabel为organisation,属性name='Patrician_College'的节点\nlabel为tag,属性name='Sarah_Jessica_Parker'的节点\nlabel为tag,属性name='Tatiana_Poutchek'的节点\nlabel为tag,属性name='John_J._Pershing'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由名为Patricia的人创建的评论的详细信息，包括评论者的生日、评论长度、内容、评论者的创建日期、位置IP、评论ID、评论者的名字、邮箱、浏览器使用情况、关系的创建日期、评论的位置IP、评论者的性别、评论者的ID、评论者的浏览器使用情况和语言。",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Patricia' return n2.birthday, n1.length, n1.content, n2.creationdate, n2.locationip, n1.id, n2.firstname, n2.email, n1.browserused, r1.creationdate, n1.locationip, n2.gender, n2.id, n2.browserused, n2.language"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Patricia_Stevens_College'的节点\nlabel为organisation,属性name='Patrician_College'的节点\nlabel为organisation,属性name='Patrician_College'的节点\nlabel为tag,属性name='John_Paul_Stevens'的节点\nlabel为tag,属性name='John_J._Pershing'的节点\nlabel为tag,属性name='Sarah_Jessica_Parker'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由名为Patricia的人创建的评论的id、长度、浏览器使用情况、IP位置以及评论的创建日期，同时返回Patricia的邮箱、浏览器使用情况、创建日期、语言和生日信息。",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Patricia' return n1.id, n2.email, n2.browserused, n1.browserused, n1.length, n2.id, n2.creationdate, n2.language, n1.locationip, r1.creationdate, n2.birthday"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='A_Tribute_to_Jack_Johnson'的节点\nlabel为tag,属性name='John_Knox'的节点\nlabel为tag,属性name='Jennifer_Jason_Leigh'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由John创建的评论的详细信息，包括评论者的IP地址、性别、评论的IP地址、评论者的语言、评论的创建日期、评论内容、评论者使用的浏览器以及评论者的姓名和创建日期。",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='John' return n2.locationip, n2.gender, n1.locationip, n2.language, r1.creationdate, n1.content, n2.browserused, n2.firstname, n2.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 4 of Emperor of Brazil Dom Pedro II'的节点\nlabel为forum,属性title='Album 4 of Emperor of Brazil Machado'的节点\nlabel为forum,属性title='Album 4 of Emperor of Brazil Souza'的节点\nlabel为organisation,属性name='Sergio_Arboleda_University'的节点\nlabel为organisation,属性name='Brazilian_Naval_School'的节点\nlabel为organisation,属性name='Pablo_de_Olavide_University'的节点\nlabel为place,属性name='Pedro_Escobedo'的节点\nlabel为place,属性name='Antón_Lizardo'的节点\nlabel为place,属性name='San_Pedro_Garza_García'的节点\nlabel为tag,属性name='Pedro_I_of_Brazil'的节点\nlabel为tag,属性name='John_VI_of_Portugal'的节点\nlabel为tag,属性name='Philip_IV_of_Spain'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Emperor of Brazil创建的评论的IP地址、内容和长度，以及创建者的姓氏、性别和电子邮件，跳过前3条记录，返回接下来的4条记录",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Emperor of Brazil' return n2.firstname, n1.locationip, n2.lastname, n2.gender, n2.email, n1.content, n1.length skip 3 limit 4"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Sagar_Dutta_Memorial_Medical_College_and_Hospital'的节点\nlabel为tag,属性name='Satavahana_dynasty'的节点\nlabel为tag,属性name='Swagga_Like_Us'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Shweta创建的评论的内容、浏览器使用情况、创建日期、位置IP、长度以及Shweta的语言、ID、生日、电子邮件、姓氏、创建日期、位置IP、性别和名字，同时返回关系的创建日期。",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Shweta' return n2.language, n1.content, n2.id, n1.browserused, n2.birthday, n2.email, n2.lastname, n2.creationdate, n1.creationdate, n2.locationip, n1.id, n1.locationip, n2.gender, n2.firstname, r1.creationdate, n2.browserused, n1.length"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Mahmud_of_Ghazni in Raniganj'的节点\nlabel为forum,属性title='Group for Jawaharlal_Nehru in Rahim_Yar_Khan'的节点\nlabel为organisation,属性name='Shahid_Rajaee_University'的节点\nlabel为organisation,属性name='Tehran_Psychiatric_Institute'的节点\nlabel为organisation,属性name='Mahishadal_Raj_College'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为place,属性name='Lashkar_Gah'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为tag,属性name='Rahsaan_Roland_Kirk'的节点\nlabel为tag,属性name='Paresh_Rawal'的节点\nlabel为tag,属性name='Rashidun_Caliphate'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Rahul的人创建的评论的详细信息，包括Rahul的生日、评论的位置IP、Rahul的ID、Rahul的创建日期、评论的创建日期、关系的创建日期、Rahul的姓氏、性别、评论使用的浏览器、Rahul的位置IP、Rahul的语言和名字。",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Rahul' return n2.birthday, n1.locationip, n2.id, n2.creationdate, n1.creationdate, r1.creationdate, n2.lastname, n2.gender, n1.browserused, n2.locationip, n2.language, n2.firstname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Al-Ahliyya_Amman_University'的节点\nlabel为organisation,属性name='Mohammad_Ali_Jinnah_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\nlabel为tag,属性name='Hyder_Ali'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Ali的人创建的评论的IP地址、内容、长度、ID、浏览器使用情况以及评论的创建日期，同时返回该人的姓氏、ID、性别、名字、语言、IP地址、浏览器使用情况和创建日期。",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Ali' return n1.locationip, n2.lastname, n1.content, n1.length, n2.id, n2.gender, n2.firstname, n2.language, n1.id, n2.locationip, n2.browserused, n1.browserused, r1.creationdate, n2.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Al_Akhawayn_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Mohammad_Ali_Jinnah_University'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\nlabel为tag,属性name='Hyder_Ali'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由名为Ali的人创建的评论的创建日期、内容、id、使用的浏览器、位置IP，以及该人的创建日期、id、语言、位置IP、姓氏、名字和生日，限制返回16条记录。",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Ali' return n1.creationdate, n2.creationdate, n1.content, n2.id, n2.language, n1.id, n2.locationip, n2.lastname, n2.firstname, n1.browserused, n2.birthday limit 16"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Kevin_Costner'的节点\nlabel为tag,属性name='John_Curtin'的节点\nlabel为tag,属性name='Chris_Claremont'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由名为Constantin的人创建的评论，返回该人的姓氏、id、使用的浏览器、评论内容、位置IP、名、评论的创建日期、该人的生日以及评论的长度，跳过前10条记录，限制返回8条记录。",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Constantin' return n2.lastname, n2.id, n2.browserused, n1.content, n2.locationip, n2.firstname, n1.creationdate, n2.birthday, n1.length skip 10 limit 8"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Stenden_Rangsit_University'的节点\nlabel为organisation,属性name='Paul_Cézanne_University'的节点\nlabel为organisation,属性name='Kinnaird_College'的节点\nlabel为tag,属性name='John_Curtin'的节点\nlabel为tag,属性name='Gene_Vincent'的节点\nlabel为tag,属性name='Kevin_Costner'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Constantin的人创建的评论的详细信息，包括他的姓氏、评论的IP地址、他的语言、名字、评论长度、他的ID、电子邮件、生日、评论ID和浏览器使用情况",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Constantin' return n2.lastname, n1.locationip, n2.language, n2.firstname, n1.length, n2.id, n2.email, n2.birthday, n1.id, n2.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Gene_Vincent'的节点\nlabel为tag,属性name='Cristina_Fernández_de_Kirchner'的节点\nlabel为tag,属性name='Ken_Schrader'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Constantin创建的评论所使用的浏览器、评论的id、创建者的语言、姓氏和生日",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Constantin' return n1.browserused, n1.id, n2.language, n2.lastname, n2.birthday"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Sagar_Dutta_Memorial_Medical_College_and_Hospital'的节点\nlabel为organisation,属性name='Jorge_A._Sabato_institute'的节点\nlabel为organisation,属性name='Siddhartha_University'的节点\nlabel为tag,属性name='Satavahana_dynasty'的节点\nlabel为tag,属性name='Swagga_Like_Us'的节点\nlabel为tag,属性name='Jesse_Ventura'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Shweta的人创建的评论的详细信息，包括人的id、创建日期、位置IP、生日，评论的id、长度、位置IP、创建日期、浏览器使用情况，以及关系的创建日期和人的名字。",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Shweta' return n2.id, n2.creationdate, n2.locationip, n2.birthday, n1.id, n1.length, n1.locationip, n1.creationdate, n1.browserused, n2.email, r1.creationdate, n2.firstname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Rafael_Nadal in Visonta'的节点\nlabel为organisation,属性name='Škoda_Auto_University'的节点\nlabel为organisation,属性name='Jamia_Siddiqia'的节点\nlabel为organisation,属性name='Jamia_Hamdard'的节点\nlabel为tag,属性name='Swagga_Like_Us'的节点\nlabel为tag,属性name='Satavahana_dynasty'的节点\nlabel为tag,属性name='Dudi_Sela'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Shweta的人创建的评论的id、内容、创建日期以及该人的语言和使用的浏览器",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Shweta' return n2.language, n1.id, n2.firstname, n1.content, r1.creationdate, n2.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Martin_College'的节点\nlabel为organisation,属性name='Martin_College'的节点\nlabel为organisation,属性name='McMaster_Faculty_of_Engineering'的节点\nlabel为tag,属性name='Michael_McKean'的节点\nlabel为tag,属性name='Michael_Kamen'的节点\nlabel为tag,属性name='Michael_Madsen'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Michael创建的评论的信息，包括评论使用的浏览器、内容、长度、创建日期，以及Michael的电子邮件、生日、语言、创建日期、姓氏、名字和使用的浏览器。同时返回评论和Michael的id，以及关系的创建日期。",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Michael' return n1.browserused, n2.email, n2.birthday, n1.content, n2.id, n1.id, n1.creationdate, n2.language, n1.length, r1.creationdate, n2.creationdate, n2.lastname, n2.browserused, n2.firstname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Sergio_Arboleda_University'的节点\nlabel为organisation,属性name='Adolfo_Ibáñez_University'的节点\nlabel为organisation,属性name='Jorge_Amado_University_Center'的节点\nlabel为place,属性name='Antón_Lizardo'的节点\nlabel为tag,属性name='Iparhi_Agapi_Edo'的节点\nlabel为tag,属性name='Dario_Argento'的节点\nlabel为tag,属性name='Fernando_Alonso'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Alfonso的人创建的评论的id、位置IP，以及该人的性别、语言、姓氏、电子邮件和位置IP",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Alfonso' return n2.gender, n1.id, n1.locationip, n2.language, n2.lastname, n2.email, n2.locationip, n2.firstname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Sergio_Arboleda_University'的节点\nlabel为organisation,属性name='Adolfo_Ibáñez_University'的节点\nlabel为organisation,属性name='Pablo_de_Olavide_University'的节点\nlabel为tag,属性name='Edward_James_Olmos'的节点\nlabel为tag,属性name='Iparhi_Agapi_Edo'的节点\nlabel为tag,属性name='Fernando_Alonso'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Alfonso的人创建的评论的IP地址、浏览器信息和评论长度，最多返回6条记录",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Alfonso' return n2.locationip, n2.browserused, n1.length limit 6"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Sergio_Arboleda_University'的节点\nlabel为organisation,属性name='Andres_Soriano_College'的节点\nlabel为tag,属性name='Dario_Argento'的节点\nlabel为tag,属性name='Fernando_Alonso'的节点\nlabel为tag,属性name='Kofi_Annan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Alfonso创建的评论的id、使用的浏览器、创建日期、评论长度、IP地址、内容以及评论的创建日期，同时返回创建者的姓氏、电子邮件、创建日期、使用的浏览器和语言",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Alfonso' return n1.id, n1.browserused, n1.creationdate, n2.lastname, n2.email, n2.creationdate, n1.length, n1.locationip, n1.content, r1.creationdate, n2.browserused, n2.language"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Sergio_Arboleda_University'的节点\nlabel为organisation,属性name='Jorge_Amado_University_Center'的节点\nlabel为organisation,属性name='Andres_Soriano_College'的节点\nlabel为tag,属性name='Fernando_Alonso'的节点\nlabel为tag,属性name='Dario_Argento'的节点\nlabel为tag,属性name='Kofi_Annan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Alfonso的人创建的评论内容，返回该人的姓氏、生日、邮箱、语言、IP地址、评论内容、评论创建日期、评论ID、性别、名和ID",
        "output": "match (n1:comment)-[r1:hascreatorcomment]->(n2:person)  where n2.firstname='Alfonso' return n2.lastname, n2.birthday, n2.email, n2.language, n2.locationip, n1.content, r1.creationdate, n1.id, n2.gender, n2.firstname, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Link_Air_Express'的节点\nlabel为organisation,属性name='Miriam_College'的节点\nlabel为organisation,属性name='Safarilink_Aviation'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Price_Tag'的节点\nlabel为tag,属性name='Strawberry_Letter_23'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找包含标签Mary_I_of_England的评论的浏览器使用情况、创建日期、标签名称、标签id、评论长度、标签URL、评论id和评论的IP地址",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='Mary_I_of_England' return n1.browserused, n1.creationdate, n2.name, n2.id, n1.length, n2.url, n1.id, n1.locationip"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Queen_Elizabeth_The_Queen_Mother'的节点\nlabel为tag,属性name='Strawberry_Letter_23'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与Queen Elizabeth The Queen Mother标签相关的评论的id、长度、使用的浏览器、关系的创建日期、评论内容、标签名称、评论的创建日期、评论的位置IP和标签的URL，限制返回5条结果。",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='Queen_Elizabeth_The_Queen_Mother' return n2.id, n1.id, n1.length, n1.browserused, r1.creationdate, n1.content, n2.name, n1.creationdate, n1.locationip, n2.url limit 5"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Ohio_Valley_University'的节点\nlabel为organisation,属性name='Park_Lane_College_Leeds'的节点\nlabel为organisation,属性name='John_Wheatley_College'的节点\nlabel为tag,属性name='Boggy_Depot'的节点\nlabel为tag,属性name='Wooly_Bully'的节点\nlabel为tag,属性name='Jerry_Lee_Lewis'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与标签Wooly_Bully相关的评论的id、位置IP、长度、关系的创建日期、标签的id和评论内容，跳过前2条结果，返回接下来的5条结果",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='Wooly_Bully' return n1.id, n1.locationip, n1.length, r1.creationdate, n2.id, n1.content skip 2 limit 5"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='No_Reply_at_All'的节点\nlabel为tag,属性name='Price_Tag'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与标签Disco_Inferno相关的评论的浏览器使用情况、标签URL、评论ID、评论内容、关系创建日期、标签ID和评论的IP地址，仅返回一条结果。",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='Disco_Inferno' return n1.browserused, n2.url, n1.id, n1.content, r1.creationdate, n2.id, n1.locationip limit 1"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Kazan_Federal_University'的节点\nlabel为organisation,属性name='Bahauddin_Zakariya_University'的节点\nlabel为organisation,属性name='Škoda_Auto_University'的节点\nlabel为tag,属性name='Zakk_Wylde'的节点\nlabel为tag,属性name='Richard_Widmark'的节点\nlabel为tag,属性name='My_Kinda_Party'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与标签Franz_Kafka相关的评论的id，以及该标签的id，最多返回11条记录",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='Franz_Kafka' return n1.id, n2.id limit 11"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Price_Tag'的节点\nlabel为tag,属性name='Erwin_Rommel'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找包含标签Erwin_Rommel的评论的浏览器使用情况、IP地址、长度、id、内容、创建日期，以及该标签的名称、关系的创建日期和标签的id",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='Erwin_Rommel' return n1.browserused, n1.locationip, n1.length, n1.id, n1.content, n1.creationdate, n2.name, r1.creationdate, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Gaston_Berger_University'的节点\nlabel为organisation,属性name='Gordon_Institute_of_Business_Science'的节点\nlabel为organisation,属性name='Gogte_Institute_of_Technology'的节点\nlabel为tag,属性name='George_Hamilton-Gordon,_4th_Earl_of_Aberdeen'的节点\nlabel为tag,属性name='Charles_George_Gordon'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与George IV of the United Kingdom相关的评论所使用的浏览器，并返回标签的id、名称以及评论所使用的浏览器，按标签名称排序。",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='George_IV_of_the_United_Kingdom' return n2.id, n2.name, n1.browserused order by n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Garcia_College_of_Technology'的节点\nlabel为organisation,属性name='Jamia_Nazmia'的节点\nlabel为organisation,属性name='Azal_Avia_Cargo'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Vasco_da_Gama'的节点\nlabel为tag,属性name='Searching_for_Jerry_Garcia'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Jamaica的标签，并返回该标签的名称",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='Jamaica' return n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Georgetown_Public_Policy_Institute'的节点\nlabel为organisation,属性name='Gaston_Berger_University'的节点\nlabel为organisation,属性name='Global_Urban_Research_Unit'的节点\nlabel为tag,属性name='George_IV_of_the_United_Kingdom'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='John_Eliot_Gardiner'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找包含标签George_IV_of_the_United_Kingdom的评论的id、位置IP、长度以及该标签的URL和id，同时返回评论使用的浏览器。",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='George_IV_of_the_United_Kingdom' return n1.id, n1.locationip, n1.length, n2.url, n2.id, n1.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Star_Media_Institute'的节点\nlabel为organisation,属性name='Kal_Star_Aviation'的节点\nlabel为organisation,属性name='City_Star_Airlines'的节点\nlabel为tag,属性name='The_Rise_and_Fall_of_Ziggy_Stardust_and_the_Spiders_from_Mars'的节点\nlabel为tag,属性name='Strawberry_Letter_23'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与标签The_Rise_and_Fall_of_Ziggy_Stardust_and_the_Spiders_from_Mars相关的评论的浏览器使用情况、IP地址、长度、内容、关系创建日期、标签名称和评论ID，最多返回7条结果",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='The_Rise_and_Fall_of_Ziggy_Stardust_and_the_Spiders_from_Mars' return n1.browserused, n1.locationip, n1.length, n1.content, r1.creationdate, n2.name, n1.id limit 7"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Kazan_Federal_University'的节点\nlabel为tag,属性name='Franz_Kafka'的节点\nlabel为tag,属性name='Price_Tag'的节点\nlabel为tag,属性name='Aga_Khan_IV'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与标签Franz_Kafka相关的评论的id、IP地址、创建日期、内容、标签URL、标签名称、关系创建日期、评论长度和浏览器使用情况，并按标签名称降序排列，限制结果为18条。",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='Franz_Kafka' return n2.id, n1.locationip, n1.creationdate, n1.content, n2.url, n2.name, r1.creationdate, n1.length, n1.browserused order by n2.name desc limit 18"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Maulana_Azad_College'的节点\nlabel为organisation,属性name='Al-Azhar_University'的节点\nlabel为organisation,属性name='Gaston_Berger_University'的节点\nlabel为tag,属性name='Gamal_Abdel_Nasser'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Price_Tag'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与标签Gamal_Abdel_Nasser相关的评论的创建日期、标签URL、评论长度、标签名称、评论id、评论内容和使用的浏览器。",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='Gamal_Abdel_Nasser' return r1.creationdate, n2.url, n1.length, n2.name, n1.id, n1.content, n1.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Erwin_Rommel'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Price_Tag'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找包含Erwin_Rommel标签的评论内容、使用的浏览器、关系的创建日期、评论的id和创建日期，以及标签的id",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='Erwin_Rommel' return n1.content, n1.browserused, r1.creationdate, n1.id, n1.creationdate, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与Göktürks标签相关的评论的长度、创建日期、关联关系的创建日期、使用的浏览器、标签的id以及评论内容，限制返回6条结果",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='Göktürks' return n1.length, n1.creationdate, r1.creationdate, n1.browserused, n2.id, n1.content limit 6"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Shania_Twain'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Mark_Twain'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找包含标签Shania_Twain的评论内容、长度、创建日期、评论id、标签id、标签URL以及关系的创建日期，最多返回7条结果",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='Shania_Twain' return n1.content, n1.length, n1.creationdate, n1.id, n2.id, n2.url, r1.creationdate limit 7"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Love_Is_Only_a_Feeling'的节点\nlabel为tag,属性name='Love_and_Affection'的节点\nlabel为tag,属性name='Love_Sensation'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找标签为Love_Is_Only_a_Feeling的评论的id、创建日期、IP地址，以及该标签的名称、URL和id，同时返回关联关系的创建日期",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='Love_Is_Only_a_Feeling' return n2.name, n2.url, n2.id, n1.locationip, n1.creationdate, n1.id, r1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Daniel_Payne_College'的节点\nlabel为organisation,属性name='PAN_Air'的节点\nlabel为organisation,属性name='Pascan_Aviation'的节点\nlabel为tag,属性name='Price_Tag'的节点\nlabel为tag,属性name='Peter_Pan'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与Peter_Pan标签相关的评论的长度、关系创建日期、评论id、使用的浏览器、标签id、标签URL、标签名称以及评论创建日期，并按标签名称排序",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='Peter_Pan' return n1.length, r1.creationdate, n1.id, n1.browserused, n2.id, n2.url, n2.name, n1.creationdate order by n2.name"
    }
]