[
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为organisation,属性name='Mohammad_Ali_Jinnah_University'的节点\nlabel为organisation,属性name='Aliah_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为tag,属性name='Muhammad_Ali'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\nlabel为tag,属性name='Hyder_Ali'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Ali的个人的创建日期、位置IP、语言、id、生日、名、姓、电子邮件和性别",
        "output": "match (n1:person)  where n1.firstname='Ali' return n1.creationdate, n1.locationip, n1.language, n1.id, n1.birthday, n1.firstname, n1.lastname, n1.email, n1.gender"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为forum,属性title='Group for Alicia_Keys in Jalpaiguri'的节点\nlabel为organisation,属性name='ItAli_Airlines'的节点\nlabel为organisation,属性name='ACSI_College-Iloilo'的节点\nlabel为organisation,属性name='Aliah_University'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为tag,属性name='Hyder_Ali'的节点\nlabel为tag,属性name='Muhammad_Ali'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Ali的人员的语言、性别和id",
        "output": "match (n1:person)  where n1.firstname='Ali' return n1.language, n1.gender, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Paul_Sabatier_University'的节点\nlabel为organisation,属性name='Adama_University'的节点\nlabel为organisation,属性name='Anna_University'的节点\nlabel为person,属性firstname='Albaye Papa'的节点\nlabel为person,属性firstname='Albaye Papa'的节点\nlabel为person,属性firstname='Albaye Papa'的节点\nlabel为tag,属性name='Gene_Autry'的节点\nlabel为tag,属性name='Daddy_Yankee_Mundial'的节点\nlabel为tag,属性name='Jimmy_Page'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Albaye Papa的用户的性别、使用的浏览器、id、名字、生日、IP地址和姓氏，最多返回2条结果",
        "output": "match (n1:person)  where n1.firstname='Albaye Papa' return n1.gender, n1.browserused, n1.id, n1.firstname, n1.birthday, n1.locationip, n1.lastname limit 2"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 19 of Ahsan Iqbal'的节点\nlabel为forum,属性title='Album 19 of Ali Abdeslam'的节点\nlabel为forum,属性title='Album 19 of Amjad Islam Ahsan'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Mohammad_Ali_Jinnah_University'的节点\nlabel为organisation,属性name='Imam_Sadiq_University'的节点\nlabel为person,属性firstname='Abay Ibrahim'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\nlabel为tag,属性name='Muhammad_Iqbal'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名字为Abay Ibrahim的前19个人的姓名、id、创建日期和性别",
        "output": "match (n1:person)  where n1.firstname='Abay Ibrahim' return n1.firstname, n1.id, n1.creationdate, n1.gender limit 19"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Alicia_Keys in Jalpaiguri'的节点\nlabel为forum,属性title='Group for Nawaz_Sharif in Cali'的节点\nlabel为forum,属性title='Group for Julie_Andrews in Shah_Alam'的节点\nlabel为organisation,属性name='Azim_Premji_University'的节点\nlabel为organisation,属性name='Shahid_Madani_University_Of_Azarbaijan'的节点\nlabel为organisation,属性name='José_Rizal_University'的节点\nlabel为person,属性firstname='Chaim Azriel'的节点\nlabel为person,属性firstname='Chaim Azriel'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\nlabel为tag,属性name='Zine_El_Abidine_Ben_Ali'的节点\nlabel为tag,属性name='Ayman_al-Zawahiri'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Chaim Azriel的语言、生日、使用的浏览器、电子邮件和姓氏",
        "output": "match (n1:person)  where n1.firstname='Chaim Azriel' return n1.language, n1.birthday, n1.browserused, n1.email, n1.lastname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Kevin_Rudd in Zhukovsky'的节点\nlabel为forum,属性title='Group for Kevin_Rudd in Zhukovsky'的节点\nlabel为forum,属性title='Group for Kevin_Rudd in Zhukovsky'的节点\nlabel为organisation,属性name='Gheorghe_Zane_University'的节点\nlabel为organisation,属性name='Zaoksky_Adventist_University'的节点\nlabel为organisation,属性name='Qazvin_Islamic_Azad_University'的节点\nlabel为person,属性firstname='Zdenek'的节点\nlabel为person,属性firstname='Zdenek'的节点\nlabel为tag,属性name='Zakk_Wylde'的节点\nlabel为tag,属性name='Zinedine_Zidane'的节点\nlabel为tag,属性name='Glenn_Danzig'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名字为Zdenek的人的id、使用的浏览器和姓氏，最多返回8条结果",
        "output": "match (n1:person)  where n1.firstname='Zdenek' return n1.id, n1.browserused, n1.lastname limit 8"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Jesse_Jackson'的节点\nlabel为tag,属性name='Jesse_Owens'的节点\nlabel为tag,属性name='Jesse_James'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Jose的人员的浏览器使用情况、id、创建日期、姓氏、电子邮件、位置IP、生日、语言和名字",
        "output": "match (n1:person)  where n1.firstname='Jose' return n1.browserused, n1.id, n1.creationdate, n1.lastname, n1.email, n1.locationip, n1.birthday, n1.language, n1.firstname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Paul_Sabatier_University'的节点\nlabel为organisation,属性name='Pavai_College_of_Technology'的节点\nlabel为organisation,属性name='Sardar_Patel_University'的节点\nlabel为tag,属性name='Andrei_Pavel'的节点\nlabel为tag,属性name='Paul_Schrader'的节点\nlabel为tag,属性name='Paul_Verhoeven'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Pavel的人使用的浏览器、语言、生日、名字、创建日期、姓氏和邮箱",
        "output": "match (n1:person)  where n1.firstname='Pavel' return n1.browserused, n1.language, n1.birthday, n1.firstname, n1.creationdate, n1.lastname, n1.email"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Jain_Institute_of_Technology'的节点\nlabel为place,属性name='Pyin_U_Lwin'的节点\nlabel为tag,属性name='Jennifer_Jason_Leigh'的节点\nlabel为tag,属性name='Justine_Henin'的节点\nlabel为tag,属性name='Jennifer_Juniper'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名字为Jun的用户的姓氏、创建日期、电子邮件、位置IP、浏览器信息和用户ID",
        "output": "match (n1:person)  where n1.firstname='Jun' return n1.lastname, n1.creationdate, n1.email, n1.locationip, n1.browserused, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Michael_Kamen'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Cam的用户的浏览器使用情况、姓氏、名字、创建日期、语言、性别、id、电子邮件和位置IP",
        "output": "match (n1:person)  where n1.firstname='Cam' return n1.browserused, n1.lastname, n1.firstname, n1.creationdate, n1.language, n1.gender, n1.id, n1.email, n1.locationip"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Abasyn_University'的节点\nlabel为organisation,属性name='Abasyn_University'的节点\nlabel为organisation,属性name='Ain_Shams_University'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为tag,属性name='Sean_Astin'的节点\nlabel为tag,属性name='Desi_Arnaz'的节点\nlabel为tag,属性name='Aga_Khan_IV'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名字为Ashin的前12个人的IP地址、性别、浏览器、生日、名字、邮箱、语言和ID",
        "output": "match (n1:person)  where n1.firstname='Ashin' return n1.locationip, n1.gender, n1.browserused, n1.birthday, n1.firstname, n1.email, n1.language, n1.id, n1.lastname limit 12"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='José_Rizal_University'的节点\nlabel为organisation,属性name='Paul_Sabatier_University'的节点\nlabel为organisation,属性name='Sardar_Patel_University'的节点\nlabel为tag,属性name='No_Me_Dejes_de_Querer'的节点\nlabel为tag,属性name='Pedro_I_of_Brazil'的节点\nlabel为tag,属性name='Jennifer_Lopez'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Parviz的人的语言、生日、使用的浏览器和性别",
        "output": "match (n1:person)  where n1.firstname='Parviz' return n1.language, n1.birthday, n1.browserused, n1.gender"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Hans_Holbein_the_Younger'的节点\nlabel为tag,属性name='Hal_Holbrook'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名字为Hao的人员的姓氏、电子邮件、id、语言、IP地址、名字、生日和使用的浏览器",
        "output": "match (n1:person)  where n1.firstname='Hao' return n1.lastname, n1.email, n1.id, n1.language, n1.locationip, n1.firstname, n1.birthday, n1.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Bing_Crosby in Belgorod'的节点\nlabel为forum,属性title='Group for Nicole_Kidman in Bijie'的节点\nlabel为organisation,属性name='Ibb_University'的节点\nlabel为organisation,属性name='Bengbu_Medical_College'的节点\nlabel为organisation,属性name='Elim_Bible_Institute'的节点\nlabel为place,属性name='Borey_Seang_Nam'的节点\nlabel为tag,属性name='Bon_Iver,_Bon_Iver'的节点\nlabel为tag,属性name='Bing_Crosby'的节点\nlabel为tag,属性name='Regis_Philbin'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Bingbing的人的电子邮件、姓氏和位置IP",
        "output": "match (n1:person)  where n1.firstname='Bingbing' return n1.email, n1.lastname, n1.locationip"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='DG_Vaishnav_College'的节点\nlabel为organisation,属性name='Richard_J._Daley_College'的节点\nlabel为organisation,属性name='Daeduk_College'的节点\nlabel为tag,属性name='Steve_Davis'的节点\nlabel为tag,属性name='David_Spade'的节点\nlabel为tag,属性name='Larry_David'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名字为David的人的姓氏、语言、生日、名字、id、创建日期、性别和使用的浏览器，跳过前3个结果，返回接下来的4个结果",
        "output": "match (n1:person)  where n1.firstname='David' return n1.lastname, n1.language, n1.birthday, n1.firstname, n1.id, n1.creationdate, n1.gender, n1.browserused skip 3 limit 4"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Gheorghe_Zane_University'的节点\nlabel为tag,属性name='James_George_Frazer'的节点\nlabel为tag,属性name='Fridtjof_Nansen'的节点\nlabel为tag,属性name='Glenn_Danzig'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Franz的人的浏览器使用情况、电子邮件、位置IP、创建日期、性别、姓氏、生日、ID、语言和名字",
        "output": "match (n1:person)  where n1.firstname='Franz' return n1.browserused, n1.email, n1.locationip, n1.creationdate, n1.gender, n1.lastname, n1.birthday, n1.id, n1.language, n1.firstname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Wall of André Abdelli'的节点\nlabel为organisation,属性name='Jorge_Amado_University_Center'的节点\nlabel为organisation,属性name='Alverno_College'的节点\nlabel为organisation,属性name='Petre_Andrei_University_of_Iaşi'的节点\nlabel为person,属性firstname='Andrey'的节点\nlabel为person,属性firstname='Andrey'的节点\nlabel为person,属性firstname='Andrey'的节点\nlabel为tag,属性name='Andre_Agassi'的节点\nlabel为tag,属性name='Almoravid_dynasty'的节点\nlabel为tag,属性name='Eddy_Arnold'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Andrei的人的生日和创建日期",
        "output": "match (n1:person)  where n1.firstname='Andrei' return n1.birthday, n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='A_Boy_Named_Sue'的节点\nlabel为tag,属性name='Gene_Roddenberry'的节点\nlabel为tag,属性name='Rik_de_Voest'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名字为R.的人的性别、创建日期、语言、IP地址、姓氏、ID、浏览器使用情况和生日，最多返回9条结果",
        "output": "match (n1:person)  where n1.firstname='R.' return n1.gender, n1.creationdate, n1.language, n1.locationip, n1.lastname, n1.id, n1.browserused, n1.birthday limit 9"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Aéreo_Servicio_Guerrero'的节点\nlabel为organisation,属性name='Georgia_Tech_Alumni_Association'的节点\nlabel为organisation,属性name='State_University_of_Gorontalo'的节点\nlabel为tag,属性name='Giorgio_de_Chirico'的节点\nlabel为tag,属性name='Nikolai_Gogol'的节点\nlabel为tag,属性name='Eddie_Guerrero'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Gregorio的人的姓氏、性别、使用的浏览器和语言",
        "output": "match (n1:person)  where n1.firstname='Gregorio' return n1.lastname, n1.gender, n1.browserused, n1.language"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Anna_University,_Chennai'的节点\nlabel为organisation,属性name='Paul_Cézanne_University'的节点\nlabel为organisation,属性name='Ching_Yun_University'的节点\nlabel为person,属性firstname='Chen'的节点\nlabel为person,属性firstname='Chen'的节点\nlabel为person,属性firstname='Chen'的节点\nlabel为place,属性name='Pyin_U_Lwin'的节点\nlabel为tag,属性name='Chris_Claremont'的节点\nlabel为tag,属性name='Christine_Sixteen'的节点\nlabel为tag,属性name='Michael_Caine'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名字为Chen的前5个人的姓名、使用的浏览器、性别、IP地址和语言",
        "output": "match (n1:person)  where n1.firstname='Chen' return n1.firstname, n1.browserused, n1.gender, n1.locationip, n1.language limit 5"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Jackson_Junior_High_School'的节点\nlabel为organisation,属性name='Jain_Institute_of_Technology'的节点\nlabel为tag,属性name='Jennifer_Juniper'的节点\nlabel为tag,属性name='Jennifer_Jason_Leigh'的节点\nlabel为tag,属性name='Justine_Henin'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名字为Jun的人的生日、使用的浏览器、电子邮件和id，限制返回18条结果",
        "output": "match (n1:person)  where n1.firstname='Jun' return n1.birthday, n1.browserused, n1.email, n1.id limit 18"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Friedrich_Nietzsche in Poznań'的节点\nlabel为forum,属性title='Group for Kevin_Rudd in Zhukovsky'的节点\nlabel为forum,属性title='Group for Kevin_Rudd in Zhukovsky'的节点\nlabel为organisation,属性name='Gheorghe_Zane_University'的节点\nlabel为organisation,属性name='Zaoksky_Adventist_University'的节点\nlabel为organisation,属性name='Adam_Mickiewicz_University_in_Poznań'的节点\nlabel为person,属性firstname='Zdenek'的节点\nlabel为person,属性firstname='Zdenek'的节点\nlabel为tag,属性name='Zakk_Wylde'的节点\nlabel为tag,属性name='Zinedine_Zidane'的节点\nlabel为tag,属性name='Glenn_Danzig'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Zdenek的人员的电子邮件、位置IP、创建日期、性别、ID、生日、姓氏和名字",
        "output": "match (n1:person)  where n1.firstname='Zdenek' return n1.email, n1.locationip, n1.creationdate, n1.gender, n1.id, n1.birthday, n1.lastname, n1.firstname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Robert_Louis_Stevenson in Poznań'的节点\nlabel为organisation,属性name='Jenderal_Soedirman_University'的节点\nlabel为organisation,属性name='Webster_University_Vienna'的节点\nlabel为organisation,属性name='Vignan_University'的节点\nlabel为person,属性firstname='Sven'的节点\nlabel为person,属性firstname='Sven'的节点\nlabel为tag,属性name='Shel_Silverstein'的节点\nlabel为tag,属性name='Steve_Allen'的节点\nlabel为tag,属性name='Somdev_Devvarman'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Sven的人员的性别、IP地址、使用的浏览器、创建日期、ID、生日、语言和姓氏",
        "output": "match (n1:person)  where n1.firstname='Sven' return n1.gender, n1.locationip, n1.browserused, n1.creationdate, n1.id, n1.birthday, n1.language, n1.lastname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='SNDT_Women's_University'的节点\nlabel为organisation,属性name='SNDT_Women's_University'的节点\nlabel为organisation,属性name='Imam_Sadiq_University'的节点\nlabel为tag,属性name='I_Got_Id'的节点\nlabel为tag,属性name='Denis_Diderot'的节点\nlabel为tag,属性name='Keith_David'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名字为Dith的前7个人的位置IP、性别、浏览器、名字、生日、创建日期、邮箱和语言",
        "output": "match (n1:person)  where n1.firstname='Dith' return n1.locationip, n1.gender, n1.browserused, n1.firstname, n1.birthday, n1.creationdate, n1.email, n1.language limit 7"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Rivne_Universal_Avia'的节点\nlabel为organisation,属性name='Vignan_University'的节点\nlabel为organisation,属性name='Webster_University_Vienna'的节点\nlabel为person,属性firstname='Edwin'的节点\nlabel为person,属性firstname='Ivan'的节点\nlabel为person,属性firstname='Ivan'的节点\nlabel为tag,属性name='Allen_Iverson'的节点\nlabel为tag,属性name='Steve_Irwin'的节点\nlabel为tag,属性name='Richard_Owen'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Ivan的前三个人的浏览器使用情况、id、位置IP和生日",
        "output": "match (n1:person)  where n1.firstname='Ivan' return n1.browserused, n1.id, n1.locationip, n1.birthday limit 3"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Miriam_College'的节点\nlabel为tag,属性name='I_Got_Id'的节点\nlabel为tag,属性name='My_Name_Is'的节点\nlabel为tag,属性name='I_Need_Mine'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名字为Mee的人的id、性别、IP地址、浏览器使用情况和姓氏",
        "output": "match (n1:person)  where n1.firstname='Mee' return n1.firstname, n1.id, n1.gender, n1.locationip, n1.browserused, n1.lastname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Sergei_Eisenstein in Bijie'的节点\nlabel为forum,属性title='Group for Bing_Crosby in Belgorod'的节点\nlabel为organisation,属性name='Engineering_College,_Bikaner'的节点\nlabel为organisation,属性name='José_Rizal_University'的节点\nlabel为organisation,属性name='Rafael_Belloso_Chacin_University'的节点\nlabel为place,属性name='Cooch_Behar'的节点\nlabel为place,属性name='Bab_Ezzouar'的节点\nlabel为tag,属性name='Michael_Berrer'的节点\nlabel为tag,属性name='Gebhard_Leberecht_von_Blücher'的节点\nlabel为tag,属性name='Carole_Bayer_Sager'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Bechir的人员的语言、电子邮件、IP地址、浏览器、性别和创建日期",
        "output": "match (n1:person)  where n1.firstname='Bechir' return n1.language, n1.email, n1.locationip, n1.browserused, n1.gender, n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Avadh_University'的节点\nlabel为organisation,属性name='Deen_Dayal_Upadhyaya_College'的节点\nlabel为tag,属性name='Alan_Ladd'的节点\nlabel为tag,属性name='Azad_Hind'的节点\nlabel为tag,属性name='Eddy_Arnold'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名字为Aad De的人的生日、邮箱、id、位置IP、性别、语言、姓氏、浏览器使用情况和创建日期，限制返回19条结果",
        "output": "match (n1:person)  where n1.firstname='Aad De' return n1.birthday, n1.email, n1.id, n1.locationip, n1.gender, n1.language, n1.lastname, n1.browserused, n1.creationdate limit 19"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Alicia_Keys in Jalpaiguri'的节点\nlabel为forum,属性title='Group for Percy_Bysshe_Shelley in Galați'的节点\nlabel为organisation,属性name='Ohio_Valley_University'的节点\nlabel为organisation,属性name='Al_Akhawayn_University'的节点\nlabel为organisation,属性name='El_Asher_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Alex_Shelley'的节点\nlabel为tag,属性name='Hyder_Ali'的节点\nlabel为tag,属性name='Sher_Shah_Suri'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Ashley的人的性别、使用的浏览器、姓氏、id、生日、电子邮件和位置IP",
        "output": "match (n1:person)  where n1.firstname='Ashley' return n1.gender, n1.browserused, n1.lastname, n1.id, n1.birthday, n1.email, n1.locationip"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for James_Joyce in Salem'的节点\nlabel为person,属性firstname='James'的节点\nlabel为person,属性firstname='James'的节点\nlabel为person,属性firstname='James'的节点\nlabel为tag,属性name='Jesse_James'的节点\nlabel为tag,属性name='Jim_Jones'的节点\nlabel为tag,属性name='Jesse_Jackson'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为James的用户的姓氏、生日和id",
        "output": "match (n1:person)  where n1.firstname='James' return n1.lastname, n1.birthday, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Florida_Student_Association'的节点\nlabel为tag,属性name='Greg_Rusedski'的节点\nlabel为tag,属性name='Roger_Federer'的节点\nlabel为tag,属性name='Felix_Frankfurter'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名字为Frederick的用户的生日、性别、邮箱、id、创建日期、使用的浏览器、名字和语言，最多返回9个结果",
        "output": "match (n1:person)  where n1.firstname='Frederick' return n1.birthday, n1.gender, n1.email, n1.id, n1.creationdate, n1.browserused, n1.firstname, n1.language limit 9"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='DG_Vaishnav_College'的节点\nlabel为organisation,属性name='Gabriel_Dumont_Institute'的节点\nlabel为organisation,属性name='DePaul_University'的节点\nlabel为person,属性firstname='David'的节点\nlabel为person,属性firstname='David'的节点\nlabel为person,属性firstname='David'的节点\nlabel为tag,属性name='David_Niven'的节点\nlabel为tag,属性name='Larry_David'的节点\nlabel为tag,属性name='David_Spade'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为David的人的IP地址、创建日期、id、姓氏、生日、使用的浏览器、语言、名字和电子邮件",
        "output": "match (n1:person)  where n1.firstname='David' return n1.locationip, n1.creationdate, n1.id, n1.lastname, n1.birthday, n1.browserused, n1.language, n1.firstname, n1.email"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Rafael_Nadal in Visonta'的节点\nlabel为forum,属性title='Group for Vytautas in Banda_Aceh'的节点\nlabel为forum,属性title='Group for Vytautas in Banda_Aceh'的节点\nlabel为organisation,属性name='Jorge_A._Sabato_institute'的节点\nlabel为organisation,属性name='Sai_Vidya_Institute_of_Technology'的节点\nlabel为organisation,属性name='Sripat_Singh_College'的节点\nlabel为tag,属性name='Satavahana_dynasty'的节点\nlabel为tag,属性name='Ya_Soshla_S_Uma'的节点\nlabel为tag,属性name='Sher_Shah_Suri'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名字为Shweta的人员的姓名、语言、电子邮件、生日、姓氏、创建日期、位置IP和浏览器信息",
        "output": "match (n1:person)  where n1.firstname='Shweta' return n1.firstname, n1.language, n1.email, n1.birthday, n1.lastname, n1.creationdate, n1.locationip, n1.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Adithya_Institute_of_Technology'的节点\nlabel为organisation,属性name='Aditya_College'的节点\nlabel为organisation,属性name='Adama_University'的节点\nlabel为tag,属性name='The_Downeaster_Alexa'的节点\nlabel为tag,属性name='Searching_for_Jerry_Garcia'的节点\nlabel为tag,属性name='Iparhi_Agapi_Edo'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Aditya的人使用的浏览器",
        "output": "match (n1:person)  where n1.firstname='Aditya' return n1.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Saint_Paul_University'的节点\nlabel为organisation,属性name='Saint_Paul_University_Philippines'的节点\nlabel为organisation,属性name='Paul_Sabatier_University'的节点\nlabel为person,属性firstname='Paul'的节点\nlabel为person,属性firstname='Paul'的节点\nlabel为person,属性firstname='Paul'的节点\nlabel为tag,属性name='Paul_Is_Live'的节点\nlabel为tag,属性name='Pier_Paolo_Pasolini'的节点\nlabel为tag,属性name='Pope_Paul_V'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名字为Paul的人的生日",
        "output": "match (n1:person)  where n1.firstname='Paul' return n1.birthday"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 19 of Emperor of Brazil Machado'的节点\nlabel为forum,属性title='Album 21 of Emperor of Brazil Dom Pedro II'的节点\nlabel为forum,属性title='Album 20 of Emperor of Brazil Dom Pedro II'的节点\nlabel为organisation,属性name='Rafael_Belloso_Chacin_University'的节点\nlabel为organisation,属性name='Sergio_Arboleda_University'的节点\nlabel为organisation,属性name='Simón_Bolívar_University'的节点\nlabel为person,属性firstname='Emperor of Brazil'的节点\nlabel为person,属性firstname='Emperor of Brazil'的节点\nlabel为person,属性firstname='Emperor of Brazil'的节点\nlabel为place,属性name='Pedro_Escobedo'的节点\nlabel为place,属性name='Presidencia_Roque_Sáenz_Peña'的节点\nlabel为place,属性name='Antón_Lizardo'的节点\nlabel为tag,属性name='Pedro_I_of_Brazil'的节点\nlabel为tag,属性name='John_VI_of_Portugal'的节点\nlabel为tag,属性name='Pedro_II_of_Brazil'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Emperor of Brazil的人的语言、使用的浏览器、性别、生日、创建日期和邮箱，限制返回20条结果",
        "output": "match (n1:person)  where n1.firstname='Emperor of Brazil' return n1.language, n1.browserused, n1.gender, n1.birthday, n1.creationdate, n1.email limit 20"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为forum,属性title='Group for Mustafa_Kemal_Atatürk in Indianapolis'的节点\nlabel为forum,属性title='Group for Nikolay_Davydenko in Ahmedpur_Sial'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Al-Ahliyya_Amman_University'的节点\nlabel为organisation,属性name='Amman_Arab_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为place,属性name='Addis_Ababa'的节点\nlabel为tag,属性name='Arif_Mardin'的节点\nlabel为tag,属性name='Ilham_Aliyev'的节点\nlabel为tag,属性name='Mahmoud_Ahmadinejad'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Ahmed的人员的位置IP、使用的语言、姓氏和生日",
        "output": "match (n1:person)  where n1.firstname='Ahmed' return n1.locationip, n1.language, n1.lastname, n1.birthday"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Arik_Niger'的节点\nlabel为person,属性firstname='Eric'的节点\nlabel为person,属性firstname='Eric'的节点\nlabel为tag,属性name='Eric_Walter_Elst'的节点\nlabel为tag,属性name='Eric_Idle'的节点\nlabel为tag,属性name='Rickie_Lee_Jones'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名字为Eric的人的性别",
        "output": "match (n1:person)  where n1.firstname='Eric' return n1.gender"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Nikolay_Davydenko in Ahmedpur_Sial'的节点\nlabel为forum,属性title='Group for Lindsay_Davenport in Ahmedpur_Sial'的节点\nlabel为organisation,属性name='Deen_Dayal_Upadhyaya_College'的节点\nlabel为organisation,属性name='Daeduk_College'的节点\nlabel为organisation,属性name='Addis_Continental_Institute_of_Public_Health'的节点\nlabel为place,属性name='Addis_Ababa'的节点\nlabel为tag,属性name='André_Gide'的节点\nlabel为tag,属性name='Alan_Ladd'的节点\nlabel为tag,属性name='Azad_Hind'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Aad De的人员的生日、语言、性别、创建日期、名、姓、电子邮件和位置IP",
        "output": "match (n1:person)  where n1.firstname='Aad De' return n1.birthday, n1.language, n1.gender, n1.creationdate, n1.firstname, n1.lastname, n1.email, n1.locationip"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Jennifer_Jason_Leigh'的节点\nlabel为tag,属性name='John_Jay'的节点\nlabel为tag,属性name='Joan_Allen'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Juan的用户的创建日期和名字",
        "output": "match (n1:person)  where n1.firstname='Juan' return n1.creationdate, n1.firstname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Madarastul_Falaah_Kibra'的节点\nlabel为organisation,属性name='Fatima_Jinnah_Women_University'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为tag,属性name='Saif_Ali_Khan'的节点\nlabel为tag,属性name='Hyder_Ali'的节点\nlabel为tag,属性name='Bill_Frisell'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Faisal的用户的姓氏和生日，最多返回18条记录",
        "output": "match (n1:person)  where n1.firstname='Faisal' return n1.lastname, n1.birthday limit 18"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Aichi_Mizuho_College'的节点\nlabel为organisation,属性name='Toyohashi_Sozo_College'的节点\nlabel为organisation,属性name='Sagami_Women's_University'的节点\nlabel为tag,属性name='Takehito_Koyasu'的节点\nlabel为tag,属性name='Ashikaga_shogunate'的节点\nlabel为tag,属性name='Jelena_Kostanić_Tošić'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名字为Takeshi的人的性别、电子邮件、创建日期和生日",
        "output": "match (n1:person)  where n1.firstname='Takeshi' return n1.gender, n1.email, n1.creationdate, n1.birthday"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Sai_Vidya_Institute_of_Technology'的节点\nlabel为organisation,属性name='SNDT_Women's_University'的节点\nlabel为organisation,属性name='SNDT_Women's_University'的节点\nlabel为tag,属性name='Swagga_Like_Us'的节点\nlabel为tag,属性name='Suzanne_Vega'的节点\nlabel为tag,属性name='Satavahana_dynasty'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Shweta的人员的浏览器使用情况、语言、生日、电子邮件、姓氏、名字、创建日期、性别、位置IP和ID",
        "output": "match (n1:person)  where n1.firstname='Shweta' return n1.browserused, n1.language, n1.birthday, n1.email, n1.lastname, n1.firstname, n1.creationdate, n1.gender, n1.locationip, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Nancy_2_University'的节点\nlabel为organisation,属性name='Anna_University'的节点\nlabel为organisation,属性name='Nihon_University'的节点\nlabel为tag,属性name='Neil_Young'的节点\nlabel为tag,属性name='Anna_Nicole_Smith'的节点\nlabel为tag,属性name='Gene_Vincent'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名字为Ning的用户的创建日期和名字，最多返回7个结果",
        "output": "match (n1:person)  where n1.firstname='Ning' return n1.creationdate, n1.firstname limit 7"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Joel_McCrea'的节点\nlabel为tag,属性name='John_Jay'的节点\nlabel为tag,属性name='Jesse_Jackson'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Joao的人的性别、姓氏、生日、位置IP、语言、创建日期和使用的浏览器",
        "output": "match (n1:person)  where n1.firstname='Joao' return n1.gender, n1.lastname, n1.birthday, n1.locationip, n1.language, n1.creationdate, n1.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Rafael_Nadal in Visonta'的节点\nlabel为organisation,属性name='Private_University_of_Angola'的节点\nlabel为organisation,属性name='Arellano_University'的节点\nlabel为organisation,属性name='Arellano_University'的节点\nlabel为place,属性name='Iloilo_City'的节点\nlabel为place,属性name='Anantapur_district'的节点\nlabel为place,属性name='Chorrillos_District'的节点\nlabel为tag,属性name='Idlewild_South'的节点\nlabel为tag,属性name='Al_otro_lado_del_río'的节点\nlabel为tag,属性name='Arantxa_Parra_Santonja'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Angola的地方的id",
        "output": "match (n1:place)  where n1.name='Angola' return n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='National_University_of_the_Chaco_Austral'的节点\nlabel为organisation,属性name='LTU_Austria'的节点\nlabel为organisation,属性name='Austral_University'的节点\nlabel为place,属性name='Anantapur_district'的节点\nlabel为tag,属性name='Anne_of_Austria'的节点\nlabel为tag,属性name='Archduchy_of_Austria'的节点\nlabel为tag,属性name='Idlewild_South'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Austria的地方的名称和id",
        "output": "match (n1:place)  where n1.name='Austria' return n1.name, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 14 of Arbaaz Ali'的节点\nlabel为forum,属性title='Album 14 of Amjad Islam Ahsan'的节点\nlabel为forum,属性title='Group for Mahmud_of_Ghazni in Raniganj'的节点\nlabel为organisation,属性name='Azerbaijan_University_of_Languages'的节点\nlabel为organisation,属性name='Qazvin_Islamic_Azad_University'的节点\nlabel为organisation,属性name='Al-Azhar_University'的节点\nlabel为place,属性name='Jiaganj_Azimganj'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Addis_Ababa'的节点\nlabel为tag,属性name='Zine_El_Abidine_Ben_Ali'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\nlabel为tag,属性name='Ayman_al-Zawahiri'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Azerbaijan的地方的url、id和名称，并按名称排序，返回前14个结果",
        "output": "match (n1:place)  where n1.name='Azerbaijan' return n1.url, n1.id, n1.name order by n1.name limit 14"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Osama_bin_Laden in Toliara'的节点\nlabel为organisation,属性name='Gulbarga_University'的节点\nlabel为organisation,属性name='New_Bulgarian_University'的节点\nlabel为organisation,属性name='Bulacan_State_University'的节点\nlabel为tag,属性name='Principality_of_Bulgaria'的节点\nlabel为tag,属性name='Kingdom_of_Bulgaria'的节点\nlabel为tag,属性name='Volga_Bulgaria'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Bulgaria的url和id",
        "output": "match (n1:place)  where n1.name='Bulgaria' return n1.url, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Hamdard_University'的节点\nlabel为organisation,属性name='Hamdard_University'的节点\nlabel为organisation,属性name='Las_Condes_University'的节点\nlabel为place,属性name='Ramadan_City'的节点\nlabel为tag,属性name='Caught_out_There'的节点\nlabel为tag,属性name='In_Search_of_the_Lost_Chord'的节点\nlabel为tag,属性name='Get_Buck_in_Here'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Chad的地方的网址，最多返回4个结果",
        "output": "match (n1:place)  where n1.name='Chad' return n1.url limit 4"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Cayetano_Heredia_University'的节点\nlabel为organisation,属性name='Open_University_of_Catalonia'的节点\nlabel为organisation,属性name='Universidad_del_Norte,_Colombia'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为place,属性name='Chorrillos_District'的节点\nlabel为place,属性name='Cagayan_de_Oro'的节点\nlabel为tag,属性name='Caliphate_of_Córdoba'的节点\nlabel为tag,属性name='Al_otro_lado_del_río'的节点\nlabel为tag,属性name='Canto_della_Terra'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Croatia的地方的url、id和名称，并按名称排序",
        "output": "match (n1:place)  where n1.name='Croatia' return n1.url, n1.id, n1.name order by n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Transavia_Denmark_ApS'的节点\nlabel为organisation,属性name='Davangere_University'的节点\nlabel为organisation,属性name='Gdańsk_University_of_Technology'的节点\nlabel为tag,属性name='Richard_Widmark'的节点\nlabel为tag,属性name='Glenn_Danzig'的节点\nlabel为tag,属性name='Alexandra_of_Denmark'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Denmark的id和名称",
        "output": "match (n1:place)  where n1.name='Denmark' return n1.id, n1.name"
    }
]