[
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Nikolay_Davydenko in Ahmedpur_Sial'的节点\nlabel为organisation,属性name='Domodedovo_Airlines'的节点\nlabel为organisation,属性name='Dirgantara_Air_Service'的节点\nlabel为organisation,属性name='Air_Arabia_Jordan'的节点\nlabel为place,属性name='João_Monlevade'的节点\nlabel为tag,属性name='Ahmad_Shah_Durrani'的节点\nlabel为tag,属性name='Michael_Jordan'的节点\nlabel为tag,属性name='Juan_Martín_del_Potro'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在MarcoPolo Airways工作的Djelaludin的个人信息，包括他的姓氏、生日、创建日期、名、浏览器使用情况、语言、关系的创建日期、工作开始日期以及他的id和组织的id。",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n2.name='MarcoPolo_Airways' and n1.firstname='Djelaludin' return n2.id, n1.lastname, n1.birthday, n2.name, n1.creationdate, n1.firstname, n1.browserused, n1.language, r1.creationdate, r1.workfrom, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为forum,属性title='Group for Alicia_Keys in Jalpaiguri'的节点\nlabel为forum,属性title='Group for Nawaz_Sharif in Cali'的节点\nlabel为organisation,属性name='Aliah_University'的节点\nlabel为organisation,属性name='Mohammad_Ali_Jinnah_University'的节点\nlabel为organisation,属性name='ACSI_College-Iloilo'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为tag,属性name='Muhammad_Ali'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\nlabel为tag,属性name='Hyder_Ali'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Ali的人的姓氏，这些人有工作单位信息",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n1.firstname='Ali' return n1.lastname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Indian_Institute_of_Management_Ahmedabad'的节点\nlabel为organisation,属性name='Shahid_Madani_University_Of_Azarbaijan'的节点\nlabel为person,属性firstname='Abdul Rahim'的节点\nlabel为person,属性firstname='Abdul Rahim'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Abdul Rahim的人的工作开始时间、性别、姓氏、名字、关系创建日期和生日，以及他工作的组织信息。",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n1.firstname='Abdul Rahim' return r1.workfrom, n1.gender, n1.lastname, n1.firstname, r1.creationdate, n1.birthday"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Sky_Work_Airlines'的节点\nlabel为organisation,属性name='Hola_Airlines'的节点\nlabel为organisation,属性name='MarcoPolo_Airways'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在MarcoPolo Airways工作的人员的工作开始日期、使用的浏览器、生日、语言、IP地址和创建日期",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n2.name='MarcoPolo_Airways' return r1.creationdate, n1.browserused, n1.birthday, n1.language, n1.locationip, n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='University_of_Applied_Sciences_Leiden'的节点\nlabel为organisation,属性name='Leiden_University'的节点\nlabel为organisation,属性name='J._Sargeant_Reynolds_Community_College'的节点\nlabel为place,属性name='Pyin_U_Lwin'的节点\nlabel为tag,属性name='John_Lydon'的节点\nlabel为tag,属性name='Lyndon_B._Johnson'的节点\nlabel为tag,属性name='John_Lennon'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Leonid的人的工作信息，包括他的工作开始时间、账户创建日期、性别、所在组织的id和名称、个人的邮箱、姓氏、id、语言、组织的网址、生日、使用的浏览器、位置IP以及关系的创建日期，并按组织名称排序。",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n1.firstname='Leonid' return r1.workfrom, n1.creationdate, n1.gender, n2.id, n1.firstname, n1.email, n1.lastname, n1.id, n1.language, n2.url, n2.name, n1.birthday, n1.browserused, n1.locationip, r1.creationdate order by n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为organisation,属性name='Iran_Aseman_Airlines'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Imam_Sadiq_University'的节点\nlabel为person,属性firstname='Abdul Rahim'的节点\nlabel为person,属性firstname='Abdul Rahim'的节点\nlabel为person,属性firstname='Abay Ibrahim'的节点\nlabel为place,属性name='Islamabad/Rawalpindi,Lahore'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\nlabel为tag,属性name='Arif_Mardin'的节点\nlabel为tag,属性name='Saif_Ali_Khan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Pamir Airways工作的名为Abdul Rahim的人的id、组织的网址、个人的位置IP、语言和性别",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n2.name='Pamir_Airways' and n1.firstname='Abdul Rahim' return n1.id, n2.url, n1.locationip, n1.language, n2.name, n1.gender"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Imam_Sadiq_University'的节点\nlabel为organisation,属性name='Thadomal_Shahani_Engineering_College'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为place,属性name='Sahiwal_Division'的节点\nlabel为tag,属性name='Mohammed_Zahir_Shah'的节点\nlabel为tag,属性name='Adil_Shahi_dynasty'的节点\nlabel为tag,属性name='Saif_Ali_Khan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Pamir Airways工作的名为Ahmad Shah的人的组织网址、个人id、姓氏、电子邮件、工作关系的创建日期、组织id、开始工作日期、性别和组织名称，限制返回18条记录",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n2.name='Pamir_Airways' and n1.firstname='Ahmad Shah' return n2.url, n1.id, n1.lastname, n1.email, r1.creationdate, n2.id, r1.workfrom, n1.gender, n2.name limit 18"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Nikolay_Davydenko in Ahmedpur_Sial'的节点\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为forum,属性title='Group for Lindsay_Davenport in Ahmedpur_Sial'的节点\nlabel为organisation,属性name='Pamir_Airways'的节点\nlabel为organisation,属性name='Bakhtar_Afghan_Airlines'的节点\nlabel为organisation,属性name='Pakistan_Air_Force_Academy'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Addis_Ababa'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\nlabel为tag,属性name='Arif_Mardin'的节点\nlabel为tag,属性name='Azad_Hind'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Pamir_Airways工作的名叫Abdul的人的姓名、生日、组织的网址和id、性别、位置IP、浏览器使用情况、语言、创建日期、个人id、电子邮件，以及工作关系的创建日期和开始工作时间。",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n2.name='Pamir_Airways' and n1.firstname='Abdul' return n1.firstname, n1.birthday, n2.url, n2.id, n1.gender, n1.locationip, n1.browserused, n1.language, n1.creationdate, n1.id, n1.email, r1.creationdate, r1.workfrom, n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Aliah_University'的节点\nlabel为organisation,属性name='Al-Farabi_University'的节点\nlabel为organisation,属性name='Al-Ahliyya_Amman_University'的节点\nlabel为tag,属性name='Axel_F'的节点\nlabel为tag,属性name='Ivan_Lendl'的节点\nlabel为tag,属性name='Hyder_Ali'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Alif的人的工作单位的id、网址，以及该人的性别、生日、电子邮件、使用的浏览器、语言、账户创建日期和工作关系的创建日期",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n1.firstname='Alif' return r1.creationdate, n1.creationdate, n1.email, n2.id, n1.gender, n2.url, n1.browserused, n1.language, n1.firstname, n1.birthday"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为organisation,属性name='Rammohan_College'的节点\nlabel为organisation,属性name='Shahid_Rajaee_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为tag,属性name='Rahul_Dev_Burman'的节点\nlabel为tag,属性name='Rahm_Emanuel'的节点\nlabel为tag,属性name='Rajeev_Ram'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名字为Rahim的人的电子邮件、浏览器使用情况、工作单位的网址以及他的性别和名字",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n1.firstname='Rahim' return n1.email, n1.browserused, n2.url, n1.gender, n1.firstname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为organisation,属性name='Iran_Aseman_Airlines'的节点\nlabel为organisation,属性name='Bakhtar_Afghan_Airlines'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Islamabad/Rawalpindi,Lahore'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Arif_Mardin'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Abdul Rahim且在Bakhtar Afghan Airlines工作的人的工作开始日期、使用的浏览器、姓氏、创建日期、语言、名字、关系的创建日期、公司的名称、电子邮件、生日、公司网址、性别、公司ID和位置IP",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n1.firstname='Abdul Rahim' and n2.name='Bakhtar_Afghan_Airlines' return r1.workfrom, n1.browserused, n1.lastname, n1.creationdate, n1.language, n1.firstname, r1.creationdate, n2.name, n1.email, n1.birthday, n2.url, n1.gender, n2.id, n1.locationip"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为organisation,属性name='Air_Arabia_Maroc'的节点\nlabel为organisation,属性name='Bakhtar_Afghan_Airlines'的节点\nlabel为organisation,属性name='Wafaq_ul_Madaris_Al-Arabia,_Pakistan'的节点\nlabel为person,属性firstname='Mamoon Eshaq 0'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Mohammed_Zahir_Shah'的节点\nlabel为tag,属性name='Emirate_of_Bukhara'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Mamoon Eshaq 0且在Bakhtar Afghan Airlines工作的人员的组织名称、创建日期、姓氏、名字、语言以及工作开始时间，并按组织名称排序",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n1.firstname='Mamoon Eshaq 0' and n2.name='Bakhtar_Afghan_Airlines' return n2.name, n1.creationdate, n1.lastname, n1.firstname, n1.language, r1.workfrom order by n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 26 of Abdul Baseer Khan'的节点\nlabel为forum,属性title='Album 16 of Abdul Baseer Khan'的节点\nlabel为forum,属性title='Album 13 of Abdul Baseer Khan'的节点\nlabel为organisation,属性name='Bakhtar_Afghan_Airlines'的节点\nlabel为organisation,属性name='Bahria_College_Islamabad'的节点\nlabel为organisation,属性name='Dr._Babasaheb_Ambedkar_Open_University'的节点\nlabel为person,属性firstname='Abdul Baseer'的节点\nlabel为place,属性name='Bahir_Dar'的节点\nlabel为place,属性name='Islamabad/Rawalpindi,Lahore'的节点\nlabel为place,属性name='Khyber_Pakhtunkhwa'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Emirate_of_Bukhara'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Abdul Baseer在Bakhtar Afghan Airlines工作的开始时间",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n2.name='Bakhtar_Afghan_Airlines' and n1.firstname='Abdul Baseer' return r1.workfrom"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Nikolay_Davydenko in Ahmedpur_Sial'的节点\nlabel为forum,属性title='Group for Genghis_Khan in Asadabad'的节点\nlabel为forum,属性title='Group for Genghis_Khan in Asadabad'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Bakhtar_Afghan_Airlines'的节点\nlabel为organisation,属性name='Air_Arabia_Jordan'的节点\nlabel为place,属性name='Jiaganj_Azimganj'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为place,属性name='Bandar_Lampung'的节点\nlabel为tag,属性name='Ahmad_Shah_Durrani'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\nlabel为tag,属性name='Azad_Hind'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Bakhtar Afghan Airlines工作的名为Djelaludin的人员的信息，包括组织的id、网址，人员的IP地址、邮箱、生日、性别、名字、浏览器、姓氏、关系的创建日期、使用的语言、工作开始日期以及人员的创建日期，限制返回14条结果。",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n2.name='Bakhtar_Afghan_Airlines' and n1.firstname='Djelaludin' return n2.id, n2.url, n1.locationip, n1.email, n1.birthday, n1.gender, n1.firstname, n2.name, n1.browserused, n1.lastname, r1.creationdate, n1.language, r1.workfrom, n1.creationdate limit 14"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Mahmud_of_Ghazni in Raniganj'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Iran_Aseman_Airlines'的节点\nlabel为organisation,属性name='Al-Ahliyya_Amman_University'的节点\nlabel为person,属性firstname='Abdul Rahim'的节点\nlabel为person,属性firstname='Abdul Rahim'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Islamabad/Rawalpindi,Lahore'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Osama_bin_Laden'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Abdul Rahim且在Bakhtar Afghan Airlines工作的人的id、浏览器使用情况、IP地址、电子邮件、语言，以及该组织的名称、网址，关系的创建日期和开始工作时间，按组织名称排序",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n1.firstname='Abdul Rahim' and n2.name='Bakhtar_Afghan_Airlines' return n1.id, n2.name, n1.browserused, n1.locationip, n2.url, n1.email, r1.creationdate, r1.workfrom, n1.language order by n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为organisation,属性name='Rammohan_College'的节点\nlabel为organisation,属性name='Rajalakshmi_Engineering_College'的节点\nlabel为organisation,属性name='Ranabima_Royal_College'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为place,属性name='Ramadan_City'的节点\nlabel为tag,属性name='Rajeev_Ram'的节点\nlabel为tag,属性name='Rahm_Emanuel'的节点\nlabel为tag,属性name='Rahul_Dev_Burman'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Rahim的人的工作开始时间",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n1.firstname='Rahim' return r1.workfrom"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Genghis_Khan in Asadabad'的节点\nlabel为forum,属性title='Group for Genghis_Khan in Asadabad'的节点\nlabel为forum,属性title='Group for Genghis_Khan in Asadabad'的节点\nlabel为organisation,属性name='Bakhtar_Afghan_Airlines'的节点\nlabel为organisation,属性name='Pakistan_Navy_Engineering_College'的节点\nlabel为organisation,属性name='Khyber_Afghan_Airlines'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\nlabel为tag,属性name='Palestinian_National_Authority'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Bakhtar Afghan Airlines工作的人员的姓氏、IP地址、名字、使用的浏览器、创建日期，以及该组织的id、网址、关系的创建日期和工作开始时间。",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n2.name='Bakhtar_Afghan_Airlines' return r1.creationdate, n1.lastname, n1.locationip, n1.firstname, n1.browserused, n2.id, n1.creationdate, n2.url, r1.workfrom, n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 17 of Amjad Islam Ahsan'的节点\nlabel为forum,属性title='Album 27 of Amjad Islam Ahsan'的节点\nlabel为forum,属性title='Album 17 of Babar Ahmed'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Bakhtar_Afghan_Airlines'的节点\nlabel为organisation,属性name='Shahid_Madani_University_Of_Azarbaijan'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Fatehgarh_Sahib'的节点\nlabel为place,属性name='Islamabad/Rawalpindi,Lahore'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Saif_Ali_Khan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Bakhtar Afghan Airlines工作的名为Abdul Wahid的人所使用的浏览器和生日，最多返回17条结果",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n2.name='Bakhtar_Afghan_Airlines' and n1.firstname='Abdul Wahid' return n1.browserused, n1.birthday limit 17"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为forum,属性title='Group for Nawaz_Sharif in Cali'的节点\nlabel为forum,属性title='Group for Mustafa_Kemal_Atatürk in Indianapolis'的节点\nlabel为organisation,属性name='Bakhtar_Afghan_Airlines'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Air_Arabia_Egypt'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Saif_Ali_Khan'的节点\nlabel为tag,属性name='Yasser_Arafat'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Bakhtar Afghan Airlines工作的名为Alif的人的电子邮件、关系创建日期、语言、性别、生日、创建日期、组织ID、位置IP、浏览器使用情况、组织URL、组织名称和姓氏",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n2.name='Bakhtar_Afghan_Airlines' and n1.firstname='Alif' return n1.email, r1.creationdate, n1.language, n1.gender, n1.birthday, n1.creationdate, n2.id, n1.locationip, n1.browserused, n2.url, n2.name, n1.lastname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Nikolay_Davydenko in Ahmedpur_Sial'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为organisation,属性name='Safi_Airways'的节点\nlabel为organisation,属性name='Safiran_Airlines'的节点\nlabel为organisation,属性name='ItAli_Airlines'的节点\nlabel为tag,属性name='S&M_Airlines'的节点\nlabel为tag,属性name='Saif_Ali_Khan'的节点\nlabel为tag,属性name='Sher_Shah_Suri'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Safi Airways工作的人员的语言、邮箱、id、名字、性别、位置IP和创建日期，同时返回Safi Airways的网址",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n2.name='Safi_Airways' return n1.language, n1.email, n1.id, n1.firstname, n1.gender, n1.locationip, n2.url, n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Imam_Sadiq_University'的节点\nlabel为organisation,属性name='Shahid_Madani_University_Of_Azarbaijan'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\nlabel为tag,属性name='Rahul_Dev_Burman'的节点\nlabel为tag,属性name='Osama_bin_Laden'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Abdul Rahim的人的电子邮件、工作开始日期、使用的浏览器和性别",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n1.firstname='Abdul Rahim' return n1.email, r1.creationdate, n1.browserused, n1.gender"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Air_Arabia_Maroc'的节点\nlabel为organisation,属性name='AlMasria_Universal_Airlines'的节点\nlabel为person,属性firstname='Mamoon Eshaq 0'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为place,属性name='Fatehgarh_Sahib'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Mohammed_Zahir_Shah'的节点\nlabel为tag,属性name='Saif_Ali_Khan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Mamoon Eshaq 0且在Safi Airways工作的人员的详细信息，包括组织的id，人员的姓氏、使用的浏览器、工作开始时间、语言、关系创建日期、创建日期、组织名称、生日、邮箱、名字、性别、位置IP、人员id和组织的网址。",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n1.firstname='Mamoon Eshaq 0' and n2.name='Safi_Airways' return n2.id, n1.lastname, n1.browserused, r1.workfrom, n1.language, r1.creationdate, n1.creationdate, n2.name, n1.birthday, n1.email, n1.firstname, n1.gender, n1.locationip, n1.id, n2.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为organisation,属性name='Iran_Aseman_Airlines'的节点\nlabel为organisation,属性name='Thadomal_Shahani_Engineering_College'的节点\nlabel为organisation,属性name='Thadomal_Shahani_Engineering_College'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为place,属性name='Sahiwal_Division'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为tag,属性name='Saif_Ali_Khan'的节点\nlabel为tag,属性name='Mohammed_Zahir_Shah'的节点\nlabel为tag,属性name='Sam_Raimi'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Safi Airways工作的名为Rahim的人员的性别、组织名称、组织id、人员姓氏、工作开始日期以及人员的创建日期",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n2.name='Safi_Airways' and n1.firstname='Rahim' return n1.gender, n2.name, n2.id, n1.lastname, r1.creationdate, r1.workfrom, n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Andy_Roddick in Ahmedpur_Sial'的节点\nlabel为forum,属性title='Group for Nikolay_Davydenko in Ahmedpur_Sial'的节点\nlabel为forum,属性title='Group for Lindsay_Davenport in Ahmedpur_Sial'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Sidi_Mohamed_Ben_Abdellah_University'的节点\nlabel为organisation,属性name='Shah_Abdul_Latif_University'的节点\nlabel为person,属性firstname='Abdul'的节点\nlabel为person,属性firstname='Salim Ahmed'的节点\nlabel为person,属性firstname='Abay Ibrahim'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为place,属性name='Addis_Ababa'的节点\nlabel为tag,属性name='Azad_Hind'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\nlabel为tag,属性name='Saif_Ali_Khan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Safi Airways工作的名叫Abdul的人的id",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n2.name='Safi_Airways' and n1.firstname='Abdul' return n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Alsek_Air_Service'的节点\nlabel为organisation,属性name='Sky_Work_Airlines'的节点\nlabel为organisation,属性name='Air_Go_Airlines'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Air Algérie工作的人员的详细信息，包括工作开始时间、人员的创建日期、姓名、性别、组织的网址和名称、使用的浏览器、关系的创建日期、组织的id、人员的id、电子邮件和语言。",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n2.name='Air_Algérie' return r1.workfrom, n1.creationdate, n1.firstname, n1.gender, n2.url, n2.name, n1.browserused, r1.creationdate, n2.id, n1.id, n1.email, n1.language"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Alicia_Keys in Jalpaiguri'的节点\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为forum,属性title='Group for Julie_Andrews in Shah_Alam'的节点\nlabel为organisation,属性name='Yamal_Airlines'的节点\nlabel为organisation,属性name='Kendell_Airlines'的节点\nlabel为organisation,属性name='Ajay_Kumar_Garg_Engineering_College'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为tag,属性name='S&M_Airlines'的节点\nlabel为tag,属性name='Saif_Ali_Khan'的节点\nlabel为tag,属性name='Carl_Gustaf_Emil_Mannerheim'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Kamel且在Air_Algérie工作的人员的性别、位置IP、姓氏、创建日期，以及工作开始日期、组织的ID和URL",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n1.firstname='Kamel' and n2.name='Air_Algérie' return r1.creationdate, n1.gender, r1.workfrom, n1.locationip, n1.lastname, n1.creationdate, n2.id, n2.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Amsterdam_University_College'的节点\nlabel为organisation,属性name='Pan_Européenne_Air_Service'的节点\nlabel为organisation,属性name='Fred_Olsen_Air_Transport'的节点\nlabel为tag,属性name='Adrian_Edmondson'的节点\nlabel为tag,属性name='Eddy_Arnold'的节点\nlabel为tag,属性name='Anthony_Eden'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Air Algérie工作的名叫Edmond的人的详细信息，包括他们的工作开始时间、id、生日、位置IP、组织的URL、组织名称、关系创建日期、名字、电子邮件和姓氏。",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n2.name='Air_Algérie' and n1.firstname='Edmond' return r1.workfrom, n1.id, n1.birthday, n2.url, n1.locationip, n2.name, r1.creationdate, n1.firstname, n1.email, n1.lastname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='James_Cook_University'的节点\nlabel为organisation,属性name='York_St_John_University'的节点\nlabel为organisation,属性name='José_Rizal_University'的节点\nlabel为tag,属性name='Jesse_Jackson'的节点\nlabel为tag,属性name='Marc_Jacobs'的节点\nlabel为tag,属性name='Jesse_James'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Jacques的人的工作单位的id和网址，以及该人的邮箱、名字、id、位置IP、语言、姓氏、创建日期和浏览器使用情况，最多返回13条记录",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n1.firstname='Jacques' return n1.email, n1.firstname, n2.id, n2.url, n1.id, n1.locationip, n1.language, n1.lastname, n1.creationdate, n1.browserused limit 13"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Al_Akhawayn_University'的节点\nlabel为organisation,属性name='Yonok_University'的节点\nlabel为organisation,属性name='Mohammad_Ali_Jinnah_University'的节点\nlabel为tag,属性name='Goon_Affiliated'的节点\nlabel为tag,属性name='Jennifer_Jason_Leigh'的节点\nlabel为tag,属性name='Wynonna_Judd'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Yacine的人的工作地点、位置IP、语言、组织名称、名字、关系创建日期、姓氏、个人创建日期、浏览器、组织URL、个人ID、电子邮件、性别，并按组织名称排序，限制返回6条记录",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n1.firstname='Yacine' return n1.locationip, n1.language, n2.name, n1.firstname, r1.creationdate, n1.lastname, n1.creationdate, n1.browserused, n2.url, n1.id, n1.email, r1.workfrom, n1.gender order by n2.name limit 6"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Air_Go_Airlines'的节点\nlabel为organisation,属性name='AlphaJet_Airlines'的节点\nlabel为organisation,属性name='AMC_Airlines'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Air Algérie工作的人员的性别、使用的浏览器、生日、IP地址、组织ID、人员ID、组织名称、电子邮件、关系创建日期，并按组织名称降序排列。",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n2.name='Air_Algérie' return n1.gender, n1.browserused, n1.birthday, n1.locationip, n2.id, n1.id, n2.name, n1.email, r1.creationdate, n2.url order by n2.name desc"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Osama_bin_Laden in Toliara'的节点\nlabel为forum,属性title='Group for Daniela_Hantuchová in Shah_Alam'的节点\nlabel为forum,属性title='Group for Vytautas in Banda_Aceh'的节点\nlabel为organisation,属性name='Yamal_Airlines'的节点\nlabel为organisation,属性name='AlMasria_Universal_Airlines'的节点\nlabel为organisation,属性name='Alania_Airlines'的节点\nlabel为place,属性name='Ratmalana_Airport'的节点\nlabel为place,属性name='Banda_Aceh'的节点\nlabel为tag,属性name='Ella_Abraça_Jobim'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\nlabel为tag,属性name='Emirate_of_Granada'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Benhalima且在Air_Algérie工作的人员的姓名、性别、姓氏、浏览器使用情况、生日、关系创建日期、人员ID、语言、电子邮件、组织ID、组织名称、工作开始日期、人员的IP地址和组织的网址",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n1.firstname='Benhalima' and n2.name='Air_Algérie' return n1.firstname, n1.gender, n1.lastname, n1.browserused, n1.birthday, r1.creationdate, n1.id, n1.language, n1.email, n2.id, n2.name, r1.workfrom, n1.locationip, n2.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for John_Edward_Gray in Shah_Alam'的节点\nlabel为forum,属性title='Group for John_Adams in New_Haven'的节点\nlabel为organisation,属性name='Jagson_Airlines'的节点\nlabel为organisation,属性name='Air_Arabia_Jordan'的节点\nlabel为organisation,属性name='Aero_Business_Charter'的节点\nlabel为tag,属性name='Joan_Allen'的节点\nlabel为tag,属性name='Jean_Alesi'的节点\nlabel为tag,属性name='Wyclef_Jean'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Jean的人在Air Algérie工作的时间，返回前8条记录的创建日期",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n1.firstname='Jean' and n2.name='Air_Algérie' return r1.creationdate limit 8"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为forum,属性title='Group for Nawaz_Sharif in Cali'的节点\nlabel为organisation,属性name='Air_Go_Airlines'的节点\nlabel为organisation,属性name='Khalifa_Airways'的节点\nlabel为organisation,属性name='Chabahar_Airlines'的节点\nlabel为tag,属性name='S&M_Airlines'的节点\nlabel为tag,属性name='Saif_Ali_Khan'的节点\nlabel为tag,属性name='Islamic_Courts_Union'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Khalifa_Airways工作的人员的姓氏、位置IP、关系的创建日期、组织名称、组织URL和人员性别，并按组织名称排序",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n2.name='Khalifa_Airways' return n1.lastname, n1.locationip, r1.creationdate, n2.name, n2.url, n1.gender order by n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Joe_Cocker in Galați'的节点\nlabel为forum,属性title='Group for Joseph_Haydn in Solapur'的节点\nlabel为organisation,属性name='Chabahar_Airlines'的节点\nlabel为organisation,属性name='Jagson_Airlines'的节点\nlabel为organisation,属性name='Air_Go_Airlines'的节点\nlabel为place,属性name='Jiaganj_Azimganj'的节点\nlabel为tag,属性name='Searching_for_Jerry_Garcia'的节点\nlabel为tag,属性name='Marc_Jacobs'的节点\nlabel为tag,属性name='Jennifer_Jason_Leigh'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Jacques且在Khalifa Airways工作的人员的相关信息，包括关系的创建日期、组织的id、人员的id、位置IP、电子邮件、性别、浏览器、工作开始时间、组织的网址和人员的语言，按组织名称排序",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n1.firstname='Jacques' and n2.name='Khalifa_Airways' return r1.creationdate, n2.id, n1.id, n1.locationip, n1.email, n2.name, n1.gender, n1.browserused, r1.workfrom, n2.url, n1.language order by n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Andy_Roddick in Ahmedpur_Sial'的节点\nlabel为forum,属性title='Group for Nikolay_Davydenko in Ahmedpur_Sial'的节点\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为organisation,属性name='Maulana_Azad_College'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Institute_of_Hotel_Management,_Hyderabad'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Addis_Ababa'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\nlabel为tag,属性name='Hyder_Ali'的节点\nlabel为tag,属性name='Adil_Shahi_dynasty'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为André的人在Khalifa Airways工作的组织的id",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n1.firstname='André' and n2.name='Khalifa_Airways' return n2.id"
    }
]