[
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Swiss_German_University'的节点\nlabel为organisation,属性name='Explora_Italia'的节点\nlabel为organisation,属性name='Centre_Européen_de_Recherches_Internationales_et_Stratégiques'的节点\nlabel为place,属性name='Freiburg_im_Breisgau'的节点\nlabel为tag,属性name='Austrian_Silesia'的节点\nlabel为tag,属性name='Serbia_and_Montenegro'的节点\nlabel为tag,属性name='German_East_Africa'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找属于欧洲的瑞士的地方id和网址，限制返回9条结果",
        "output": "match (n1:place)-[r1:ispartof]->(n2:place)  where n2.name='Europe' and n1.name='Switzerland' return n1.id, n1.url limit 9"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Mahmud_of_Ghazni in Raniganj'的节点\nlabel为organisation,属性name='Regional_Air_Services_(Tanzania)'的节点\nlabel为organisation,属性name='Turkuaz_Airlines'的节点\nlabel为organisation,属性name='Thaksin_University'的节点\nlabel为place,属性name='Jiaganj_Azimganj'的节点\nlabel为place,属性name='Sahiwal_Division'的节点\nlabel为place,属性name='Pathum_Thani_Province'的节点\nlabel为tag,属性name='Dil_Dil_Pakistan'的节点\nlabel为tag,属性name='Bal_Gangadhar_Tilak'的节点\nlabel为tag,属性name='Iraqi_Kurdistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Tajikistan所属的地区名称、Tajikistan的id、该地区的id以及Tajikistan的URL，并按地区名称降序排列",
        "output": "match (n1:place)-[r1:ispartof]->(n2:place)  where n2.name='Asia' and n1.name='Tajikistan' return n2.name, n1.id, n2.id, n1.url order by n2.name desc"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Nicaragüense_de_Aviación'的节点\nlabel为organisation,属性name='Nordeste_Linhas_Aéreas_Regionais'的节点\nlabel为organisation,属性name='Universidad_Anáhuac_México_Norte'的节点\nlabel为place,属性name='South_America'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为place,属性name='North_America'的节点\nlabel为tag,属性name='Spanish_East_Indies'的节点\nlabel为tag,属性name='South_Pacific_Mandate'的节点\nlabel为tag,属性name='Search_for_the_New_Land'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找属于南美洲的地方名称",
        "output": "match (n1:place)-[r1:ispartof]->(n2:place)  where n2.name='South_America' return n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Hillary_Rodham_Clinton in North_Wales'的节点\nlabel为forum,属性title='Group for Brian_Wilson in Loikaw'的节点\nlabel为forum,属性title='Group for Patrick_Vieira in Insein_Township'的节点\nlabel为organisation,属性name='Northwestern_Visayan_Colleges'的节点\nlabel为organisation,属性name='Walden_University'的节点\nlabel为organisation,属性name='Walden_University'的节点\nlabel为place,属性name='North_Wales'的节点\nlabel为place,属性name='Sittwe_District'的节点\nlabel为tag,属性name='Idlewild_South'的节点\nlabel为tag,属性name='Illyrian_Provinces'的节点\nlabel为tag,属性name='Jimmy_Wales'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Wales所属的地区的id",
        "output": "match (n1:place)-[r1:ispartof]->(n2:place)  where n1.name='Wales' return n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Heinz_Guderian in Dire_Dawa'的节点\nlabel为forum,属性title='Group for Heinz_Guderian in Dire_Dawa'的节点\nlabel为forum,属性title='Group for Heinz_Guderian in Dire_Dawa'的节点\nlabel为organisation,属性name='Swiss_German_University'的节点\nlabel为organisation,属性name='German_School_of_Athens'的节点\nlabel为organisation,属性name='German-Jordanian_University'的节点\nlabel为place,属性name='Freiburg_im_Breisgau'的节点\nlabel为tag,属性name='Allied-occupied_Germany'的节点\nlabel为tag,属性name='North_German_Confederation'的节点\nlabel为tag,属性name='East_Germany'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找德国的URL、ID和名称，以及它所属的上级地区的ID",
        "output": "match (n1:place)-[r1:ispartof]->(n2:place)  where n1.name='Germany' return n1.url, n1.id, n1.name, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Link_Campus_University'的节点\nlabel为organisation,属性name='Sam_Ratulangi_University'的节点\nlabel为tag,属性name='Crazy_Train'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Highway_61_Revisited'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n跳过16个结果，限制返回20个结果，查找类型为Person的标签类的URL，以及对应的标签名称和ID",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n2.name='Person' return n2.url, n1.name, n1.id skip 16 limit 20"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Mahmud_of_Ghazni in Raniganj'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为organisation,属性name='Michael_Madhusudan_Memorial_College'的节点\nlabel为organisation,属性name='Shahid_Madani_University_Of_Azarbaijan'的节点\nlabel为organisation,属性name='Mohammad_Ali_Jinnah_University'的节点\nlabel为place,属性name='Jiaganj_Azimganj'的节点\nlabel为tag,属性name='Mahmud_of_Ghazni'的节点\nlabel为tag,属性name='Azad_Hind'的节点\nlabel为tag,属性name='Idrisid_dynasty'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Mahmud_of_Ghazni且属于Monarch类别的标签的id",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n2.name='Monarch' and n1.name='Mahmud_of_Ghazni' return n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 11 of Amjad Islam Ahsan'的节点\nlabel为organisation,属性name='Wafaq_ul_Madaris_Al-Arabia,_Pakistan'的节点\nlabel为organisation,属性name='Textile_Institute_of_Pakistan'的节点\nlabel为organisation,属性name='Islamic_Azad_University_of_Shiraz'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Addis_Ababa'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='United_Arab_Emirates'的节点\nlabel为tag,属性name='Ahab_the_Arab'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Abbas I of Persia所属的标签类别，返回这些标签类别的名称、id和URL，以及Abbas I of Persia的id、名称和URL，并按标签类别名称排序，限制返回结果为10条。",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n1.name='Abbas_I_of_Persia' return n1.url, n2.name, n2.id, n1.id, n2.url, n1.name order by n2.name limit 10"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Hannan_University'的节点\nlabel为organisation,属性name='Cloudman_Hall'的节点\nlabel为organisation,属性name='Huron_University_College'的节点\nlabel为place,属性name='Pyin_U_Lwin'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Goon_Affiliated'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Humayun的标签及其所属的标签类别的名称，Humayun的id和url",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n1.name='Humayun' return n1.name, n2.name, n1.id, n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为organisation,属性name='Jamal_Mohamed_College'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Sindh_Madrasatul_Islam'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为place,属性name='Sahiwal_Division'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Mohammed_Zahir_Shah'的节点\nlabel为tag,属性name='Naseeruddin_Shah'的节点\nlabel为tag,属性name='Khalid_Sheikh_Mohammed'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Mohammed_Zahir_Shah的标签及其属于的名为BritishRoyalty的标签类的URL信息",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n1.name='Mohammed_Zahir_Shah' and n2.name='BritishRoyalty' return n1.url, n2.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Augustine_of_Hippo in Dazhou'的节点\nlabel为organisation,属性name='Josefina_H._Cerilles_Polytechnic_College'的节点\nlabel为organisation,属性name='Izumi_Junior_College'的节点\nlabel为organisation,属性name='Gabriel_Dumont_Institute'的节点\nlabel为tag,属性name='Augustine_of_Hippo'的节点\nlabel为tag,属性name='Iparhi_Agapi_Edo'的节点\nlabel为tag,属性name='Ayyubid_dynasty'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Augustine_of_Hippo所属的标签类别的名称和id，同时返回Augustine_of_Hippo的名称和id",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n1.name='Augustine_of_Hippo' return n1.name, n2.name, n2.id, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Thomas_G._Carpenter_Library'的节点\nlabel为organisation,属性name='McMaster_Arts_and_Science'的节点\nlabel为organisation,属性name='Debre_Markos_University'的节点\nlabel为tag,属性name='Albert_Camus'的节点\nlabel为tag,属性name='Carl_Friedrich_Gauss'的节点\nlabel为tag,属性name='Carl_Philipp_Emanuel_Bach'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Albert Camus的标签，其类型为Philosopher的名称",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n2.name='Philosopher' and n1.name='Albert_Camus' return n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Strawberry_Letter_23'的节点\nlabel为tag,属性name='Price_Tag'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与Writer类型相关的标签的url，最多返回11个结果",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n2.name='Writer' return n2.url limit 11"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='José_Rizal_University'的节点\nlabel为organisation,属性name='Garcia_College_of_Technology'的节点\nlabel为organisation,属性name='Sergio_Arboleda_University'的节点\nlabel为place,属性name='San_Pedro_Garza_García'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为tag,属性name='Juan_Ignacio_Chela'的节点\nlabel为tag,属性name='Miguel_Hidalgo_y_Costilla'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找标签Che Guevara的URL、名称、ID及其所属的标签类的ID、名称和URL，其中标签类的名称为Person",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n2.name='Person' and n1.name='Che_Guevara' return n1.url, n1.name, n2.id, n2.name, n2.url, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Servicio_de_Publicaciones'的节点\nlabel为organisation,属性name='José_Rizal_University'的节点\nlabel为organisation,属性name='Paul_Cézanne_University'的节点\nlabel为tag,属性name='Juan_Perón'的节点\nlabel为tag,属性name='Juan_Martín_del_Potro'的节点\nlabel为tag,属性name='Juan_Pablo_Montoya'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与Juan_Perón相关的标签类别的名称、id和URL，并按类别名称排序",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n1.name='Juan_Perón' return n2.name, n2.id, n2.url order by n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Link_Campus_University'的节点\nlabel为organisation,属性name='SDA_Bocconi_School_of_Management'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tagclass,属性name='SoccerManager'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找SoccerManager标签类的名称、相关标签的URL以及它们的ID信息",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n2.name='SoccerManager' return n2.name, n1.url, n2.id, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Link_Campus_University'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找TennisPlayer标签类对应的标签的url和该标签类的id",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n2.name='TennisPlayer' return n2.id, n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Nikolay_Davydenko in Ahmedpur_Sial'的节点\nlabel为forum,属性title='Group for Neil_Diamond in Bhagalpur'的节点\nlabel为forum,属性title='Group for Lindsay_Davenport in Ahmedpur_Sial'的节点\nlabel为organisation,属性name='Daniel_Payne_College'的节点\nlabel为organisation,属性name='Gabriel_Dumont_Institute'的节点\nlabel为organisation,属性name='Duncan_Hall'的节点\nlabel为tag,属性name='David_Nalbandian'的节点\nlabel为tag,属性name='David_Banner'的节点\nlabel为tag,属性name='Damon_Albarn'的节点\nlabel为tagclass,属性name='GridironFootballPlayer'的节点\nlabel为tagclass,属性name='SportsTeamMember'的节点\nlabel为tagclass,属性name='TennisPlayer'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为David_Nalbandian的标签及其所属的TennisPlayer分类的id和名称",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n1.name='David_Nalbandian' and n2.name='TennisPlayer' return n1.name, n2.id, n1.id, n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Link_Campus_University'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找TennisPlayer标签类及其关联的标签的id、url和名称，同时返回TennisPlayer的id和url。",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n2.name='TennisPlayer' return n2.id, n1.url, n2.url, n1.id, n2.name, n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='De_La_Salle_John_Bosco_College'的节点\nlabel为organisation,属性name='Cologne_Business_School'的节点\nlabel为organisation,属性name='John_Molson_School_of_Business'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='José_de_San_Martín'的节点\nlabel为tag,属性name='Price_Tag'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找标签类别为OfficeHolder且标签名称为José_de_San_Martín的标签URL、标签类别ID、标签名称和标签类别URL",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n2.name='OfficeHolder' and n1.name='José_de_San_Martín' return n1.url, n2.id, n1.name, n2.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Name_of_the_Game'的节点\nlabel为tag,属性name='The_Name_of_the_Game'的节点\nlabel为tag,属性name='Tie_Me_Kangaroo_Down,_Sport'的节点\nlabel为tagclass,属性name='SportsTeamMember'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找属于TennisPlayer类别的标签的名称和id，限制返回一条记录，并返回TennisPlayer的名称和id",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n2.name='TennisPlayer' return n2.name, n2.id, n1.name limit 1"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Gol_Transportes_Aéreos'的节点\nlabel为organisation,属性name='Georgia_Tech_Alumni_Association'的节点\nlabel为organisation,属性name='Gachongil_College'的节点\nlabel为place,属性name='Campos_dos_Goytacazes'的节点\nlabel为tag,属性name='Goon_Affiliated'的节点\nlabel为tag,属性name='Ghetto_Musick_Prototype'的节点\nlabel为tag,属性name='Gastón_Gaudio'的节点\nlabel为tagclass,属性name='GridironFootballPlayer'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找TennisPlayer类别下的Gastón_Gaudio标签的信息，返回类别id、类别名称、类别URL、标签名称和标签id，并按类别名称降序排列",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n2.name='TennisPlayer' and n1.name='Gastón_Gaudio' return n2.id, n2.name, n2.url, n1.name, n1.id order by n2.name desc"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Tie_Me_Kangaroo_Down,_Sport'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找所有属于TennisPlayer类别的标签的id、名称，并返回这些标签的类别url和id，结果按标签名称排序",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n2.name='TennisPlayer' return n2.url, n2.id, n1.id, n1.name order by n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='20_Jazz_Funk_Greats'的节点\nlabel为tag,属性name='Radio_Disney_Jams_series'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找类型为TennisPlayer的标签类别的id，最多返回20个结果",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n2.name='TennisPlayer' return n2.id limit 20"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tagclass,属性name='GridironFootballPlayer'的节点\nlabel为tagclass,属性name='TennisPlayer'的节点\nlabel为tagclass,属性name='SportsTeamMember'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找TennisPlayer标签类的id",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n2.name='TennisPlayer' return n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Jorge_Tadeo_Lozano_University'的节点\nlabel为organisation,属性name='Andres_Soriano_College'的节点\nlabel为organisation,属性name='Jean_Moulin_University_Lyon_3'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Juan_Manuel_Fangio'的节点\nlabel为tag,属性name='Tie_Me_Kangaroo_Down,_Sport'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找标签类别为TennisPlayer且标签名称为Juan_Mónaco的标签id，以及该标签类别的url、id和名称",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n2.name='TennisPlayer' and n1.name='Juan_Mónaco' return n1.id, n2.url, n2.id, n2.name, n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='DG_Vaishnav_College'的节点\nlabel为organisation,属性name='Link_Campus_University'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找类别为President的所有标签的url、类别名称和标签名称，并按标签名称排序",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n2.name='President' return n2.id, n1.url, n2.name, n1.name order by n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Spike_Lee in Debre_Marqos'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为organisation,属性name='Lorenzo_de'_Medici_School'的节点\nlabel为organisation,属性name='Lorenzo_de'_Medici_School'的节点\nlabel为organisation,属性name='Lorenzo_de'_Medici_School'的节点\nlabel为place,属性name='Chorrillos_District'的节点\nlabel为tag,属性name='Lionel_Messi'的节点\nlabel为tag,属性name='John_Le_Mesurier'的节点\nlabel为tag,属性name='Sergio_Leone'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Lionel_Messi的标签及其所属的SoccerPlayer类别，返回Lionel_Messi的id、名称、URL，以及SoccerPlayer类别的URL、id和名称，并按Lionel_Messi的名称排序",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n1.name='Lionel_Messi' and n2.name='SoccerPlayer' return n1.id, n1.name, n2.url, n1.url, n2.id, n2.name order by n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Music_Industry_Arts'的节点\nlabel为organisation,属性name='Yale_School_of_Music'的节点\nlabel为organisation,属性name='Link_Campus_University'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Punk_Goes_Classic_Rock'的节点\nlabel为tag,属性name='Ghetto_Musick_Prototype'的节点\nlabel为tagclass,属性name='MusicalArtist'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为MusicalArtist的标签类的URL及其关联的标签的URL",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n2.name='MusicalArtist' return n2.url, n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Néstor_Kirchner'的节点\nlabel为tag,属性name='Menachem_Mendel_Schneerson'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Néstor Kirchner所属的标签类别的名称，仅返回一个结果",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n1.name='Néstor_Kirchner' return n2.name limit 1"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Jorge_Tadeo_Lozano_University'的节点\nlabel为organisation,属性name='De_La_Salle_John_Bosco_College'的节点\nlabel为organisation,属性name='Jorge_Amado_University_Center'的节点\nlabel为place,属性name='Pinar_del_Río'的节点\nlabel为place,属性name='Chorrillos_District'的节点\nlabel为place,属性name='João_Monlevade'的节点\nlabel为tag,属性name='Juan_Martín_del_Potro'的节点\nlabel为tag,属性name='Benicio_del_Toro'的节点\nlabel为tag,属性name='Juan_Pablo_Montoya'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Juan_Martín_del_Potro所属的标签类别的URL和名称，以及Juan_Martín_del_Potro的URL和id",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n1.name='Juan_Martín_del_Potro' return n2.url, n2.name, n1.url, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for John_Lennon in Chaozhou'的节点\nlabel为organisation,属性name='John_Glenn_School_of_Public_Affairs'的节点\nlabel为organisation,属性name='Norwegian_School_of_Sport_Sciences'的节点\nlabel为organisation,属性name='Jan_Van_Eyck_Academie'的节点\nlabel为tag,属性name='Jonathan_Erlich'的节点\nlabel为tag,属性name='Jacco_Eltingh'的节点\nlabel为tag,属性name='Name_of_the_Game'的节点\nlabel为tagclass,属性name='TennisPlayer'的节点\nlabel为tagclass,属性name='SportsTeamMember'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Jonathan_Erlich的标签所属的类别名称，类别为TennisPlayer",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n1.name='Jonathan_Erlich' and n2.name='TennisPlayer' return n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 6 of Natalia Barbu Codreanu'的节点\nlabel为organisation,属性name='Sam_Ratulangi_University'的节点\nlabel为organisation,属性name='Jose_Maria_Agurrie_T9'的节点\nlabel为organisation,属性name='Basanti_Devi_College'的节点\nlabel为place,属性name='Birni_Nkonni'的节点\nlabel为tag,属性name='Gabriela_Sabatini'的节点\nlabel为tag,属性name='Name_of_the_Game'的节点\nlabel为tag,属性name='The_Name_of_the_Game'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Gabriela_Sabatini且类型为TennisPlayer的标签名称，并按名称降序排列，返回前6个结果",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n1.name='Gabriela_Sabatini' and n2.name='TennisPlayer' return n1.name order by n1.name desc limit 6"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='UCLA_School_of_Nursing'的节点\nlabel为organisation,属性name='UCLA_School_of_Public_Affairs'的节点\nlabel为organisation,属性name='Ramon_Llull_University'的节点\nlabel为place,属性name='Larkana_District'的节点\nlabel为tag,属性name='Lucas_Arnold_Ker'的节点\nlabel为tag,属性name='Rufus_Does_Judy_at_Carnegie_Hall'的节点\nlabel为tag,属性name='Tie_Me_Kangaroo_Down,_Sport'的节点\nlabel为tagclass,属性name='SportsTeamMember'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Lucas_Arnold_Ker且属于TennisPlayer类别的标签的URL和名称",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n1.name='Lucas_Arnold_Ker' and n2.name='TennisPlayer' return n1.url, n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Link_Campus_University'的节点\nlabel为organisation,属性name='Fergusson_College'的节点\nlabel为organisation,属性name='Tulane_University_Law_School'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Get_Ur_Freak_On'的节点\nlabel为tag,属性name='Price_Tag'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为FormulaOneRacer的标签类的URL",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n2.name='FormulaOneRacer' return n2.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Josefina_H._Cerilles_Polytechnic_College'的节点\nlabel为organisation,属性name='Carl_H._Lindner_College_of_Business'的节点\nlabel为organisation,属性name='Rafael_Belloso_Chacin_University'的节点\nlabel为tag,属性name='Cristina_Fernández_de_Kirchner'的节点\nlabel为tag,属性name='Tristan_da_Cunha'的节点\nlabel为tag,属性name='Maria_Elena_Camerin'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找标签Cristina_Fernández_de_Kirchner的URL、ID和名称，以及其所属的标签类OfficeHolder的URL、ID和名称",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n2.name='OfficeHolder' and n1.name='Cristina_Fernández_de_Kirchner' return n1.url, n2.name, n1.id, n2.url, n2.id, n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Korea_National_Sport_University'的节点\nlabel为organisation,属性name='Texas_Tech_University'的节点\nlabel为organisation,属性name='Golf_Academy_of_America'的节点\nlabel为tag,属性name='Tie_Me_Kangaroo_Down,_Sport'的节点\nlabel为tag,属性name='Ten_Cents_a_Dance'的节点\nlabel为tag,属性name='Nine_Flags'的节点\nlabel为tagclass,属性name='SportsTeamMember'的节点\nlabel为tagclass,属性name='TennisPlayer'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n跳过前9个，查找属于TennisPlayer类别的标签的名称，类别URL，类别名称和类别ID，限制返回10条结果",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n2.name='TennisPlayer' return n1.name, n2.url, n2.name, n2.id skip 9 limit 10"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Paul_Newman in Santiago_de_Cuba'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为organisation,属性name='Diego_Portales_University'的节点\nlabel为organisation,属性name='Rafael_Belloso_Chacin_University'的节点\nlabel为organisation,属性name='Unidad_Académica_Campesina-Carmen_Pampa'的节点\nlabel为place,属性name='Chorrillos_District'的节点\nlabel为place,属性name='Campos_dos_Goytacazes'的节点\nlabel为tag,属性name='Paulinho_da_Costa'的节点\nlabel为tag,属性name='Return_of_the_Champions'的节点\nlabel为tag,属性name='Tie_Me_Kangaroo_Down,_Sport'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Pablo_Cuevas的标签及其所属的TennisPlayer类别，返回Pablo_Cuevas的名称和id，以及TennisPlayer类别的id、名称和url，限制返回20条结果",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n1.name='Pablo_Cuevas' and n2.name='TennisPlayer' return n1.name, n2.id, n2.name, n1.id, n2.url limit 20"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找TennisPlayer类型标签的名称、id、URL以及其子标签的名称、id和URL",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n2.name='TennisPlayer' return n1.name, n2.id, n2.url, n1.url, n1.id, n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为organisation,属性name='German_Sport_University_Cologne'的节点\nlabel为organisation,属性name='Georgia_Tech_Alumni_Association'的节点\nlabel为organisation,属性name='UCLA_School_of_Public_Affairs'的节点\nlabel为tag,属性name='Tie_Me_Kangaroo_Down,_Sport'的节点\nlabel为tag,属性name='Tha_Hall_of_Game'的节点\nlabel为tag,属性name='Paulinho_da_Costa'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Guillermo Coria的标签属于的TennisPlayer类别的URL",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n1.name='Guillermo_Coria' and n2.name='TennisPlayer' return n2.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Andres_Soriano_College'的节点\nlabel为organisation,属性name='Servicio_de_Publicaciones'的节点\nlabel为organisation,属性name='De_La_Salle_John_Bosco_College'的节点\nlabel为tag,属性name='Juan_Manuel_de_Rosas'的节点\nlabel为tag,属性name='Juan_Martín_del_Potro'的节点\nlabel为tag,属性name='Juan_Pablo_Montoya'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Juan Manuel de Rosas的标签及其所属的类别OfficeHolder的URL、标签的URL、标签的id和类别的名称",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n2.name='OfficeHolder' and n1.name='Juan_Manuel_de_Rosas' return n2.url, n1.url, n1.id, n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Luiz_Inácio_Lula_da_Silva in Rio_de_Janeiro'的节点\nlabel为organisation,属性name='Rafael_Belloso_Chacin_University'的节点\nlabel为organisation,属性name='Jorge_Tadeo_Lozano_University'的节点\nlabel为organisation,属性name='Diego_Portales_University'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为tag,属性name='Sergio_Casal'的节点\nlabel为tag,属性name='Martín_Vassallo_Argüello'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Carlos_Tévez的标签及其类型为SoccerPlayer的标签类的信息，返回Carlos_Tévez的URL和id，以及SoccerPlayer的名称、URL和id。",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n1.name='Carlos_Tévez' and n2.name='SoccerPlayer' return n1.url, n1.id, n2.name, n2.url, n1.name, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Link_Campus_University'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找类型为SoccerPlayer的标签类的URL，以及与之关联的标签的id和名称，同时返回SoccerPlayer的id和名称",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n2.name='SoccerPlayer' return n2.url, n1.id, n2.id, n2.name, n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Manuela_Beltrán_University'的节点\nlabel为organisation,属性name='Paul_Cézanne_University'的节点\nlabel为organisation,属性name='Servicio_de_Publicaciones'的节点\nlabel为tag,属性name='Eva_Perón'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Dion_chante_Plamondon'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找标签Eva Perón所属的标签类别信息，包括Eva Perón的id、标签类别的url和id",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n2.name='President' and n1.name='Eva_Perón' return n1.name, n2.url, n2.id, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Heinz_Guderian in Dire_Dawa'的节点\nlabel为forum,属性title='Group for Heinz_Guderian in Dire_Dawa'的节点\nlabel为forum,属性title='Group for Heinz_Guderian in Dire_Dawa'的节点\nlabel为organisation,属性name='Music_Industry_Arts'的节点\nlabel为organisation,属性name='Blair_School_of_Music'的节点\nlabel为organisation,属性name='VanderCook_College_of_Music'的节点\nlabel为place,属性name='Chorrillos_District'的节点\nlabel为tag,属性name='Chris_de_Burgh'的节点\nlabel为tag,属性name='Gangsta_Grillz:_The_Album'的节点\nlabel为tag,属性name='Glenn_Danzig'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Chris de Burgh所属的MusicalArtist类别的id、名称、URL以及类别名称和标签id",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n1.name='Chris_de_Burgh' and n2.name='MusicalArtist' return n2.id, n1.name, n1.url, n2.name, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Link_Campus_University'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Name_of_the_Game'的节点\nlabel为tag,属性name='Tie_Me_Kangaroo_Down,_Sport'的节点\nlabel为tagclass,属性name='SportsTeamMember'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找属于TennisPlayer类别的标签名称及其对应的类别URL和类别ID",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n2.name='TennisPlayer' return n1.name, n2.url, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找TennisPlayer类型标签的url、名称和id，以及与之关联的标签的url、名称和id",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n2.name='TennisPlayer' return n2.url, n1.url, n1.name, n2.name, n2.id, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='José_Rizal_University'的节点\nlabel为organisation,属性name='Rafael_Belloso_Chacin_University'的节点\nlabel为organisation,属性name='Jorge_Tadeo_Lozano_University'的节点\nlabel为place,属性name='Chorrillos_District'的节点\nlabel为tag,属性name='Horacio_Zeballos'的节点\nlabel为tag,属性name='José_Luis_Rodríguez_Zapatero'的节点\nlabel为tag,属性name='Zsa_Zsa_Gabor'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Horacio_Zeballos所属的标签类别的url和id",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n1.name='Horacio_Zeballos' return n2.url, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Center_for_Public_Leadership'的节点\nlabel为organisation,属性name='International_Leadership_Institute'的节点\nlabel为tag,属性name='Osama_bin_Laden'的节点\nlabel为tag,属性name='Presidency_of_Ronald_Reagan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找类型为President的标签的id和名称",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n2.name='President' return n1.id, n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Nikolay_Davydenko in Ahmedpur_Sial'的节点\nlabel为organisation,属性name='Dublin_Business_School'的节点\nlabel为organisation,属性name='Burdwan_Raj_College'的节点\nlabel为organisation,属性name='Daniel_Payne_College'的节点\nlabel为tag,属性name='Brian_Dabul'的节点\nlabel为tag,属性name='Bob_Dylan_at_Budokan'的节点\nlabel为tag,属性name='Bobby_Darin'的节点\nlabel为tagclass,属性name='GridironFootballPlayer'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Brian_Dabul的标签所属的TennisPlayer类别信息的id和该标签的URL",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n1.name='Brian_Dabul' and n2.name='TennisPlayer' return n2.id, n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Rafael_Nadal in Visonta'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为organisation,属性name='Narasinha_Dutt_College'的节点\nlabel为organisation,属性name='TEAM_Linhas_Aéreas'的节点\nlabel为organisation,属性name='La_Fortuna_College'的节点\nlabel为tag,属性name='Florencia_Labat'的节点\nlabel为tag,属性name='Leon_Battista_Alberti'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Florencia Labat的标签信息的id、名称和URL，以及其所属的TennisPlayer类别信息的名称和URL",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n2.name='TennisPlayer' and n1.name='Florencia_Labat' return n1.id, n1.name, n1.url, n2.name, n2.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Benjamin_Franklin in Vadodara'的节点\nlabel为forum,属性title='Group for Rafael_Nadal in Visonta'的节点\nlabel为organisation,属性name='University_of_North_Florida_Jazz_Department'的节点\nlabel为organisation,属性name='Rivne_Universal_Avia'的节点\nlabel为tag,属性name='Jon_Favreau'的节点\nlabel为tag,属性name='Javier_Frana'的节点\nlabel为tag,属性name='Jane_Fonda'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Javier_Frana的类型名称及其id",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n1.name='Javier_Frana' return n1.id, n2.name"
    }
]