[
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Rafael_Belloso_Chacin_University'的节点\nlabel为organisation,属性name='SDA_Bocconi_School_of_Management'的节点\nlabel为organisation,属性name='Mendoza_College_of_Business'的节点\nlabel为tag,属性name='Manuel_Belgrano'的节点\nlabel为tag,属性name='Gian_Lorenzo_Bernini'的节点\nlabel为tag,属性name='Manon_Bollegraf'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名称为Manuel_Belgrano且属于类别President的标签信息，返回类别URL、类别名称、标签URL、标签ID、类别ID和标签名称，按标签名称排序，限制结果为16条",
        "output": "match (n1:tag)-[r1:hastype]->(n2:tagclass)  where n2.name='President' and n1.name='Manuel_Belgrano' return n2.url, n2.name, n1.url, n1.id, n2.id, n1.name order by n1.name limit 16"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='All_of_Our_Names'的节点\nlabel为tag,属性name='Mother_Father_Brother_Sister'的节点\nlabel为tag,属性name='For_the_Working_Class_Man'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Person的所有子类的名称",
        "output": "match (n1:tagclass)-[r1:issubclassof]->(n2:tagclass)  where n2.name='Person' return n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Regent's_Business_School_London'的节点\nlabel为organisation,属性name='Imperial_College_Business_School'的节点\nlabel为organisation,属性name='Royal_Military_Academy'的节点\nlabel为tag,属性name='British_Empire'的节点\nlabel为tag,属性name='United_Kingdom_of_Great_Britain_and_Ireland'的节点\nlabel为tag,属性name='Richard_II_of_England'的节点\nlabel为tagclass,属性name='BritishRoyalty'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为BritishRoyalty的标签类属于名为Royalty的标签类的信息，返回Royalty的url、id、名称以及BritishRoyalty的id和url，限制返回结果为2条。",
        "output": "match (n1:tagclass)-[r1:issubclassof]->(n2:tagclass)  where n1.name='BritishRoyalty' and n2.name='Royalty' return n2.url, n2.id, n2.name, n1.id, n1.url limit 2"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Carol_I_National_Defence_University'的节点\nlabel为organisation,属性name='Royal_College_of_Defence_Studies'的节点\nlabel为organisation,属性name='Strathclyde_Law_School'的节点\nlabel为tag,属性name='Respect_My_Conglomerate'的节点\nlabel为tag,属性name='All_of_Our_Names'的节点\nlabel为tag,属性name='As_Cruel_as_School_Children'的节点\nlabel为tagclass,属性name='Royalty'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Person类中名为Royalty的子类的名称，最多返回4个结果",
        "output": "match (n1:tagclass)-[r1:issubclassof]->(n2:tagclass)  where n2.name='Person' and n1.name='Royalty' return n2.name limit 4"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Link_Campus_University'的节点\nlabel为organisation,属性name='Lille_Catholic_University'的节点\nlabel为organisation,属性name='Cardinal_Stritch_University'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Licensed_to_Ill'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Cleric的子类标签的id和Cleric的URL",
        "output": "match (n1:tagclass)-[r1:issubclassof]->(n2:tagclass)  where n2.name='Cleric' return n1.id, n2.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Ida_Scudder_School'的节点\nlabel为organisation,属性name='Link_Campus_University'的节点\nlabel为organisation,属性name='IE_Business_School'的节点\nlabel为tag,属性name='Inhuman_Rampage'的节点\nlabel为tag,属性name='Underclass_Hero'的节点\nlabel为tag,属性name='Osama_bin_Laden'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Person类的子类的名称、URL和id，并返回Person类的id、名称和URL，按Person类的名称排序，跳过前6个结果，限制返回18个结果",
        "output": "match (n1:tagclass)-[r1:issubclassof]->(n2:tagclass)  where n2.name='Person' return n1.name, n1.url, n1.id, n2.id, n2.name, n2.url order by n2.name skip 6 limit 18"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Link_Campus_University'的节点\nlabel为tag,属性name='Pictures_of_Starving_Children_Sell_Records'的节点\nlabel为tag,属性name='Private_Universe'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Person类下的子类信息，包括子类的URL、父类名称、子类ID、子类名称和父类URL，限制返回13条记录",
        "output": "match (n1:tagclass)-[r1:issubclassof]->(n2:tagclass)  where n2.name='Person' return n1.url, n2.name, n1.id, n1.name, n2.url limit 13"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Writer的父类标签类的url、id和名称，并按父类标签类的名称排序，同时返回Writer的url和id",
        "output": "match (n1:tagclass)-[r1:issubclassof]->(n2:tagclass)  where n1.name='Writer' return n1.url, n2.url, n1.id, n2.name, n2.id order by n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Link_Campus_University'的节点\nlabel为organisation,属性name='Music_Industry_Arts'的节点\nlabel为organisation,属性name='Hans_Raj_College'的节点\nlabel为tag,属性name='Grave_Dancers_Union'的节点\nlabel为tag,属性name='Private_Dancer'的节点\nlabel为tag,属性name='Gene_Autry'的节点\nlabel为tagclass,属性name='MartialArtist'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Person类别下的Artist子类别的URL，以及Person的id和名称，Artist的名称",
        "output": "match (n1:tagclass)-[r1:issubclassof]->(n2:tagclass)  where n2.name='Person' and n1.name='Artist' return n1.url, n2.id, n2.name, n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Pendekanti_Law_College'的节点\nlabel为organisation,属性name='DG_Vaishnav_College'的节点\nlabel为organisation,属性name='Barasat_Government_College'的节点\nlabel为tag,属性name='Osama_bin_Laden'的节点\nlabel为tag,属性name='Presidency_of_Ronald_Reagan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为President的标签类及其父类名为Politician的标签类的id、名称和URL信息",
        "output": "match (n1:tagclass)-[r1:issubclassof]->(n2:tagclass)  where n1.name='President' and n2.name='Politician' return n1.id, n2.name, n1.url, n1.name, n2.id, n2.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Pendekanti_Law_College'的节点\nlabel为organisation,属性name='National_Paralegal_College'的节点\nlabel为organisation,属性name='Gerald_R._Ford_School_of_Public_Policy'的节点\nlabel为tag,属性name='Lutka_sa_naslovne_strane'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Politician的标签类的父类Person的URL",
        "output": "match (n1:tagclass)-[r1:issubclassof]->(n2:tagclass)  where n1.name='Politician' and n2.name='Person' return n2.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Desmond_Child'的节点\nlabel为tag,属性name='Daddy_Sang_Bass'的节点\nlabel为tagclass,属性name='TennisPlayer'的节点\nlabel为tagclass,属性name='GridironFootballPlayer'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找TennisPlayer的子类的id",
        "output": "match (n1:tagclass)-[r1:issubclassof]->(n2:tagclass)  where n1.name='TennisPlayer' return n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Palo_Alto_College'的节点\nlabel为tag,属性name='Underclass_Hero'的节点\nlabel为tag,属性name='Gene_Autry'的节点\nlabel为tag,属性name='Working_Class_Hero'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Person的标签类中，名为Athlete的子类所属的父类名称",
        "output": "match (n1:tagclass)-[r1:issubclassof]->(n2:tagclass)  where n2.name='Person' and n1.name='Athlete' return n2.name"
    },
    {
        "instruction": "\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Athlete的所有子类的名称及其父类的id",
        "output": "match (n1:tagclass)-[r1:issubclassof]->(n2:tagclass)  where n2.name='Athlete' return n1.name, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Music_Industry_Arts'的节点\nlabel为organisation,属性name='College_of_Music,_Mahidol_University'的节点\nlabel为organisation,属性name='An_Music_School'的节点\nlabel为tag,属性name='Ghetto_Musick_Prototype'的节点\nlabel为tag,属性name='Music_for_18_Musicians'的节点\nlabel为tag,属性name='Music_Videos_I'的节点\nlabel为tagclass,属性name='MusicalArtist'的节点\nlabel为tagclass,属性name='MartialArtist'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找MusicalArtist作为子类的父类Artist的信息，返回MusicalArtist的id、url、名称以及Artist的id和名称，并按Artist的名称排序",
        "output": "match (n1:tagclass)-[r1:issubclassof]->(n2:tagclass)  where n1.name='MusicalArtist' and n2.name='Artist' return n1.id, n1.url, n1.name, n2.id, n2.name order by n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Ida_Scudder_School'的节点\nlabel为organisation,属性name='Dum_Dum_Motijheel_College'的节点\nlabel为organisation,属性name='Sardar_Patel_University'的节点\nlabel为tag,属性name='Underclass_Hero'的节点\nlabel为tag,属性name='The_Masses_Against_the_Classes'的节点\nlabel为tag,属性name='Runaway_Child,_Running_Wild'的节点\nlabel为tagclass,属性name='FormulaOneRacer'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Athlete的标签类中，子类名为FormulaOneRacer的id，并按Athlete名称降序排列，返回Athlete的名称和子类的id",
        "output": "match (n1:tagclass)-[r1:issubclassof]->(n2:tagclass)  where n2.name='Athlete' and n1.name='FormulaOneRacer' return n2.name, n1.id order by n2.name desc"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='General_Staff_Academy'的节点\nlabel为organisation,属性name='National_Paralegal_College'的节点\nlabel为organisation,属性name='Goldman_School_of_Public_Policy'的节点\nlabel为tag,属性name='Father_of_Mine'的节点\nlabel为tag,属性name='Leader_of_the_Pack'的节点\nlabel为tag,属性name='Working_Class_Hero'的节点\nlabel为tagclass,属性name='PrimeMinister'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为PrimeMinister的标签类属于哪个名为Politician的父类标签，返回父类标签的名称，最多返回3个结果",
        "output": "match (n1:tagclass)-[r1:issubclassof]->(n2:tagclass)  where n2.name='Politician' and n1.name='PrimeMinister' return n2.name limit 3"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Cardinal_Stritch_University'的节点\nlabel为organisation,属性name='Ida_Scudder_School'的节点\nlabel为organisation,属性name='Hogeschool_Gent'的节点\nlabel为tag,属性name='Get_Ur_Freak_On'的节点\nlabel为tag,属性name='Crack_the_Shutters'的节点\nlabel为tag,属性name='Steers_&_Stripes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Cricketer类别的父类别Athlete的url、名称、Cricketer的id、Athlete的id以及Cricketer的url，并按Athlete的名称降序排列",
        "output": "match (n1:tagclass)-[r1:issubclassof]->(n2:tagclass)  where n1.name='Cricketer' and n2.name='Athlete' return n2.url, n2.name, n1.id, n2.id, n1.url order by n2.name desc"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Hogeschool_Gent'的节点\nlabel为organisation,属性name='Gallaudet_University'的节点\nlabel为organisation,属性name='Gachongil_College'的节点\nlabel为tag,属性name='Ghetto_Musick_Prototype'的节点\nlabel为tag,属性name='Geezer_Butler'的节点\nlabel为tag,属性name='Glenn_Hoddle'的节点\nlabel为tagclass,属性name='GridironFootballPlayer'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Athlete类别下的GolfPlayer子类别的URL、名称以及GolfPlayer的id和名称",
        "output": "match (n1:tagclass)-[r1:issubclassof]->(n2:tagclass)  where n2.name='Athlete' and n1.name='GolfPlayer' return n2.url, n2.name, n1.id, n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Music_Industry_Arts'的节点\nlabel为organisation,属性name='Link_Campus_University'的节点\nlabel为organisation,属性name='Paul_Sabatier_University'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='The_Great_Escape_Artist'的节点\nlabel为tag,属性name='UAB_SuperJazz,_Featuring_Ellis_Marsalis'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Artist的子类标签的URL，同时返回Artist的URL，限制返回16条结果",
        "output": "match (n1:tagclass)-[r1:issubclassof]->(n2:tagclass)  where n2.name='Artist' return n1.url, n2.url limit 16"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Škoda_Auto_University'的节点\nlabel为organisation,属性name='Dum_Dum_Motijheel_College'的节点\nlabel为tag,属性name='Bicycle_Race'的节点\nlabel为tag,属性name='Ride_Captain_Ride'的节点\nlabel为tag,属性name='Buyid_dynasty'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Cyclist所属的标签类别的id",
        "output": "match (n1:tagclass)-[r1:issubclassof]->(n2:tagclass)  where n1.name='Cyclist' return n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='DIT_Faculty_of_Science'的节点\nlabel为organisation,属性name='University_of_Applied_Sciences_Trier'的节点\nlabel为organisation,属性name='Andong_Science_College'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Scientist的标签类别的id，限制返回2个结果",
        "output": "match (n1:tagclass)-[r1:issubclassof]->(n2:tagclass)  where n1.name='Scientist' return n1.id limit 2"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Richard_J._Daley_College'的节点\nlabel为organisation,属性name='Ida_Scudder_School'的节点\nlabel为organisation,属性name='Link_Campus_University'的节点\nlabel为tag,属性name='Moves_Like_Jagger'的节点\nlabel为tag,属性name='Jude_Law'的节点\nlabel为tag,属性name='I_Got_Id'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Judge的标签类的id及其父类的url和id",
        "output": "match (n1:tagclass)-[r1:issubclassof]->(n2:tagclass)  where n1.name='Judge' return n1.id, n2.url, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Osama_bin_Laden in Toliara'的节点\nlabel为organisation,属性name='Higher_Education_Army_Institute'的节点\nlabel为organisation,属性name='Defence_Services_Staff_College'的节点\nlabel为organisation,属性name='Army_Medical_College'的节点\nlabel为tag,属性name='War_Child_Presents_Heroes'的节点\nlabel为tag,属性name='Osama_bin_Laden'的节点\nlabel为tag,属性name='Memorial_Address'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找MilitaryPerson类别的id和名称，以及它的父类别Person的url和名称",
        "output": "match (n1:tagclass)-[r1:issubclassof]->(n2:tagclass)  where n1.name='MilitaryPerson' and n2.name='Person' return n1.id, n1.name, n2.url, n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Music_Industry_Arts'的节点\nlabel为organisation,属性name='College_of_Music,_Mahidol_University'的节点\nlabel为organisation,属性name='Dum_Dum_Motijheel_College'的节点\nlabel为tag,属性name='Grave_Dancers_Union'的节点\nlabel为tag,属性name='Arif_Mardin'的节点\nlabel为tag,属性name='Ghetto_Musick_Prototype'的节点\nlabel为tagclass,属性name='MartialArtist'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找MartialArtist所属的Athlete类别的名称和MartialArtist的id，并按类别名称排序",
        "output": "match (n1:tagclass)-[r1:issubclassof]->(n2:tagclass)  where n1.name='MartialArtist' and n2.name='Athlete' return n2.name, n1.id order by n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Music_Industry_Arts'的节点\nlabel为organisation,属性name='Link_Campus_University'的节点\nlabel为organisation,属性name='Obirin_Junior_College'的节点\nlabel为tag,属性name='The_Great_Escape_Artist'的节点\nlabel为tag,属性name='Music_for_18_Musicians'的节点\nlabel为tag,属性name='The_Artist_in_the_Ambulance'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Artist子类的url和id，最多返回12个结果",
        "output": "match (n1:tagclass)-[r1:issubclassof]->(n2:tagclass)  where n2.name='Artist' return n1.url, n1.id limit 12"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Ida_Scudder_School'的节点\nlabel为organisation,属性name='Hachinohe_Junior_College'的节点\nlabel为organisation,属性name='Hogeschool_Gent'的节点\nlabel为tag,属性name='Ike_Turner'的节点\nlabel为tag,属性name='Jagged_Little_Pill_Acoustic'的节点\nlabel为tag,属性name='Eric_Walter_Elst'的节点\nlabel为tagclass,属性name='IceHockeyPlayer'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找IceHockeyPlayer作为子类的Athlete类的id、URL和名称，并按Athlete名称降序排列，同时返回这两个类的URL和名称",
        "output": "match (n1:tagclass)-[r1:issubclassof]->(n2:tagclass)  where n1.name='IceHockeyPlayer' and n2.name='Athlete' return n1.id, n1.url, n1.name, n2.url, n2.name order by n2.name desc"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='USC_School_of_Architecture'的节点\nlabel为organisation,属性name='Faculty_of_Architecture'的节点\nlabel为organisation,属性name='ITU_School_of_Architecture'的节点\nlabel为tag,属性name='Father_of_Mine'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Architect的标签类的父类信息的id和名称，并按父类名称排序",
        "output": "match (n1:tagclass)-[r1:issubclassof]->(n2:tagclass)  where n1.name='Architect' return n1.id, n2.id, n2.name order by n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='PMI_Colleges'的节点\nlabel为organisation,属性name='Pendekanti_Law_College'的节点\nlabel为organisation,属性name='Andrew_Young_School_of_Policy_Studies'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Politician的所有子类的id、URL以及它们自身的id、URL和名称",
        "output": "match (n1:tagclass)-[r1:issubclassof]->(n2:tagclass)  where n2.name='Politician' return n2.id, n2.url, n2.name, n1.url, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Actor的标签类的URL",
        "output": "match (n1:tagclass)-[r1:issubclassof]->(n2:tagclass)  where n1.name='Actor' return n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Campuses_of_Arellano_University'的节点\nlabel为organisation,属性name='Campuses_of_Arellano_University'的节点\nlabel为organisation,属性name='Alliance_Graduate_School'的节点\nlabel为tag,属性name='Adal_Sultanate'的节点\nlabel为tag,属性name='All_of_Our_Names'的节点\nlabel为tag,属性name='Get_Ur_Freak_On'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Athlete的所有子类的URL、名称和ID，同时返回Athlete的名称和ID",
        "output": "match (n1:tagclass)-[r1:issubclassof]->(n2:tagclass)  where n2.name='Athlete' return n1.url, n2.name, n1.name, n2.id, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='DAV_Public_School_Nerul'的节点\nlabel为organisation,属性name='Škoda_Auto_University'的节点\nlabel为organisation,属性name='Junior_College_of_Toyota'的节点\nlabel为tag,属性name='Chasing_Cars'的节点\nlabel为tag,属性name='Ride_Captain_Ride'的节点\nlabel为tag,属性name='Devil_Gate_Drive'的节点\nlabel为tagclass,属性name='NascarDriver'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Athlete类下的NascarDriver子类的名称、URL和ID，并按子类名称排序，同时返回父类的名称和URL",
        "output": "match (n1:tagclass)-[r1:issubclassof]->(n2:tagclass)  where n2.name='Athlete' and n1.name='NascarDriver' return n1.name, n1.url, n1.id, n2.name, n2.url order by n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='University_Sub_Center_Latur'的节点\nlabel为organisation,属性name='Campuses_of_Arellano_University'的节点\nlabel为organisation,属性name='Campuses_of_Arellano_University'的节点\nlabel为tag,属性name='Mighty_ReArranger'的节点\nlabel为tag,属性name='Adal_Sultanate'的节点\nlabel为tag,属性name='Fuck_the_Kids'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Athlete的所有子类，返回这些子类的id、名称和url，以及Athlete的id、名称和url，结果按子类名称降序排列",
        "output": "match (n1:tagclass)-[r1:issubclassof]->(n2:tagclass)  where n2.name='Athlete' return n2.id, n1.name, n1.id, n2.url, n2.name, n1.url order by n1.name desc"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Episcopal_Divinity_School'的节点\nlabel为organisation,属性name='Protestant_Theological_Institute_of_Cluj'的节点\nlabel为organisation,属性name='Lille_Catholic_University'的节点\nlabel为tag,属性name='Bishopric_of_Constance'的节点\nlabel为tag,属性name='Cardinal_Richelieu'的节点\nlabel为tag,属性name='Archbishopric_of_Bremen'的节点\nlabel为tagclass,属性name='ChristianBishop'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找ChristianBishop所属的Cleric类别的URL",
        "output": "match (n1:tagclass)-[r1:issubclassof]->(n2:tagclass)  where n1.name='ChristianBishop' and n2.name='Cleric' return n2.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Pendekanti_Law_College'的节点\nlabel为organisation,属性name='National_Paralegal_College'的节点\nlabel为organisation,属性name='PLM_Graduate_School_of_Law'的节点\nlabel为tag,属性name='Son_of_a_Preacher_Man'的节点\nlabel为tag,属性name='Electoral_Palatinate'的节点\nlabel为tag,属性name='Master_and_Servant'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Politician的标签类中子类名为Senator的父类的名称和URL",
        "output": "match (n1:tagclass)-[r1:issubclassof]->(n2:tagclass)  where n2.name='Politician' and n1.name='Senator' return n2.name, n2.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Link_Campus_University'的节点\nlabel为organisation,属性name='UCLA_School_of_Public_Affairs'的节点\nlabel为organisation,属性name='Obirin_Junior_College'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找属于Organisation类别的子类标签的url和名称，最多返回13个结果",
        "output": "match (n1:tagclass)-[r1:issubclassof]->(n2:tagclass)  where n2.name='Organisation' return n1.url, n1.name limit 13"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Link_Campus_University'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Agent的子类的URL以及这些子类和Agent的ID",
        "output": "match (n1:tagclass)-[r1:issubclassof]->(n2:tagclass)  where n2.name='Agent' return n1.url, n2.id, n1.id"
    },
    {
        "instruction": "\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Athlete的子类标签类别的id和名称，以及父类的id",
        "output": "match (n1:tagclass)-[r1:issubclassof]->(n2:tagclass)  where n2.name='Athlete' return n2.id, n2.name, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='University_of_Florida_Athletic_Association'的节点\nlabel为organisation,属性name='Cornell_100+_MPG_Team'的节点\nlabel为organisation,属性name='Golf_Academy_of_America'的节点\nlabel为tag,属性name='Return_of_the_Champions'的节点\nlabel为tag,属性name='Richard_Brinsley_Sheridan'的节点\nlabel为tag,属性name='The_Last_of_the_Famous_International_Playboys'的节点\nlabel为tagclass,属性name='GridironFootballPlayer'的节点\nlabel为tagclass,属性name='AmericanFootballPlayer'的节点\nlabel为tagclass,属性name='SportsTeamMember'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找GridironFootballPlayer的子类AmericanFootballPlayer的名称、id和url，并按GridironFootballPlayer的名称排序，限制返回结果为10条",
        "output": "match (n1:tagclass)-[r1:issubclassof]->(n2:tagclass)  where n2.name='GridironFootballPlayer' and n1.name='AmericanFootballPlayer' return n2.name, n1.name, n1.id, n2.url, n1.url order by n2.name limit 10"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Link_Campus_University'的节点\nlabel为tag,属性name='Get_Ur_Freak_On'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Athlete这个标签类的子类的url和id",
        "output": "match (n1:tagclass)-[r1:issubclassof]->(n2:tagclass)  where n2.name='Athlete' return n2.url, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='SRM_Nightingale_School'的节点\nlabel为tag,属性name='All_of_Our_Names'的节点\nlabel为tag,属性name='Spitting_Games'的节点\nlabel为tag,属性name='Name_of_the_Game'的节点\nlabel为tagclass,属性name='SnookerPlayer'的节点\nlabel为tagclass,属性name='SnookerChamp'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找SnookerPlayer的所有子类名称，并按名称降序排列",
        "output": "match (n1:tagclass)-[r1:issubclassof]->(n2:tagclass)  where n2.name='SnookerPlayer' return n1.name order by n1.name desc"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Ida_Scudder_School'的节点\nlabel为organisation,属性name='Strathclyde_Law_School'的节点\nlabel为organisation,属性name='SRM_Nightingale_School'的节点\nlabel为tag,属性name='Daddy_Yankee_Mundial'的节点\nlabel为tag,属性name='Spitting_Games'的节点\nlabel为tag,属性name='Fuck_the_Kids'的节点\nlabel为tagclass,属性name='SnookerPlayer'的节点\nlabel为tagclass,属性name='SnookerChamp'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Athlete类别下的SnookerPlayer子类别的id、url、父类名称、子类名称和父类id，并按子类名称降序排列，返回前18个结果",
        "output": "match (n1:tagclass)-[r1:issubclassof]->(n2:tagclass)  where n2.name='Athlete' and n1.name='SnookerPlayer' return n1.id, n1.url, n2.name, n1.name, n2.id order by n1.name desc limit 18"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Andrew_Young_School_of_Policy_Studies'的节点\nlabel为organisation,属性name='PMI_Colleges'的节点\nlabel为organisation,属性name='Pendekanti_Law_College'的节点\nlabel为tag,属性name='Electoral_Palatinate'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找属于Politician类别的子类别信息，包括子类别的id、名称和URL，以及父类别的id、名称和URL，并按子类别名称排序",
        "output": "match (n1:tagclass)-[r1:issubclassof]->(n2:tagclass)  where n2.name='Politician' return n1.id, n2.name, n2.id, n1.name, n2.url, n1.url order by n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='I_Found_Someone'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找类别为Person的子类别Model的id，同时返回Person的id",
        "output": "match (n1:tagclass)-[r1:issubclassof]->(n2:tagclass)  where n2.name='Person' and n1.name='Model' return n1.id, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Faculty_of_Humanities'的节点\nlabel为organisation,属性name='Patricia_Stevens_College'的节点\nlabel为organisation,属性name='General_Staff_Academy'的节点\nlabel为tag,属性name='Man_of_Colours'的节点\nlabel为tag,属性name='Psyence_Fiction'的节点\nlabel为tag,属性name='I_Got_a_Name'的节点\nlabel为tagclass,属性name='FictionalCharacter'的节点\nlabel为tagclass,属性name='ComicsCharacter'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Person类下的FictionalCharacter类的名称",
        "output": "match (n1:tagclass)-[r1:issubclassof]->(n2:tagclass)  where n2.name='Person' and n1.name='FictionalCharacter' return n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Link_Campus_University'的节点\nlabel为organisation,属性name='Ida_Scudder_School'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Person的所有子类的id、url和名称，限制返回2个结果",
        "output": "match (n1:tagclass)-[r1:issubclassof]->(n2:tagclass)  where n2.name='Person' return n2.id, n1.id, n1.url, n1.name limit 2"
    }
]