[
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Joseph_Stalin in Bijie'的节点\nlabel为organisation,属性name='Iligan_Medical_Center_College'的节点\nlabel为organisation,属性name='Jain_Institute_of_Technology'的节点\nlabel为organisation,属性name='St._Michael's_College,_Iligan_City'的节点\nlabel为place,属性name='Pyin_U_Lwin'的节点\nlabel为tag,属性name='Jennifer_Jason_Leigh'的节点\nlabel为tag,属性name='John_Isner'的节点\nlabel为tag,属性name='Jean_Auguste_Dominique_Ingres'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Iligan居住且名为Juan的人使用的浏览器、Iligan的名字、Juan的名和生日",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n2.name='Iligan' and n1.firstname='Juan' return n1.browserused, n2.name, n1.firstname, n1.birthday"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Wall of Emperor of Brazil Nascimento'的节点\nlabel为forum,属性title='Wall of Emperor of Brazil Santos'的节点\nlabel为forum,属性title='Wall of Emperor of Brazil Souza'的节点\nlabel为organisation,属性name='Rafael_Belloso_Chacin_University'的节点\nlabel为organisation,属性name='Simón_Bolívar_University'的节点\nlabel为organisation,属性name='Adolfo_Ibáñez_University'的节点\nlabel为place,属性name='Presidencia_Roque_Sáenz_Peña'的节点\nlabel为place,属性name='Freiburg_im_Breisgau'的节点\nlabel为place,属性name='Pedro_Escobedo'的节点\nlabel为tag,属性name='Pedro_I_of_Brazil'的节点\nlabel为tag,属性name='Brazilian_military_government'的节点\nlabel为tag,属性name='John_VI_of_Portugal'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Hossein认识的名为Emperor of Brazil的人的电子邮件和位置IP",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n2.firstname='Emperor of Brazil' and n1.firstname='Hossein' return n2.email, n2.locationip"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Chris_Sabin'的节点\nlabel为tag,属性name='Cheri,_Cheri_Lady'的节点\nlabel为tag,属性name='Chris_Claremont'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与Chris认识的人的性别、使用的浏览器、生日、语言、IP地址、创建日期、姓氏、ID以及Chris的生日、使用的浏览器、创建日期、姓氏、ID和名字",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n2.firstname='Chris' return n1.gender, n1.browserused, n2.birthday, n1.language, n1.locationip, n2.creationdate, n2.lastname, n2.id, n2.browserused, n1.id, n1.birthday, n1.firstname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='K_L_University'的节点\nlabel为tag,属性name='Ken_Schrader'的节点\nlabel为tag,属性name='Kim_Wilde'的节点\nlabel为tag,属性name='John_Knox'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与名为K.的人相识的人的信息，包括他们的IP地址、ID、语言、电子邮件、关系的创建日期、浏览器使用情况、性别、生日、姓氏、创建日期和名字，最多返回9条记录。",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n2.firstname='K.' return n2.locationip, n2.id, n1.language, n2.email, r1.creationdate, n1.email, n1.id, n1.locationip, n2.browserused, n1.gender, n2.birthday, n2.language, n2.lastname, n1.browserused, n2.creationdate, n1.firstname limit 9"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Robert_Louis_Stevenson in Poznań'的节点\nlabel为forum,属性title='Wall of Jose Alonso'的节点\nlabel为organisation,属性name='Andres_Soriano_College'的节点\nlabel为organisation,属性name='Aerolloyd_Iguassu'的节点\nlabel为organisation,属性name='Fred_Olsen_Air_Transport'的节点\nlabel为tag,属性name='Fernando_Alonso'的节点\nlabel为tag,属性name='Hans_Christian_Andersen'的节点\nlabel为tag,属性name='Almas_del_Silencio'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Hossein认识的人中名字为Alfonso的人的名字",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n2.firstname='Alfonso' and n1.firstname='Hossein' return n2.firstname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='York_St_John_University'的节点\nlabel为organisation,属性name='Jackson_School_of_Geosciences'的节点\nlabel为organisation,属性name='Jackson_Junior_High_School'的节点\nlabel为tag,属性name='Joseph_E._Johnston'的节点\nlabel为tag,属性name='James_Horner'的节点\nlabel为tag,属性name='Jesse_Jackson'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Hossein的人认识的名为Jorge的人的信息，包括Hossein的邮箱、浏览器使用情况、位置IP、生日、性别、ID，以及Jorge的姓氏、位置IP、创建日期，还有他们之间关系的创建日期，限制返回13条记录。",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n1.firstname='Hossein' and n2.firstname='Jorge' return n1.email, n1.browserused, n2.lastname, r1.creationdate, n1.id, n1.gender, n2.firstname, n1.locationip, n2.locationip, n1.birthday, n2.creationdate limit 13"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Imam_Sadiq_University'的节点\nlabel为organisation,属性name='Shah_Abdul_Latif_University'的节点\nlabel为person,属性firstname='Salim Ahmed'的节点\nlabel为person,属性firstname='Ahmed'的节点\nlabel为person,属性firstname='Ahmed'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Fatehgarh_Sahib'的节点\nlabel为tag,属性name='Saif_Ali_Khan'的节点\nlabel为tag,属性name='Mohammed_Zahir_Shah'的节点\nlabel为tag,属性name='Abdus_Salam'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找认识Salim Ahmed的人的IP地址、名字、性别以及Salim Ahmed的性别和创建日期",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n2.firstname='Salim Ahmed' return n1.locationip, n1.firstname, n1.gender, n2.gender, n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为forum,属性title='Group for Mustafa_Kemal_Atatürk in Indianapolis'的节点\nlabel为forum,属性title='Group for Mahmud_of_Ghazni in Raniganj'的节点\nlabel为organisation,属性name='Maulana_Azad_College'的节点\nlabel为organisation,属性name='Aligarh_Muslim_University'的节点\nlabel为organisation,属性name='Imam_Sadiq_University'的节点\nlabel为person,属性firstname='Abdul-Malik'的节点\nlabel为person,属性firstname='Abdul-Malik'的节点\nlabel为person,属性firstname='Abdul'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Jiaganj_Azimganj'的节点\nlabel为tag,属性name='Arif_Mardin'的节点\nlabel为tag,属性name='Muhammad_Iqbal'的节点\nlabel为tag,属性name='Mahmoud_Ahmadinejad'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找认识Abdul-Malik的人的性别和他们的id，同时返回Abdul-Malik的id",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n2.firstname='Abdul-Malik' return n1.gender, n1.id, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Kendall_College'的节点\nlabel为organisation,属性name='Kal_Star_Aviation'的节点\nlabel为organisation,属性name='K_L_University'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为tag,属性name='Carl_Barks'的节点\nlabel为tag,属性name='Ken_Schrader'的节点\nlabel为tag,属性name='Karl_Barth'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与名为Karl的人相识的人的信息，包括Karl的IP地址、姓名、邮箱、创建日期、语言、性别、浏览器使用情况和生日，以及关系的创建日期，限制返回18条结果",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n2.firstname='Karl' return n2.locationip, n1.firstname, n2.email, n1.creationdate, n2.language, n1.gender, n1.language, n1.browserused, n2.birthday, r1.creationdate limit 18"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Vytautas in Banda_Aceh'的节点\nlabel为forum,属性title='Group for Vytautas in Banda_Aceh'的节点\nlabel为forum,属性title='Group for Mustafa_Kemal_Atatürk in Indianapolis'的节点\nlabel为organisation,属性name='Aditya_College'的节点\nlabel为organisation,属性name='Adikavi_Nannaya_University'的节点\nlabel为organisation,属性name='Bidhan_Chandra_College,_Asansol'的节点\nlabel为place,属性name='Addis_Ababa'的节点\nlabel为place,属性name='Anantapur_district'的节点\nlabel为tag,属性name='Iparhi_Agapi_Edo'的节点\nlabel为tag,属性name='In-A-Gadda-Da-Vida'的节点\nlabel为tag,属性name='Paula_Abdul'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与Aditya认识的人的信息，包括Aditya的姓氏、id、位置IP、Aditya认识的人的姓氏、名字、语言和性别，以及Aditya的性别",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n2.firstname='Aditya' return n2.lastname, n2.id, n1.lastname, n2.locationip, n1.firstname, n1.language, n2.gender, n1.gender"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Jain_Institute_of_Technology'的节点\nlabel为organisation,属性name='Daniel_Payne_College'的节点\nlabel为tag,属性name='Jennifer_Jason_Leigh'的节点\nlabel为tag,属性name='The_Jean_Genie'的节点\nlabel为tag,属性name='John_Gay'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Jan的人及其认识的人的性别、邮箱、浏览器使用情况、位置IP、生日、创建日期、ID、姓氏、名字和语言信息。同时返回两人之间的关系创建日期。",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n1.firstname='Jan' return n2.gender, n2.email, n1.email, n1.gender, n2.browserused, n1.locationip, n2.locationip, n2.birthday, r1.creationdate, n1.id, n2.id, n2.lastname, n2.firstname, n2.language, n1.creationdate, n1.language, n1.birthday, n1.browserused, n2.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Jain_Institute_of_Technology'的节点\nlabel为organisation,属性name='Daniel_Payne_College'的节点\nlabel为organisation,属性name='Jackson_School_of_Geosciences'的节点\nlabel为tag,属性name='The_Jean_Genie'的节点\nlabel为tag,属性name='Jennifer_Jason_Leigh'的节点\nlabel为tag,属性name='John_Isner'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Jan的人及其认识的人的详细信息，包括关系的创建日期、位置IP、生日、姓氏、ID、创建日期、名字、浏览器使用情况、电子邮件、语言和性别。",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n1.firstname='Jan' return r1.creationdate, n2.locationip, n2.birthday, n1.birthday, n2.lastname, n2.id, n1.creationdate, n2.firstname, n2.creationdate, n1.locationip, n1.firstname, n2.browserused, n2.email, n1.id, n1.language, n2.language, n1.lastname, n2.gender, n1.gender, n1.browserused, n1.email"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Vanier_College_at_York_University'的节点\nlabel为tag,属性name='John_Wagner'的节点\nlabel为tag,属性name='John_Wayne'的节点\nlabel为tag,属性name='John_Warner'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Jan的人和名为Walter的人之间的关系，返回Jan使用的浏览器、语言、名、IP地址、创建日期、姓、邮箱、性别以及生日；同时返回Walter的语言、名、姓、邮箱、生日、性别和使用的浏览器，还包括他们之间关系的创建日期。",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n1.firstname='Jan' and n2.firstname='Walter' return n1.browserused, n2.language, n1.firstname, n1.locationip, n2.firstname, n1.creationdate, n2.lastname, n1.email, n1.language, n2.email, r1.creationdate, n2.birthday, n1.birthday, n1.gender, n1.lastname, n2.gender, n2.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='TATI_University_College'的节点\nlabel为organisation,属性name='Telkom_Institute_of_Management'的节点\nlabel为organisation,属性name='Triveni_Devi_Bhalotia_College'的节点\nlabel为tag,属性name='Tom_Pillibi'的节点\nlabel为tag,属性name='Tim_Rice'的节点\nlabel为tag,属性name='Telegram_Sam'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Tomi认识的人的邮箱、Tomi的id、Tomi使用的浏览器、Tomi的姓氏、Tomi的性别、Tomi的IP地址、认识Tomi的人的id和IP地址",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n2.firstname='Tomi' return n2.email, n1.id, n2.browserused, n1.lastname, n2.gender, n1.locationip, n2.id, n2.locationip"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Dayanand_College'的节点\nlabel为tag,属性name='David_Jason'的节点\nlabel为tag,属性name='John_Denver'的节点\nlabel为tag,属性name='James_Dean'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Jan的人认识的名为David的人的信息，包括Jan和David的id、性别、位置IP、语言、浏览器使用情况、创建日期、生日、名字、姓氏、电子邮件，以及他们之间关系的创建日期，限制返回10条记录。",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n2.firstname='David' and n1.firstname='Jan' return n1.id, n2.gender, n2.locationip, n1.language, n2.language, n2.firstname, n1.browserused, n2.creationdate, n1.gender, n2.birthday, n1.firstname, n2.browserused, n2.id, n1.locationip, r1.creationdate, n1.birthday, n1.creationdate, n1.lastname, n2.email, n1.email limit 10"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Andrew_Jackson_High_School'的节点\nlabel为organisation,属性name='Allen_University'的节点\nlabel为tag,属性name='Abraham,_Martin_and_John'的节点\nlabel为tag,属性name='Joan_Allen'的节点\nlabel为tag,属性name='Jennifer_Jason_Leigh'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Jan的人和他的好友Allister之间的关系，返回Jan的性别、生日、姓氏、语言、ID、电子邮件、创建日期、浏览器使用情况，以及Allister的性别、生日、姓氏、语言、位置IP、浏览器使用情况、创建日期，并限制结果为13条。",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n1.firstname='Jan' and n2.firstname='Allister' return n1.gender, n2.gender, n1.birthday, r1.creationdate, n1.lastname, n2.lastname, n2.language, n2.locationip, n1.id, n1.language, n2.firstname, n1.email, n2.birthday, n2.browserused, n1.creationdate, n1.browserused, n2.creationdate limit 13"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Seirei_Christopher_University'的节点\nlabel为organisation,属性name='William_Carey_University'的节点\nlabel为organisation,属性name='Srinivas_college'的节点\nlabel为person,属性firstname='Chris'的节点\nlabel为person,属性firstname='Chris'的节点\nlabel为person,属性firstname='Chris'的节点\nlabel为tag,属性name='Cheri,_Cheri_Lady'的节点\nlabel为tag,属性name='Jamie_Lee_Curtis'的节点\nlabel为tag,属性name='Chris_Sabin'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找认识Chris的人的姓名、语言、电子邮件、生日、id以及Chris的语言和姓氏",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n2.firstname='Chris' return n1.firstname, n1.language, n2.firstname, n1.email, n1.birthday, n1.id, n2.language, n2.lastname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Jain_Institute_of_Technology'的节点\nlabel为tag,属性name='The_Jean_Genie'的节点\nlabel为tag,属性name='Jennifer_Jason_Leigh'的节点\nlabel为tag,属性name='John_Jay'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Jan的人认识的人的语言、位置IP、浏览器使用情况、性别、电子邮件、关系的创建日期，以及Jan的详细信息，包括语言、ID、位置IP、浏览器使用情况、性别、出生日期、姓名和创建日期。同时返回认识的人的浏览器使用情况、名字、性别、位置IP、ID和创建日期。",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n1.firstname='Jan' return n2.language, n1.locationip, n1.browserused, n1.gender, n2.email, r1.creationdate, n1.language, n1.id, n2.browserused, n2.firstname, n1.creationdate, n1.firstname, n1.lastname, n2.gender, n2.locationip, n1.birthday, n2.id, n2.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='J._Sargeant_Reynolds_Community_College'的节点\nlabel为organisation,属性name='Jagran_Institute_of_Communication_and_Management'的节点\nlabel为organisation,属性name='Jain_Institute_of_Technology'的节点\nlabel为place,属性name='Jagüey_Grande'的节点\nlabel为tag,属性name='The_Jean_Genie'的节点\nlabel为tag,属性name='Richard_E._Grant'的节点\nlabel为tag,属性name='Richard_Gere'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Jan的人认识的名为Grigore的人的信息，包括Jan的生日、IP地址、性别、创建日期、语言和姓氏，以及Grigore的名、浏览器和邮箱。",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n2.firstname='Grigore' and n1.firstname='Jan' return n1.birthday, n1.locationip, n1.gender, n1.creationdate, n1.language, n1.lastname, n2.firstname, n2.browserused, n2.email"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Chrome,_Smoke_&_BBQ'的节点\nlabel为tag,属性name='Mark_McGwire'的节点\nlabel为tag,属性name='Mark_Millar'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Michal认识的人使用的浏览器类型",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n2.firstname='Michal' return n2.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Louis_XIV_of_France in Indianapolis'的节点\nlabel为organisation,属性name='Aerolloyd_Iguassu'的节点\nlabel为organisation,属性name='Jorge_Amado_University_Center'的节点\nlabel为organisation,属性name='Andrés_Bello_University'的节点\nlabel为tag,属性name='Adrian_Edmondson'的节点\nlabel为tag,属性name='Ian_Anderson'的节点\nlabel为tag,属性name='Alex_George'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Andrius认识的人的生日、姓氏、使用的语言、创建日期、位置IP、ID和浏览器使用情况",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n2.firstname='Andrius' return n2.birthday, n2.lastname, n1.language, n2.creationdate, n1.locationip, n2.id, n1.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Jain_Institute_of_Technology'的节点\nlabel为tag,属性name='The_Jean_Genie'的节点\nlabel为tag,属性name='Jennifer_Jason_Leigh'的节点\nlabel为tag,属性name='Joan_Allen'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名字为Jan的人及其认识的人的详细信息，包括他们的名字、生日、创建日期、性别、语言、浏览器使用情况、位置IP、邮箱地址和ID，以及他们之间的关系创建日期。",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n1.firstname='Jan' return n1.firstname, n2.birthday, n1.creationdate, n2.gender, n1.language, r1.creationdate, n2.id, n1.locationip, n2.locationip, n1.browserused, n2.firstname, n1.birthday, n1.lastname, n2.email, n1.id, n2.creationdate, n1.email, n2.language"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Jain_Institute_of_Technology'的节点\nlabel为tag,属性name='Jennifer_Jason_Leigh'的节点\nlabel为tag,属性name='The_Jean_Genie'的节点\nlabel为tag,属性name='Janet_Jackson'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Jan的人与名为Jana的人之间的关系，返回Jan的创建日期、电子邮件、性别、生日、姓氏、ID；Jana的性别、浏览器使用情况、创建日期、语言、位置IP、姓氏、ID、电子邮件；以及他们之间关系的创建日期。",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n1.firstname='Jan' and n2.firstname='Jana' return n1.creationdate, n1.email, n2.gender, r1.creationdate, n2.browserused, n2.creationdate, n2.language, n1.firstname, n2.locationip, n1.lastname, n1.id, n1.gender, n2.firstname, n2.email, n2.id, n2.lastname, n1.birthday"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for John_Adams in New_Haven'的节点\nlabel为organisation,属性name='Jain_Institute_of_Technology'的节点\nlabel为organisation,属性name='J._Sargeant_Reynolds_Community_College'的节点\nlabel为organisation,属性name='Andrew_Jackson_High_School'的节点\nlabel为tag,属性name='Jennifer_Jason_Leigh'的节点\nlabel为tag,属性name='The_Jean_Genie'的节点\nlabel为tag,属性name='John_Jay'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名字为Jan的人的IP地址、性别，以及他认识的人的生日、IP地址、创建日期、id和邮箱，同时返回Jan的名字。",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n1.firstname='Jan' return n1.locationip, n1.gender, n2.birthday, n2.locationip, n2.creationdate, n2.id, n2.email, n1.firstname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为forum,属性title='Album 14 of Amjad Islam Ahsan'的节点\nlabel为forum,属性title='Album 14 of Ali Abdeslam'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Shah_Abdul_Latif_University'的节点\nlabel为organisation,属性name='Al-Ahliyya_Amman_University'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Addis_Ababa'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\nlabel为tag,属性name='Muhammad_Iqbal'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与Abdullah认识的人的信息，包括他们的性别、名、邮箱、姓、浏览器使用情况、位置IP、ID、语言、创建日期，以及Abdullah的位置IP、语言、ID、生日、性别、创建日期，关系的创建日期，跳过前9条记录，返回14条记录。",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n2.firstname='Abdullah' return n1.gender, n1.firstname, n1.email, n1.lastname, n2.browserused, n2.locationip, n2.id, n1.locationip, n2.language, n1.id, n2.firstname, n2.birthday, n2.gender, n2.creationdate, n1.language, n1.creationdate, r1.creationdate skip 9 limit 14"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Jain_Institute_of_Technology'的节点\nlabel为organisation,属性name='Jaypee_Institute_of_Information_Technology'的节点\nlabel为organisation,属性name='PC_Jabin_College'的节点\nlabel为tag,属性name='Jennifer_Jason_Leigh'的节点\nlabel为tag,属性name='John_Warner'的节点\nlabel为tag,属性name='John_Isner'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Jan认识的人使用的浏览器和IP地址，限制返回18条结果",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n1.firstname='Jan' return n2.browserused, n2.locationip limit 18"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Jain_Institute_of_Technology'的节点\nlabel为tag,属性name='The_Jean_Genie'的节点\nlabel为tag,属性name='Jennifer_Jason_Leigh'的节点\nlabel为tag,属性name='John_Jay'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Jan的人及其认识的人的信息，包括Jan的电子邮件、性别、创建日期、ID和名字，以及被认识的人的创建日期、浏览器使用情况、生日、语言、姓氏、ID，以及关系的创建日期。",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n1.firstname='Jan' return n2.creationdate, n1.email, n2.language, n2.birthday, n1.id, n1.creationdate, n2.browserused, n2.lastname, n1.gender, n2.id, r1.creationdate, n1.firstname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Allen_University'的节点\nlabel为organisation,属性name='Anna_University'的节点\nlabel为person,属性firstname='Aaron'的节点\nlabel为person,属性firstname='Aaron'的节点\nlabel为tag,属性name='Alan_Alda'的节点\nlabel为tag,属性name='Steve_Allen'的节点\nlabel为tag,属性name='Alexander_Alekhine'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Angel的人的信息，包括他们使用的浏览器、关系的创建日期、姓氏、id、认识他们的人使用的浏览器、他们的电子邮件和语言，以及认识他们的人的名。",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n2.firstname='Angel' return n2.browserused, r1.creationdate, n2.lastname, n2.id, n1.browserused, n2.email, n2.language, n1.firstname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为organisation,属性name='Adam_Mickiewicz_University_in_Poznań'的节点\nlabel为organisation,属性name='Wrocław_University_of_Technology'的节点\nlabel为organisation,属性name='Vasile_Goldiş_West_University_of_Arad'的节点\nlabel为tag,属性name='Alexander_Vladimirovich_Volkov'的节点\nlabel为tag,属性name='Andrzej_Wajda'的节点\nlabel为tag,属性name='Alexander_I_of_Russia'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Wojciech认识的名叫Ali的人的创建日期、语言、姓氏和浏览器使用情况",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n2.firstname='Ali' and n1.firstname='Wojciech' return n2.creationdate, n2.language, n2.lastname, n2.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for William_Shakespeare in Vitebsk'的节点\nlabel为forum,属性title='Group for Friedrich_Nietzsche in Poznań'的节点\nlabel为forum,属性title='Group for James_K._Polk in Valdivia'的节点\nlabel为organisation,属性name='Adam_Mickiewicz_University_in_Poznań'的节点\nlabel为organisation,属性name='Wrocław_University_of_Technology'的节点\nlabel为organisation,属性name='Cardinal_Stefan_Wyszyński_University_in_Warsaw'的节点\nlabel为place,属性name='Ivanovo_Oblast'的节点\nlabel为tag,属性name='Daniel_Vacek'的节点\nlabel为tag,属性name='Władysław_IV_Vasa'的节点\nlabel为tag,属性name='Nicholas_I_of_Russia'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Wojciech的人的生日、姓氏、id、位置IP和创建日期，以及他认识的人的语言、位置IP、浏览器使用情况和关系的创建日期",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n1.firstname='Wojciech' return n1.birthday, n2.language, n1.lastname, n1.id, n2.locationip, r1.creationdate, n1.locationip, n2.browserused, n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Cardinal_Stefan_Wyszyński_University_in_Warsaw'的节点\nlabel为organisation,属性name='Wrocław_University_of_Technology'的节点\nlabel为organisation,属性name='Warsaw_University_of_Technology'的节点\nlabel为tag,属性name='Alexander_Vladimirovich_Volkov'的节点\nlabel为tag,属性name='Daniel_Vacek'的节点\nlabel为tag,属性name='Viktor_Yushchenko'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Wojciech的人及其认识的人的相关信息，包括他们的浏览器使用情况、生日、性别、创建日期、电子邮件、语言、位置IP以及关系的创建日期，限制返回10条结果。返回的信息包括：Wojciech的浏览器使用情况、生日、性别、创建日期、电子邮件、语言、位置IP、ID；他认识的人的浏览器使用情况、生日、性别、创建日期、位置IP、姓名、姓氏、ID。",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n1.firstname='Wojciech' return n1.browserused, n2.browserused, n2.birthday, n1.email, n1.gender, n2.creationdate, n1.language, r1.creationdate, n2.locationip, n2.firstname, n1.firstname, n1.id, n1.birthday, n1.creationdate, n2.lastname, n2.id, n1.locationip, n2.gender, n2.language limit 10"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Friedrich_Nietzsche in Poznań'的节点\nlabel为forum,属性title='Group for William_Shakespeare in Vitebsk'的节点\nlabel为organisation,属性name='Wrocław_University_of_Technology'的节点\nlabel为organisation,属性name='Adam_Mickiewicz_University_in_Poznań'的节点\nlabel为organisation,属性name='Cardinal_Stefan_Wyszyński_University_in_Warsaw'的节点\nlabel为tag,属性name='Daniel_Vacek'的节点\nlabel为tag,属性name='Viktor_Yushchenko'的节点\nlabel为tag,属性name='Aleksandra_Wozniak'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Wojciech认识的人的姓名，以及Wojciech使用的语言、创建日期，对方的创建日期、生日、浏览器使用情况、位置IP和性别",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n1.firstname='Wojciech' return n2.firstname, n1.language, n2.creationdate, n2.birthday, n1.browserused, n1.creationdate, n2.locationip, n2.gender"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Lessius_Hogeschool'的节点\nlabel为organisation,属性name='Ryerson_University'的节点\nlabel为organisation,属性name='Roger_Williams_University'的节点\nlabel为tag,属性name='Jerry_Lee_Lewis'的节点\nlabel为tag,属性name='Rickie_Lee_Jones'的节点\nlabel为tag,属性name='Peter_Paul_Rubens'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Luis认识的人的IP地址",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n2.firstname='Luis' return n2.locationip"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Friedrich_Nietzsche in Poznań'的节点\nlabel为forum,属性title='Group for Robert_Louis_Stevenson in Poznań'的节点\nlabel为organisation,属性name='Wrocław_University_of_Technology'的节点\nlabel为organisation,属性name='Mihin_Lanka'的节点\nlabel为organisation,属性name='Adam_Mickiewicz_University_in_Poznań'的节点\nlabel为place,属性name='Pyin_U_Lwin'的节点\nlabel为tag,属性name='Daniel_Vacek'的节点\nlabel为tag,属性name='Lutka_sa_naslovne_strane'的节点\nlabel为tag,属性name='Ivan_Lendl'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Wojciech的人认识的名为Lin的人的IP地址、姓氏、创建日期、名字，以及Wojciech的性别、电子邮件和浏览器使用情况",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n1.firstname='Wojciech' and n2.firstname='Lin' return n2.locationip, n2.lastname, n2.creationdate, n2.firstname, n1.gender, n2.email, n1.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Adam_Mickiewicz_University_in_Poznań'的节点\nlabel为organisation,属性name='Cardinal_Stefan_Wyszyński_University_in_Warsaw'的节点\nlabel为organisation,属性name='Warsaw_University_of_Technology'的节点\nlabel为place,属性name='Moscow_International_Business_Center'的节点\nlabel为tag,属性name='Michael_Vick'的节点\nlabel为tag,属性name='Czesław_Miłosz'的节点\nlabel为tag,属性name='Michael_Stich'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Wojciech认识的名为Max的人的信息，包括Max的语言、Wojciech的创建日期、性别、Max的姓氏、Wojciech的生日、Max的创建日期、Max的IP地址、Wojciech的id、Max的名字、Wojciech的语言、Max的id、Max的生日、他们认识的创建日期、Max的性别、Max使用的浏览器、Wojciech的姓氏、Wojciech的IP地址、Wojciech的邮箱和Wojciech的名字。",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n2.firstname='Max' and n1.firstname='Wojciech' return n2.language, n1.creationdate, n1.gender, n2.lastname, n1.birthday, n2.creationdate, n2.locationip, n1.id, n2.firstname, n1.language, n2.id, n2.birthday, r1.creationdate, n2.gender, n2.browserused, n1.lastname, n1.locationip, n1.email, n1.firstname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for William_Shakespeare in Vitebsk'的节点\nlabel为forum,属性title='Group for Friedrich_Nietzsche in Poznań'的节点\nlabel为organisation,属性name='Cardinal_Stefan_Wyszyński_University_in_Warsaw'的节点\nlabel为organisation,属性name='Voronezh_State_University'的节点\nlabel为organisation,属性name='Warsaw_School_of_Social_Sciences_and_Humanities'的节点\nlabel为tag,属性name='Daniel_Vacek'的节点\nlabel为tag,属性name='Alexander_Vladimirovich_Volkov'的节点\nlabel为tag,属性name='Viktor_Yushchenko'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Wojciech的人及其认识的人的详细信息，包括他们的名字、电子邮件、语言、位置IP、ID、性别、创建日期、生日和浏览器使用情况，限制返回6条记录。",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n1.firstname='Wojciech' return n1.firstname, n2.email, n1.language, n2.firstname, n1.locationip, n1.id, n2.language, n2.lastname, n1.email, n2.locationip, n1.lastname, n1.gender, n1.creationdate, n2.creationdate, r1.creationdate, n1.birthday, n2.gender, n2.id, n2.browserused limit 6"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for James_Joyce in Salem'的节点\nlabel为organisation,属性name='José_Rizal_University'的节点\nlabel为organisation,属性name='Jones_College'的节点\nlabel为organisation,属性name='James_Cook_University'的节点\nlabel为tag,属性name='Jesse_Jackson'的节点\nlabel为tag,属性name='Jesse_James'的节点\nlabel为tag,属性name='Joe_Shuster'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Jose的好友关系，返回Jose的id、位置IP、浏览器、语言，以及他的好友的id和邮箱，还有他们关系的创建日期",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n2.firstname='Jose' return n2.id, n2.locationip, n2.browserused, n2.language, n1.id, n1.email, r1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Adolfo_Ibáñez_University'的节点\nlabel为organisation,属性name='Rafael_Belloso_Chacin_University'的节点\nlabel为organisation,属性name='Sergio_Arboleda_University'的节点\nlabel为place,属性name='Antón_Lizardo'的节点\nlabel为tag,属性name='Pedro_I_of_Brazil'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\nlabel为tag,属性name='Iparhi_Agapi_Edo'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Ali的人与名为Emperor of Brazil的人之间的关系，并返回Ali的性别、生日、姓氏、电子邮件、浏览器使用情况、创建日期、语言和id，以及Emperor of Brazil的id、生日、性别、语言和电子邮件。",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n2.firstname='Emperor of Brazil' and n1.firstname='Ali' return n1.gender, n2.id, n1.firstname, n2.birthday, n1.lastname, n1.email, n1.browserused, n1.creationdate, n1.birthday, n2.gender, n2.language, n1.language, n1.id, n2.email"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Wall of Amir Chen'的节点\nlabel为forum,属性title='Wall of Alec Chen'的节点\nlabel为organisation,属性name='Anna_University,_Chennai'的节点\nlabel为organisation,属性name='Chenab_College,_Ahmedpur_Sial'的节点\nlabel为organisation,属性name='Azim_Premji_University'的节点\nlabel为person,属性firstname='Eli'的节点\nlabel为person,属性firstname='Chen'的节点\nlabel为person,属性firstname='Chen'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为tag,属性name='Zine_El_Abidine_Ben_Ali'的节点\nlabel为tag,属性name='Cheri,_Cheri_Lady'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Ali的人认识的名为Chen的人的姓氏",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n1.firstname='Ali' and n2.firstname='Chen' return n1.lastname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为forum,属性title='Group for Nikolay_Davydenko in Ahmedpur_Sial'的节点\nlabel为forum,属性title='Group for Osama_bin_Laden in Toliara'的节点\nlabel为organisation,属性name='Nalanda_Maha_Vidyalaya,_Elpitiya'的节点\nlabel为organisation,属性name='Sirimavo_Bandaranaike_Vidyalaya'的节点\nlabel为organisation,属性name='Sri_Sathya_Sai_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为place,属性name='Vallabh_Vidhyanagar'的节点\nlabel为tag,属性name='Sher_Shah_Suri'的节点\nlabel为tag,属性name='Adil_Shahi_dynasty'的节点\nlabel为tag,属性name='Hyder_Ali'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Ali的人认识的名为Shweta的人的信息，包括Ali的语言、性别、id和电子邮件，以及Shweta的姓氏、名字、性别和位置IP",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n2.firstname='Shweta' and n1.firstname='Ali' return n1.language, n1.gender, n2.lastname, n2.firstname, n1.id, n1.email, n2.gender, n2.locationip"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为forum,属性title='Group for Alicia_Keys in Jalpaiguri'的节点\nlabel为organisation,属性name='Safarilink_Aviation'的节点\nlabel为organisation,属性name='Aliah_University'的节点\nlabel为organisation,属性name='ItAli_Airlines'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为tag,属性name='Ali'的节点\nlabel为tag,属性name='Hyder_Ali'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Ali的人使用的浏览器",
        "output": "match (n1:person)-[r1:knows]->(n2:person)  where n1.firstname='Ali' return n1.browserused"
    }
]