[
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Nikolay_Davydenko in Ahmedpur_Sial'的节点\nlabel为organisation,属性name='Saratov_State_Academy_of_Law'的节点\nlabel为organisation,属性name='Ankara_University,_Law_School'的节点\nlabel为organisation,属性name='Altai_State_Academy_of_Education'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\nlabel为tag,属性name='Alexander_Suvorov'的节点\nlabel为tag,属性name='Alexander_I_of_Russia'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Andrei且在Saratov State Academy of Law学习的人的IP地址、所在组织的ID、语言、毕业年份、电子邮件、姓氏、生日、性别、组织的网址、关系的创建日期、组织名称和人的创建日期，限制返回13条结果。",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n1.firstname='Andrei' and n2.name='Saratov_State_Academy_of_Law' return n1.locationip, n2.id, n1.language, r1.classyear, n1.email, n1.lastname, n1.birthday, n1.gender, n2.url, r1.creationdate, n2.name, n1.creationdate limit 13"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='University_of_Florida_College_of_Education'的节点\nlabel为organisation,属性name='Vet_Tech_Institute_at_Bradford_School'的节点\nlabel为organisation,属性name='Fanshawe_College'的节点\nlabel为tag,属性name='Felix_Frankfurter'的节点\nlabel为tag,属性name='Vivica_A._Fox'的节点\nlabel为tag,属性name='Frank_Gifford'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Victoria University学习且名为Frank的人的信息，包括组织名称、人的名字、生日、邮箱、语言、入学年份、IP地址、创建日期、浏览器信息、组织ID、人ID和姓氏",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n2.name='Victoria_University' and n1.firstname='Frank' return n2.name, n1.firstname, n1.birthday, n1.email, n1.language, r1.classyear, n1.locationip, n1.creationdate, n1.browserused, n2.id, n1.id, n1.lastname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='National_Institute_of_Business_Management'的节点\nlabel为organisation,属性name='National_Institute_of_Business_Management'的节点\nlabel为organisation,属性name='Rawls_College_of_Business'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在National Institute of Business Management学习且名字为R.的人的语言、名、关系创建日期、id、生日、创建日期、使用的浏览器、姓以及该组织的id",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n2.name='National_Institute_of_Business_Management' and n1.firstname='R.' return n1.language, n1.firstname, r1.creationdate, n1.id, n1.birthday, n1.creationdate, n1.browserused, n1.lastname, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Shenyang_Aerospace_University'的节点\nlabel为organisation,属性name='Shenyang_Normal_University'的节点\nlabel为organisation,属性name='SNS_College_of_Technology'的节点\nlabel为tag,属性name='Hallo_Spaceboy'的节点\nlabel为tag,属性name='Sergiy_Stakhovsky'的节点\nlabel为tag,属性name='Yuri_Andropov'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在沈阳航空航天大学学习的人的学习年份、语言、创建日期、性别、id、姓氏、位置IP、浏览器使用情况、关系创建日期、电子邮件、生日和名字",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n2.name='Shenyang_Aerospace_University' return r1.classyear, n1.language, n1.creationdate, n1.gender, n1.id, n1.lastname, n1.locationip, n1.browserused, r1.creationdate, n1.email, n1.birthday, n1.firstname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Genghis_Khan in Gardēz'的节点\nlabel为forum,属性title='Group for Howard_Hughes in Gardēz'的节点\nlabel为forum,属性title='Group for Georg_Wilhelm_Friedrich_Hegel in Tarakan'的节点\nlabel为organisation,属性name='Harimohan_Ghosh_College'的节点\nlabel为organisation,属性name='Gachongil_College'的节点\nlabel为organisation,属性name='Sadhu_Goureswar_College'的节点\nlabel为tag,属性name='Gaya_confederacy'的节点\nlabel为tag,属性name='Tomasz_Gollob'的节点\nlabel为tag,属性name='We_Global'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名字为Gheorghe的人学习的组织，返回他们的语言、名、毕业年份、组织名称、姓、组织网址和性别，限制返回10条结果",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n1.firstname='Gheorghe' return n1.language, n1.firstname, r1.classyear, n2.name, n1.lastname, n2.url, n1.gender limit 10"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Škoda_Auto_University'的节点\nlabel为organisation,属性name='Sōka_University'的节点\nlabel为organisation,属性name='Sinhgad_College_of_Engineering'的节点\nlabel为tag,属性name='Łukasz_Kubot'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Škoda Auto University学习的人的毕业年份、使用的语言、浏览器、IP地址、姓氏、学校ID、生日、关系创建日期、电子邮件、性别、学校网址和名字",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n2.name='Škoda_Auto_University' return r1.classyear, n1.language, n1.browserused, n1.locationip, n1.lastname, n2.id, n1.birthday, r1.creationdate, n1.email, n1.gender, n2.url, n1.firstname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='SNDT_Women's_University'的节点\nlabel为organisation,属性name='SNDT_Women's_University'的节点\nlabel为organisation,属性name='Northwest_University_for_Nationalities'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在University of the Arctic学习的人使用的浏览器、性别以及关系的创建日期",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n2.name='University_of_the_Arctic' return n1.browserused, n1.gender, r1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Richard_J._Daley_College'的节点\nlabel为organisation,属性name='Daeduk_College'的节点\nlabel为organisation,属性name='Zakir_Husain_Delhi_College'的节点\nlabel为tag,属性name='Denis_Diderot'的节点\nlabel为tag,属性name='I_Got_Id'的节点\nlabel为tag,属性name='Jerry_Reed'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名字为Dith的人的生日、位置IP以及他们毕业的年份和组织的id，最多返回8条记录",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n1.firstname='Dith' return n1.birthday, n1.locationip, r1.classyear, n2.id limit 8"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Vignan_University'的节点\nlabel为organisation,属性name='Virginia_Intermont_College'的节点\nlabel为organisation,属性name='Vignan_Engineering_College'的节点\nlabel为person,属性firstname='Ivan'的节点\nlabel为person,属性firstname='Ivan'的节点\nlabel为person,属性firstname='Ivan'的节点\nlabel为tag,属性name='Allen_Iverson'的节点\nlabel为tag,属性name='Steve_Irwin'的节点\nlabel为tag,属性name='John_Irving'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Ivan的人的性别、生日、位置IP、ID、浏览器使用情况、所在组织的名称和URL、关系的创建日期、组织的ID、毕业年份以及Ivan的创建日期、名和姓",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n1.firstname='Ivan' return n1.gender, n1.birthday, n1.locationip, n1.id, n1.browserused, n2.name, n2.url, r1.creationdate, n2.id, r1.classyear, n1.creationdate, n1.firstname, n1.lastname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='SNDT_Women's_University'的节点\nlabel为organisation,属性name='SNDT_Women's_University'的节点\nlabel为organisation,属性name='SNS_College_of_Technology'的节点\nlabel为tag,属性name='Profiles'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在National Institute of Applied Science and Technology学习过的人的电子邮件、性别、组织ID、创建日期、生日、使用的浏览器、组织URL、关系创建日期、个人ID、名字和语言",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n2.name='National_Institute_of_Applied_Science_and_Technology' return n1.email, n1.gender, n2.id, n1.creationdate, n1.birthday, n1.browserused, n2.url, r1.creationdate, n1.id, n1.firstname, n1.language"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='German_School_of_Athens'的节点\nlabel为organisation,属性name='Lund_School_of_Economics_and_Management'的节点\nlabel为organisation,属性name='Utrecht_University_School_of_Economics'的节点\nlabel为tag,属性name='Live_at_Luther_College'的节点\nlabel为tag,属性name='Anthony_Eden'的节点\nlabel为tag,属性name='Denzel_Washington'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Utrecht University School of Economics学习且名字为Aad De的人的详细信息，包括关系的创建日期、语言、IP地址、名字、邮箱、性别、学校名称、浏览器、学校网址、毕业年份、姓氏、生日、学校ID、个人ID和个人创建日期，限制返回20条记录。",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n2.name='Utrecht_University_School_of_Economics' and n1.firstname='Aad De' return r1.creationdate, n1.language, n1.locationip, n1.firstname, n1.email, n1.gender, n2.name, n1.browserused, n2.url, r1.classyear, n1.lastname, n1.birthday, n2.id, n1.id, n1.creationdate limit 20"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Percy_Bysshe_Shelley in Galați'的节点\nlabel为forum,属性title='Group for Alicia_Keys in Jalpaiguri'的节点\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为organisation,属性name='ACSI_College-Iloilo'的节点\nlabel为organisation,属性name='Shahid_Madani_University_Of_Azarbaijan'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为tag,属性name='Alex_Shelley'的节点\nlabel为tag,属性name='Hyder_Ali'的节点\nlabel为tag,属性name='Adil_Shahi_dynasty'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Ashley的人的id、电子邮件、姓氏、语言和生日",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n1.firstname='Ashley' return n1.id, n1.email, n1.lastname, n1.language, n1.birthday"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Jesse_H._Jones_Graduate_School_of_Business'的节点\nlabel为organisation,属性name='Jacobs_School_of_Engineering'的节点\nlabel为organisation,属性name='James_A._Rhodes_State_College'的节点\nlabel为tag,属性name='Jesse_James'的节点\nlabel为tag,属性name='James_Earl_Jones'的节点\nlabel为tag,属性name='Jim_Jones'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为James的人学习过的组织机构的详细信息，包括James的语言、IP地址、邮箱、生日、使用的浏览器、性别、创建日期，以及组织机构的id、URL、名称和关系的创建年份，并按组织机构名称排序。",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n1.firstname='James' return n1.language, n1.locationip, n1.email, n2.id, n1.firstname, n1.id, n1.birthday, r1.classyear, n1.browserused, n1.gender, n2.url, n1.lastname, n1.creationdate, n2.name, r1.creationdate order by n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Georg_Wilhelm_Friedrich_Hegel in Tarakan'的节点\nlabel为organisation,属性name='Aga_Khan_University'的节点\nlabel为organisation,属性name='Aga_Khan_University'的节点\nlabel为organisation,属性name='Aga_Khan_University'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为tag,属性name='Eddie_Van_Halen'的节点\nlabel为tag,属性name='Alfred_Deakin'的节点\nlabel为tag,属性name='Keith_Giffen'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Aga_Khan_University学习且名字为Frederick的人的id、语言和名字，最多返回18个结果",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n2.name='Aga_Khan_University' and n1.firstname='Frederick' return n1.id, n1.language, n1.firstname limit 18"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='DG_Vaishnav_College'的节点\nlabel为organisation,属性name='Daeduk_College'的节点\nlabel为organisation,属性name='Deen_Dayal_Upadhyaya_College'的节点\nlabel为tag,属性name='David_Lee_Roth'的节点\nlabel为tag,属性name='Steve_Davis'的节点\nlabel为tag,属性name='John_Denver'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为David的人学习过的组织的详细信息，包括他的毕业年份、位置IP、姓氏、浏览器、电子邮件、名、组织的网址和名称、关系的创建日期、人的创建日期、生日、性别、ID和语言。",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n1.firstname='David' return r1.classyear, n1.locationip, n1.lastname, n1.browserused, n1.email, n1.firstname, n2.url, n2.name, r1.creationdate, n1.creationdate, n1.birthday, n1.gender, n1.id, n1.language"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Mahmud_of_Ghazni in Raniganj'的节点\nlabel为organisation,属性name='Shahid_Rajaee_University'的节点\nlabel为organisation,属性name='Rajiv_Gandhi_University_of_Health_Sciences'的节点\nlabel为organisation,属性name='Bahauddin_Zakariya_University'的节点\nlabel为tag,属性name='Live_at_Luther_College'的节点\nlabel为tag,属性name='Mohammad_Reza_Pahlavi'的节点\nlabel为tag,属性name='I_Love_College'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Rajiv Gandhi University of Health Sciences学习的人的电子邮件、创建日期、学校的网址、关系的创建日期、学校的id、人的名字和使用的浏览器",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n2.name='Rajiv_Gandhi_University_of_Health_Sciences' return n1.email, n1.creationdate, n2.url, r1.creationdate, n2.id, n1.firstname, n1.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Maulana_Azad_Medical_College'的节点\nlabel为organisation,属性name='Adikavi_Nannaya_University'的节点\nlabel为organisation,属性name='Addis_Ababa_University'的节点\nlabel为place,属性name='Addis_Ababa'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\nlabel为tag,属性name='Muhammad_ibn_Zakariya_al-Razi'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Rajiv Gandhi University of Health Sciences学习且名字为Aditya的人的邮箱、创建日期、位置IP、组织的网址、名、浏览器使用情况、姓、组织ID、人ID、性别、组织名称、生日以及关系的创建日期，并按组织名称排序，限制结果为10条。",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n2.name='Rajiv_Gandhi_University_of_Health_Sciences' and n1.firstname='Aditya' return n1.email, n1.creationdate, n1.locationip, n2.url, n1.firstname, n1.browserused, n1.lastname, n2.id, n1.id, n1.gender, n2.name, n1.birthday, r1.creationdate order by n2.name limit 10"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Albert_Günther in Loikaw'的节点\nlabel为forum,属性title='Group for Mustafa_Kemal_Atatürk in Indianapolis'的节点\nlabel为forum,属性title='Group for Kevin_Rudd in Zhukovsky'的节点\nlabel为organisation,属性name='Maulana_Azad_College'的节点\nlabel为organisation,属性name='Irkutsk_State_University'的节点\nlabel为organisation,属性name='Anahuac_Mayab_University'的节点\nlabel为tag,属性name='Iparhi_Agapi_Edo'的节点\nlabel为tag,属性name='Mustafa_Kemal_Atatürk'的节点\nlabel为tag,属性name='Weird_Al_Yankovic'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Aykut的人的电子邮件、创建日期、id和生日，以及他学习的组织的网址和关系的创建日期",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n1.firstname='Aykut' return n1.email, n1.creationdate, n1.id, n1.birthday, n2.url, r1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Paul_Sabatier_University'的节点\nlabel为organisation,属性name='University_of_Pittsburgh_School_of_Education'的节点\nlabel为organisation,属性name='Pavai_College_of_Technology'的节点\nlabel为tag,属性name='Paul_Rudd'的节点\nlabel为tag,属性name='Peter_David'的节点\nlabel为tag,属性name='Paul_von_Hindenburg'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Vanderbilt University Graduate School学习的名叫Paul的人的信息，包括他们的毕业年份、学校的网址、学校名称、个人的IP地址、性别、创建日期、关系的创建日期、个人ID、学校ID、浏览器使用情况和个人的名字。",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n2.name='Vanderbilt_University_Graduate_School' and n1.firstname='Paul' return r1.classyear, n2.url, n2.name, n1.locationip, n1.gender, n1.creationdate, r1.creationdate, n1.id, n2.id, n1.browserused, n1.firstname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Payap_University'的节点\nlabel为organisation,属性name='PPG_Institute_of_Technology'的节点\nlabel为organisation,属性name='PPGMAp'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在PPGMAp学习的人所使用的浏览器、组织名称、语言、姓氏、电子邮件和性别，并按组织名称排序",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n2.name='PPGMAp' return n1.browserused, n2.name, n1.language, n1.lastname, n1.email, n1.gender order by n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为organisation,属性name='Al-Ahliyya_Amman_University'的节点\nlabel为organisation,属性name='Imam_Sadiq_University'的节点\nlabel为organisation,属性name='El_Shorouk_Academy'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为place,属性name='El_Shorouk'的节点\nlabel为tag,属性name='Islamic_Courts_Union'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Muhammad_Ali_of_Egypt'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在El_Shorouk_Academy学习的名为Ahmed的人的语言、组织的URL、人的名字、组织的id、关系的创建日期、人的创建日期和人的姓氏",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n2.name='El_Shorouk_Academy' and n1.firstname='Ahmed' return n1.language, n2.url, n1.firstname, n2.id, r1.creationdate, n1.creationdate, n1.lastname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='University_of_Texas_at_Austin'的节点\nlabel为organisation,属性name='Tallinn_University_of_Applied_Sciences'的节点\nlabel为organisation,属性name='Tallinn_University_of_Technology'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Tallinn University of Applied Sciences学习的人的id、学校网址、个人语言、创建日期、学习关系的创建日期、生日、浏览器使用情况、学校id、毕业年份、位置IP、名字和性别，限制返回4条结果。",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n2.name='Tallinn_University_of_Applied_Sciences' return n1.id, n2.url, n1.language, n1.creationdate, r1.creationdate, n1.birthday, n1.browserused, n2.id, r1.classyear, n1.locationip, n1.firstname, n1.gender limit 4"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Computer_University,_Sittwe'的节点\nlabel为organisation,属性name='Infonet_College'的节点\nlabel为organisation,属性name='SEGi_University_College'的节点\nlabel为tag,属性name='Steve_Irwin'的节点\nlabel为tag,属性name='Live_at_Luther_College'的节点\nlabel为tag,属性name='I_Love_College'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Computer University, Sittwe学习且名为Eric的人的生日、毕业年份、组织的网址、姓氏、使用的浏览器、id、名字、组织的id、语言、邮箱、创建日期、性别和IP地址",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n2.name='Computer_University,_Sittwe' and n1.firstname='Eric' return n1.birthday, r1.classyear, n2.url, n1.lastname, n1.browserused, n1.id, n1.firstname, n2.id, n1.language, n1.email, n1.creationdate, n2.name, n1.gender, n1.locationip"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Daeduk_College'的节点\nlabel为organisation,属性name='Deen_Dayal_Upadhyaya_College'的节点\nlabel为organisation,属性name='Avadh_University'的节点\nlabel为tag,属性name='Alan_Ladd'的节点\nlabel为tag,属性name='André_Gide'的节点\nlabel为tag,属性name='Azad_Hind'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Aad De的人的姓氏、学习的组织、关系的创建日期、毕业年份、使用的浏览器和语言",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n1.firstname='Aad De' return n1.lastname, r1.creationdate, r1.classyear, n1.browserused, n1.language, n1.firstname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='John_Jay_College_of_Criminal_Justice'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Nihon_University_Junior_College'的节点\nlabel为tag,属性name='John_Jay'的节点\nlabel为tag,属性name='Jennifer_Jason_Leigh'的节点\nlabel为tag,属性name='Joan_Allen'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Juan的人的生日、位置IP、浏览器使用情况、学习经历的创建日期、电子邮件、ID、性别、所在组织的URL以及该人的创建日期和学习经历的毕业年份",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n1.firstname='Juan' return n1.birthday, n1.locationip, n1.browserused, r1.creationdate, n1.email, n1.id, r1.classyear, n1.gender, n2.url, n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Handong_Global_University'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Asia_e_University'的节点\nlabel为tag,属性name='Hans_Christian_Andersen'的节点\nlabel为tag,属性name='We_Global'的节点\nlabel为tag,属性name='Hans_Werner_Henze'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Hans且在Cluster of Excellence Asia and Europe in a Global Context学习的人的姓氏、创建日期、电子邮件、毕业年份、浏览器使用情况、id和性别",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n1.firstname='Hans' and n2.name='Cluster_of_Excellence_Asia_and_Europe_in_a_Global_Context' return n1.lastname, n1.creationdate, n1.email, r1.classyear, n1.browserused, n1.id, n1.gender"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Mahmud_of_Ghazni in Raniganj'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为organisation,属性name='Jawaharlal_Nehru_Technological_University,_Hyderabad'的节点\nlabel为organisation,属性name='Amirkabir_University_of_Technology'的节点\nlabel为organisation,属性name='Ghulam_Ishaq_Khan_Institute_of_Engineering_Sciences_and_Technology'的节点\nlabel为tag,属性name='Memorial_Address'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Mohammed_Zahir_Shah'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Ghulam Ishaq Khan Institute of Engineering Sciences and Technology学习的人的IP地址、姓氏、生日、语言、浏览器、入学年份、学校名称、关系创建日期和学校网址",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n2.name='Ghulam_Ishaq_Khan_Institute_of_Engineering_Sciences_and_Technology' return n1.locationip, n1.lastname, n1.birthday, n1.language, n1.browserused, r1.classyear, n2.name, r1.creationdate, n2.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Toyohashi_Sozo_College'的节点\nlabel为organisation,属性name='Aichi_Mizuho_College'的节点\nlabel为organisation,属性name='Nihonbashi_Gakkan_University'的节点\nlabel为tag,属性name='Tokugawa_Ieyasu'的节点\nlabel为tag,属性name='Genesis_1976–1982'的节点\nlabel为tag,属性name='Toyotomi_Hideyoshi'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Takeshi的人学习的组织的创建日期、姓氏、组织ID、个人ID和个人生日",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n1.firstname='Takeshi' return r1.creationdate, n1.lastname, n2.id, n1.id, n1.birthday"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='University_of_Stellenbosch_Business_School'的节点\nlabel为organisation,属性name='Sripat_Singh_College'的节点\nlabel为organisation,属性name='Raja_Balwant_Singh_College'的节点\nlabel为tag,属性name='Subhas_Chandra_Bose'的节点\nlabel为tag,属性name='Niki_Lauda'的节点\nlabel为tag,属性name='Shilpa_Shetty'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在National Institute of Business Management学习的名为Shweta的人的详细信息，包括组织的网址、个人的生日、名字、语言、浏览器、组织名称、电子邮件、关系创建日期、个人ID、性别、位置IP以及毕业年份。",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n2.name='National_Institute_of_Business_Management' and n1.firstname='Shweta' return n2.url, n1.birthday, n1.firstname, n1.language, n1.browserused, n2.name, n1.email, r1.creationdate, n1.id, n1.gender, n1.locationip, r1.classyear"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Nancy_2_University'的节点\nlabel为organisation,属性name='Nihon_University'的节点\nlabel为organisation,属性name='Nihon_University_Junior_College'的节点\nlabel为tag,属性name='Nguyen_dynasty'的节点\nlabel为tag,属性name='Neil_Young'的节点\nlabel为tag,属性name='Anna_Nicole_Smith'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Ning的人学习过的组织的名称、Ning的IP地址、Ning的id、组织的id、学习年份、Ning的电子邮件、Ning的名、Ning使用的浏览器、Ning的创建日期、Ning的性别、Ning的姓、Ning的生日、关系的创建日期、Ning的语言、组织的网址，并按组织名称排序",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n1.firstname='Ning' return n2.name, n1.locationip, n1.id, n2.id, r1.classyear, n1.email, n1.firstname, n1.browserused, n1.creationdate, n1.gender, n1.lastname, n1.birthday, r1.creationdate, n1.language, n2.url order by n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Luiz_Inácio_Lula_da_Silva in Rio_de_Janeiro'的节点\nlabel为forum,属性title='Group for Franklin_D._Roosevelt in Vadodara'的节点\nlabel为forum,属性title='Group for Franklin_D._Roosevelt in Vadodara'的节点\nlabel为organisation,属性name='University_of_Évora'的节点\nlabel为organisation,属性name='Aurel_Vlaicu_University_of_Arad'的节点\nlabel为organisation,属性name='University_of_Ciego_de_Ávila'的节点\nlabel为tag,属性name='Live_at_Luther_College'的节点\nlabel为tag,属性name='Iparhi_Agapi_Edo'的节点\nlabel为tag,属性name='Ivan_Lendl'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在University of Évora学习过的人的id以及该大学的id",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n2.name='University_of_Évora' return n2.id, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Adamson_University_College_of_Education'的节点\nlabel为organisation,属性name='Amsterdam_University_College'的节点\nlabel为organisation,属性name='Bidhan_Chandra_College,_Asansol'的节点\nlabel为tag,属性name='Edward_Asner'的节点\nlabel为tag,属性name='Alan_Ladd'的节点\nlabel为tag,属性name='Alexander_Payne'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Alexander且在Academy of Public Administration学习的人的毕业年份、姓氏、使用的浏览器、性别、IP地址，以及该机构的网址和名称",
        "output": "match (n1:person)-[r1:studyat]->(n2:organisation)  where n1.firstname='Alexander' and n2.name='Academy_of_Public_Administration' return r1.classyear, n1.lastname, n1.browserused, n1.gender, n1.locationip, n2.url, n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Nikolay_Davydenko in Ahmedpur_Sial'的节点\nlabel为forum,属性title='Group for Joseph_Haydn in Solapur'的节点\nlabel为organisation,属性name='Dalit_Bahujan_Shramik_Union'的节点\nlabel为organisation,属性name='Air_Arabia_Jordan'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为tag,属性name='Bob_Dylan_at_Budokan'的节点\nlabel为tag,属性name='Ahmad_Shah_Durrani'的节点\nlabel为tag,属性name='Bal_Gangadhar_Tilak'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Djelaludin且在Balkh Airlines工作的人的创建日期、生日、性别、入职日期、公司名称、姓氏、id、公司id、公司网址、关系创建日期和电子邮件。",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n1.firstname='Djelaludin' and n2.name='Balkh_Airlines' return n1.creationdate, n1.birthday, n1.gender, r1.workfrom, n2.name, n1.lastname, n1.id, n2.id, n2.url, r1.creationdate, n1.email"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Nikolay_Davydenko in Ahmedpur_Sial'的节点\nlabel为forum,属性title='Group for Joseph_Haydn in Solapur'的节点\nlabel为forum,属性title='Group for Genghis_Khan in Asadabad'的节点\nlabel为organisation,属性name='Dalit_Bahujan_Shramik_Union'的节点\nlabel为organisation,属性name='Air_Arabia_Jordan'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为place,属性name='Jiaganj_Azimganj'的节点\nlabel为place,属性name='Bandar_Lampung'的节点\nlabel为tag,属性name='Bob_Dylan_at_Budokan'的节点\nlabel为tag,属性name='Ahmad_Shah_Durrani'的节点\nlabel为tag,属性name='Bal_Gangadhar_Tilak'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Djelaludin且在Balkh Airlines工作的人的姓名、生日、关系创建日期、入职日期、电子邮件、性别、组织网址、姓氏和位置IP",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n1.firstname='Djelaludin' and n2.name='Balkh_Airlines' return n1.firstname, n1.birthday, r1.creationdate, r1.workfrom, n1.email, n1.gender, n2.url, n1.lastname, n1.locationip"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为forum,属性title='Group for Genghis_Khan in Asadabad'的节点\nlabel为forum,属性title='Group for Genghis_Khan in Asadabad'的节点\nlabel为organisation,属性name='Pakistan_Navy_Engineering_College'的节点\nlabel为organisation,属性name='Balkh_Airlines'的节点\nlabel为organisation,属性name='Bakhtar_Afghan_Airlines'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为tag,属性name='The_Balkan_Girls'的节点\nlabel为tag,属性name='Dil_Dil_Pakistan'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Balkh Airlines工作的人员的性别、组织的网址、人员的电子邮件、人员的id和语言，以及关系的创建日期",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n2.name='Balkh_Airlines' return r1.creationdate, n1.gender, n2.url, n1.email, n1.id, n1.language"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Genghis_Khan in Asadabad'的节点\nlabel为forum,属性title='Group for Genghis_Khan in Asadabad'的节点\nlabel为forum,属性title='Group for Genghis_Khan in Asadabad'的节点\nlabel为organisation,属性name='Khyber_Afghan_Airlines'的节点\nlabel为organisation,属性name='Bakhtar_Afghan_Airlines'的节点\nlabel为organisation,属性name='Chabahar_Airlines'的节点\nlabel为tag,属性name='Saif_Ali_Khan'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Khyber Afghan Airlines工作的人员的详细信息，包括关系的创建日期、组织的网址、人员的生日、邮箱、语言、组织的id、入职时间、人员的id、组织名称、使用的浏览器、登录IP、性别、人员的创建日期、名字和姓氏，并按组织名称排序。",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n2.name='Khyber_Afghan_Airlines' return r1.creationdate, n2.url, n1.birthday, n1.email, n1.language, n2.id, r1.workfrom, n1.id, n2.name, n1.browserused, n1.locationip, n1.gender, n1.creationdate, n1.firstname, n1.lastname order by n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Genghis_Khan in Asadabad'的节点\nlabel为forum,属性title='Group for Genghis_Khan in Asadabad'的节点\nlabel为forum,属性title='Group for Genghis_Khan in Asadabad'的节点\nlabel为organisation,属性name='Khyber_Afghan_Airlines'的节点\nlabel为organisation,属性name='Chabahar_Airlines'的节点\nlabel为organisation,属性name='Bakhtar_Afghan_Airlines'的节点\nlabel为tag,属性name='Saif_Ali_Khan'的节点\nlabel为tag,属性name='S&M_Airlines'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Khyber Afghan Airlines工作的人员的电子邮件、工作开始时间、名字、语言、组织的网址、人员的创建日期、组织名称、组织ID、浏览器使用情况、人员的姓氏、关系的创建日期、人员的位置IP、人员ID和性别",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n2.name='Khyber_Afghan_Airlines' return n1.email, r1.workfrom, n1.firstname, n1.language, n2.url, n1.creationdate, n2.name, n2.id, n1.browserused, n1.lastname, r1.creationdate, n1.locationip, n1.id, n1.gender"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Mahmud_of_Ghazni in Raniganj'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为organisation,属性name='Rammohan_College'的节点\nlabel为organisation,属性name='Shahid_Rajaee_University'的节点\nlabel为organisation,属性name='Rajalakshmi_Engineering_College'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为place,属性name='Ramadan_City'的节点\nlabel为tag,属性name='Rahul_Dev_Burman'的节点\nlabel为tag,属性name='Rajeev_Ram'的节点\nlabel为tag,属性name='Rahm_Emanuel'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名字为Rahim的人的工作信息，包括他的生日、性别、姓氏、创建日期、邮箱、ID、使用的浏览器、语言、工作开始日期、组织的ID、URL、名称以及关系的创建日期和位置IP",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n1.firstname='Rahim' return r1.workfrom, n1.birthday, n2.id, n1.gender, n1.lastname, n1.creationdate, n1.email, n2.url, n1.id, n2.name, n1.browserused, n1.language, r1.creationdate, n1.firstname, n1.locationip"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Genghis_Khan in Asadabad'的节点\nlabel为forum,属性title='Group for Genghis_Khan in Asadabad'的节点\nlabel为forum,属性title='Group for Genghis_Khan in Asadabad'的节点\nlabel为organisation,属性name='Khyber_Afghan_Airlines'的节点\nlabel为organisation,属性name='Chabahar_Airlines'的节点\nlabel为organisation,属性name='Sky_Service_(Kazakhstan)'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Jiaganj_Azimganj'的节点\nlabel为tag,属性name='Saif_Ali_Khan'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Khyber Afghan Airlines工作的人员的姓名、语言、id、IP地址、电子邮件和生日，以及他们开始工作的时间和公司的名称与id。",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n2.name='Khyber_Afghan_Airlines' return r1.workfrom, n2.name, n2.id, n1.firstname, n1.language, n1.id, n1.locationip, n1.email, n1.birthday"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为organisation,属性name='Air_Arabia_Maroc'的节点\nlabel为organisation,属性name='MIAT_Mongolian_Airlines'的节点\nlabel为organisation,属性name='AlMasria_Universal_Airlines'的节点\nlabel为person,属性firstname='Mamoon Eshaq 0'的节点\nlabel为place,属性name='Moscow_International_Business_Center'的节点\nlabel为tag,属性name='Hosni_Mubarak'的节点\nlabel为tag,属性name='Mohammad_Mosaddegh'的节点\nlabel为tag,属性name='Mohammad_Reza_Pahlavi'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在MarcoPolo Airways工作的Mamoon Eshaq 0的电子邮件、组织id、姓氏、语言、工作关系的创建日期、浏览器使用情况、性别、个人id、工作开始时间、名字和个人创建日期",
        "output": "match (n1:person)-[r1:workat]->(n2:organisation)  where n2.name='MarcoPolo_Airways' and n1.firstname='Mamoon Eshaq 0' return n1.email, n2.id, n1.lastname, n1.language, r1.creationdate, n1.browserused, n1.gender, n1.id, r1.workfrom, n1.firstname, n1.creationdate"
    }
]