[
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Louis_XIV_of_France in Indianapolis'的节点\nlabel为forum,属性title='Group for Paul_Newman in Santiago_de_Cuba'的节点\nlabel为forum,属性title='Group for Luiz_Inácio_Lula_da_Silva in Rio_de_Janeiro'的节点\nlabel为organisation,属性name='Nicaragüense_de_Aviación'的节点\nlabel为organisation,属性name='Canossa_Academy_Lipa'的节点\nlabel为organisation,属性name='Nalanda_International_University'的节点\nlabel为place,属性name='Greater_Noida'的节点\nlabel为place,属性name='New_York_City'的节点\nlabel为place,属性name='Iloilo_City'的节点\nlabel为tag,属性name='Denis_of_Portugal'的节点\nlabel为tag,属性name='Search_for_the_New_Land'的节点\nlabel为tag,属性name='John_I_of_Portugal'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Nicolas的人所在地点的id以及他们的语言，最多返回12条结果",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n1.firstname='Nicolas' return n2.id, n1.language limit 12"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Mustafa_Kemal_Atatürk in Indianapolis'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Imam_Sadiq_University'的节点\nlabel为organisation,属性name='Amman_Arab_University'的节点\nlabel为person,属性firstname='Abay Ibrahim'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\nlabel为tag,属性name='Muhammad_Iqbal'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Abay Ibrahim的性别、使用的浏览器、位置IP、生日、ID、语言以及他所在地点的ID、URL和名称，同时返回关系的创建日期",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n1.firstname='Abay Ibrahim' return r1.creationdate, n1.gender, n1.browserused, n2.id, n1.locationip, n2.url, n1.birthday, n1.id, n2.name, n1.lastname, n1.email, n1.creationdate, n1.language"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Nawaz_Sharif in Cali'的节点\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为forum,属性title='Group for Mahmud_of_Ghazni in Raniganj'的节点\nlabel为organisation,属性name='Xavier_Institute_of_Management,_Bhubaneswar'的节点\nlabel为organisation,属性name='Azerbaijan_University_of_Languages'的节点\nlabel为organisation,属性name='Shahid_Madani_University_Of_Azarbaijan'的节点\nlabel为person,属性firstname='Chaim Azriel'的节点\nlabel为person,属性firstname='Chaim Azriel'的节点\nlabel为place,属性name='Bab_Ezzouar'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\nlabel为tag,属性name='Ayman_al-Zawahiri'的节点\nlabel为tag,属性name='Zine_El_Abidine_Ben_Ali'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找位于Bobruysk的名为Chaim Azriel的人的详细信息，包括地点id、姓氏、创建日期、关系创建日期、语言、浏览器使用情况、名和地点URL",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n2.name='Bobruysk' and n1.firstname='Chaim Azriel' return n2.id, n1.lastname, n1.creationdate, r1.creationdate, n1.language, n1.browserused, n1.firstname, n2.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='University_of_Hradec_Králové'的节点\nlabel为organisation,属性name='Hubert_Kairuki_Memorial_University'的节点\nlabel为organisation,属性name='Kharkiv_Polytechnic_Institute'的节点\nlabel为place,属性name='Hradec_Králové'的节点\nlabel为tag,属性name='Hannicap_Circus'的节点\nlabel为tag,属性name='Radha_Krsna_Temple'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找位于Hradec Králové的人的关联关系的创建日期",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n2.name='Hradec_Králové' return r1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Jesse_H._Jones_Graduate_School_of_Business'的节点\nlabel为organisation,属性name='James_A._Rhodes_State_College'的节点\nlabel为organisation,属性name='York_St_John_University'的节点\nlabel为tag,属性name='Jesse_James'的节点\nlabel为tag,属性name='Jesse_Jackson'的节点\nlabel为tag,属性name='James_Joyce'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Jose的人的信息，包括他的id、性别、邮箱、语言、位置IP、姓氏、浏览器、生日、创建日期以及他所在地点的id、名称和URL，同时返回关系的创建日期，限制结果为19条。",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n1.firstname='Jose' return n1.id, n2.id, n2.name, n1.gender, n2.url, r1.creationdate, n1.email, n1.language, n1.locationip, n1.lastname, n1.browserused, n1.birthday, n1.creationdate, n1.firstname limit 19"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Paul_Sabatier_University'的节点\nlabel为organisation,属性name='Sardar_Patel_University'的节点\nlabel为organisation,属性name='Sardar_Patel_University'的节点\nlabel为tag,属性name='Andrei_Pavel'的节点\nlabel为tag,属性name='Paul_Revere'的节点\nlabel为tag,属性name='Paul_Verhoeven'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Pavel的人的位置IP、创建日期、出生日期、性别、使用的浏览器、所在地点的id、人的id、语言、名字以及所在地点的URL和名称",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n1.firstname='Pavel' return n1.locationip, n1.creationdate, r1.creationdate, n1.birthday, n1.gender, n1.browserused, n2.id, n1.id, n1.language, n1.firstname, n2.url, n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Duy_Tan_University'的节点\nlabel为organisation,属性name='Burdwan_Raj_College'的节点\nlabel为organisation,属性name='Jenderal_Soedirman_University'的节点\nlabel为place,属性name='Jiaganj_Azimganj'的节点\nlabel为tag,属性name='John_Dryden'的节点\nlabel为tag,属性name='Jane_Addams'的节点\nlabel为tag,属性name='Judi_Dench'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Jun且位于丹东的人的创建日期、性别和姓氏，并按地点名称降序排列，返回地点的id、名称以及人的创建日期、性别和姓氏",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n1.firstname='Jun' and n2.name='Dandong' return n2.id, n1.creationdate, n2.name, n1.gender, n1.lastname order by n2.name desc"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Don_Bosco_Institute_of_Technology,_Mumbai'的节点\nlabel为organisation,属性name='Tomsk_State_University'的节点\nlabel为organisation,属性name='Thaksin_University'的节点\nlabel为place,属性name='Yongkang_District'的节点\nlabel为place,属性name='Pathum_Thani_Province'的节点\nlabel为place,属性name='Wilayah_Persekutuan_Kuala_Lumpur'的节点\nlabel为tag,属性name='Ivan_Turgenev'的节点\nlabel为tag,属性name='Bob_Dylan_at_Budokan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找位于Tuyên Quang的人的信息，包括关系的创建日期、人的id、语言、创建日期以及地点的id",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n2.name='Tuyên_Quang' return r1.creationdate, n1.id, n1.language, n1.creationdate, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Qazvin_Islamic_Azad_University'的节点\nlabel为organisation,属性name='José_Rizal_University'的节点\nlabel为organisation,属性name='Xavier_University'的节点\nlabel为person,属性firstname='Parviz'的节点\nlabel为place,属性name='Bab_Ezzouar'的节点\nlabel为tag,属性name='Joe_Zawinul'的节点\nlabel为tag,属性name='Warren_Zevon'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Qazvin居住的名为Parviz的个人信息，包括他的生日、性别、名字、创建日期、地点ID、语言、姓氏、个人ID、地点URL、浏览器使用情况、位置IP和电子邮件。",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n2.name='Qazvin' and n1.firstname='Parviz' return n2.name, n1.birthday, n1.gender, n1.firstname, n1.creationdate, n2.id, n1.language, n1.lastname, n1.id, n2.url, n1.browserused, n1.locationip, n1.email"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='PLM_Emeritus_College'的节点\nlabel为organisation,属性name='Eskişehir_Osmangazi_University'的节点\nlabel为organisation,属性name='Azim_Premji_University'的节点\nlabel为tag,属性name='Yip_Harburg'的节点\nlabel为tag,属性name='Memorial_Address'的节点\nlabel为tag,属性name='Erich_von_Stroheim'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找居住在恩平的人的姓名、恩平的id和网址以及这些人的生日",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n2.name='Enping' return n1.firstname, n2.id, n2.url, n1.birthday"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Bing_Crosby in Belgorod'的节点\nlabel为forum,属性title='Group for Nicole_Kidman in Bijie'的节点\nlabel为organisation,属性name='Chiba_University'的节点\nlabel为organisation,属性name='Ibb_University'的节点\nlabel为organisation,属性name='Jambi_University'的节点\nlabel为place,属性name='Beni_Suef'的节点\nlabel为tag,属性name='Bing_Crosby'的节点\nlabel为tag,属性name='Jibbs_Featuring_Jibbs'的节点\nlabel为tag,属性name='Hyder_Ali'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找居住在Chibi的所有人的生日、位置IP、性别、浏览器使用情况、名字、创建日期、id以及Chibi的id",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n2.name='Chibi' return n1.birthday, n1.locationip, n1.gender, n1.browserused, n1.firstname, n1.creationdate, n1.id, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Vardhman_Mahavir_Medical_College'的节点\nlabel为organisation,属性name='Hogeschool_van_Amsterdam'的节点\nlabel为organisation,属性name='Deen_Dayal_Upadhyaya_College'的节点\nlabel为tag,属性name='David_Villa'的节点\nlabel为tag,属性name='David_Weber'的节点\nlabel为tag,属性name='David_H._DePatie'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Mthatha的David所使用的浏览器信息和他的名字",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n2.name='Mthatha' and n1.firstname='David' return n1.firstname, n1.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Reutlingen_University'的节点\nlabel为organisation,属性name='Farnair_Switzerland'的节点\nlabel为organisation,属性name='Rudolf_Steiner_University_College'的节点\nlabel为place,属性name='Freiburg_im_Breisgau'的节点\nlabel为tag,属性name='Lars_von_Trier'的节点\nlabel为tag,属性name='Fritz_Lang'的节点\nlabel为tag,属性name='Trent_Reznor'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名叫Franz且位于Reutlingen的人的详细信息，包括地点名称、人ID、IP地址、语言、关系创建日期、名、性别、地点URL、浏览器使用情况、姓氏、地点ID和生日，并按地点名称排序。",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n1.firstname='Franz' and n2.name='Reutlingen' return n2.name, n1.id, n1.locationip, n1.language, r1.creationdate, n1.firstname, n1.gender, n2.url, n1.browserused, n1.lastname, n2.id, n1.birthday order by n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Kevin_Rudd in Zhukovsky'的节点\nlabel为forum,属性title='Group for Kevin_Rudd in Zhukovsky'的节点\nlabel为forum,属性title='Group for Kevin_Rudd in Zhukovsky'的节点\nlabel为organisation,属性name='Zaoksky_Adventist_University'的节点\nlabel为organisation,属性name='Kozminski_University'的节点\nlabel为organisation,属性name='Adam_Mickiewicz_University_in_Poznań'的节点\nlabel为place,属性name='Zhukovsky'的节点\nlabel为place,属性name='Moscow_International_Business_Center'的节点\nlabel为tag,属性name='Józef_Piłsudski'的节点\nlabel为tag,属性name='Slavoj_Žižek'的节点\nlabel为tag,属性name='Ivan_Ljubičić'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找位于Zhukovsky的所有人的姓名、使用的浏览器、电子邮件、生日、性别、创建日期以及他们的id，同时返回Zhukovsky的名称、id和URL，以及关系的创建日期。",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n2.name='Zhukovsky' return n2.name, n2.id, n1.lastname, n1.browserused, n1.email, n1.birthday, n2.url, n1.id, r1.creationdate, n1.gender, n1.creationdate, n1.firstname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Federal_Urdu_University'的节点\nlabel为organisation,属性name='San_Francisco_State_University'的节点\nlabel为organisation,属性name='University_of_Flensburg'的节点\nlabel为place,属性name='Freiburg_im_Breisgau'的节点\nlabel为place,属性name='http://maps.google.com/maps?ll=25.530889,69.017306&spn=0.01,0.01&t=m&q=25.530889,69.017306'的节点\nlabel为place,属性name='Fuling_District'的节点\nlabel为tag,属性name='Michael_J._Fox'的节点\nlabel为tag,属性name='Felix_Frankfurter'的节点\nlabel为tag,属性name='Yankee_Hotel_Foxtrot'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Frank的人所在地点的URL，创建日期，地点名称和使用的浏览器，按地点名称降序排列，返回前3个结果",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n1.firstname='Frank' return n2.url, n1.creationdate, n2.name, n1.browserused order by n2.name desc limit 3"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Memorial_Address'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名字为R.的人及其所在地点的信息，包括人的浏览器使用情况、生日、名字、电子邮件、姓氏、性别、创建日期、ID、语言、位置IP，以及地点的ID、名称、URL和关系的创建日期，限制返回14条记录。",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n1.firstname='R.' return n2.id, n1.browserused, n1.birthday, n2.name, n1.firstname, n1.email, n1.lastname, n1.gender, n1.creationdate, n1.id, n1.language, n2.url, n1.locationip, r1.creationdate limit 14"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for John_Edward_Gray in Loikaw'的节点\nlabel为forum,属性title='Group for Miguel_de_Cervantes in Rio_de_Janeiro'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为organisation,属性name='State_University_of_Gorontalo'的节点\nlabel为organisation,属性name='Jorge_Tadeo_Lozano_University'的节点\nlabel为organisation,属性name='Gachongil_College'的节点\nlabel为person,属性firstname='Grigore'的节点\nlabel为place,属性name='Campos_dos_Goytacazes'的节点\nlabel为place,属性name='San_Nicolás_de_los_Garza'的节点\nlabel为place,属性name='Chorrillos_District'的节点\nlabel为tag,属性name='Giorgio_de_Chirico'的节点\nlabel为tag,属性name='George_I_of_Greece'的节点\nlabel为tag,属性name='Nikolai_Gogol'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Gregorio的人的语言信息",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n1.firstname='Gregorio' return n1.language"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Chen_Shui-bian in Dar_es_Salaam'的节点\nlabel为organisation,属性name='Dr._Ambedkar_Government_Law_College,_Chennai'的节点\nlabel为organisation,属性name='Anna_University,_Chennai'的节点\nlabel为organisation,属性name='Mohammad_Ali_Jinnah_University'的节点\nlabel为tag,属性name='Ahmad_Shah_Durrani'的节点\nlabel为tag,属性name='Dani_California'的节点\nlabel为tag,属性name='Hyder_Ali'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Chen且位于Dali的人员的姓名、创建日期、使用的浏览器、所在地点名称、姓氏、人员ID和地点ID，最多返回2条结果",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n1.firstname='Chen' and n2.name='Dali' return n1.firstname, n1.creationdate, n1.browserused, n2.name, n1.lastname, n1.id, n2.id limit 2"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Georg_Wilhelm_Friedrich_Hegel in Tarakan'的节点\nlabel为forum,属性title='Group for Mstislav_Rostropovich in Moscow'的节点\nlabel为forum,属性title='Group for Mstislav_Rostropovich in Moscow'的节点\nlabel为organisation,属性name='Grozny_Avia'的节点\nlabel为organisation,属性name='Shevchenko_Transnistria_State_University'的节点\nlabel为organisation,属性name='Gorno-Altaisk_State_University'的节点\nlabel为person,属性firstname='Geremi Sorele Njitap'的节点\nlabel为person,属性firstname='Geremi Sorele Njitap'的节点\nlabel为place,属性name='Bosnia_and_Herzegovina'的节点\nlabel为place,属性name='Hradec_Králové'的节点\nlabel为place,属性name='Moscow_International_Business_Center'的节点\nlabel为tag,属性name='Live_in_Gdańsk'的节点\nlabel为tag,属性name='Tomáš_Garrigue_Masaryk'的节点\nlabel为tag,属性name='George_I_of_Greece'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找位于Târgoviște的名为Gheorghe的人的id、位置名、语言、IP地址、创建日期、关系创建日期、生日、电子邮件和名字，限制返回18条记录",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n2.name='Târgoviște' and n1.firstname='Gheorghe' return n1.id, n2.name, n1.language, n1.locationip, n1.creationdate, r1.creationdate, n1.birthday, n1.email, n1.firstname limit 18"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Aung_San_Suu_Kyi in Quezon_City'的节点\nlabel为forum,属性title='Group for Aung_San_Suu_Kyi in Quezon_City'的节点\nlabel为forum,属性title='Group for John_Lennon in Chaozhou'的节点\nlabel为organisation,属性name='An_Giang_University'的节点\nlabel为organisation,属性name='Ching_Yun_University'的节点\nlabel为organisation,属性name='Chung-Ang_University'的节点\nlabel为place,属性name='Yongkang_District'的节点\nlabel为place,属性name='Songjiang_District'的节点\nlabel为place,属性name='Quezon_City'的节点\nlabel为tag,属性name='New_Joc_City'的节点\nlabel为tag,属性name='New_Jack_City_II'的节点\nlabel为tag,属性name='Live_in_Chicago_12.19.98_at_the_United_Center'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Jun且位于Cangzhou的人所在的地点的id，最多返回13个结果",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n1.firstname='Jun' and n2.name='Cangzhou' return n2.id limit 13"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Friedrich_Nietzsche in Poznań'的节点\nlabel为forum,属性title='Wall of Zdenek Herzigová'的节点\nlabel为forum,属性title='Album 4 of Zdenek Balcar'的节点\nlabel为organisation,属性name='Zaoksky_Adventist_University'的节点\nlabel为organisation,属性name='University_of_Szczecin'的节点\nlabel为organisation,属性name='Adam_Mickiewicz_University_in_Poznań'的节点\nlabel为person,属性firstname='Zdenek'的节点\nlabel为person,属性firstname='Zdenek'的节点\nlabel为place,属性name='Hradec_Králové'的节点\nlabel为tag,属性name='Lutka_sa_naslovne_strane'的节点\nlabel为tag,属性name='Chechen_Republic_of_Ichkeria'的节点\nlabel为tag,属性name='Zakk_Wylde'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Zdenek且位于Hradec Králové的人所在地点的网址，最多返回4个结果",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n1.firstname='Zdenek' and n2.name='Hradec_Králové' return n2.url limit 4"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Robert_Louis_Stevenson in Poznań'的节点\nlabel为forum,属性title='Group for Robert_Redford in Ljubljana'的节点\nlabel为forum,属性title='Group for Aung_San_Suu_Kyi in Dnipropetrovsk'的节点\nlabel为organisation,属性name='Rovaniemi_University_of_Applied_Sciences'的节点\nlabel为organisation,属性name='Shevchenko_Transnistria_State_University'的节点\nlabel为organisation,属性name='Ivanovo_State_University_of_Chemistry_and_Technology'的节点\nlabel为place,属性name='Ivanovo_Oblast'的节点\nlabel为place,属性name='Sittwe_District'的节点\nlabel为place,属性name='Ústí_nad_Labem'的节点\nlabel为tag,属性name='Somdev_Devvarman'的节点\nlabel为tag,属性name='Soba_ni_Iru_ne'的节点\nlabel为tag,属性name='Nedumudi_Venu'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名叫Sven且位于Rovaniemi的人所在的地点的id",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n2.name='Rovaniemi' and n1.firstname='Sven' return n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Sardar_Patel_University'的节点\nlabel为organisation,属性name='Sardar_Patel_University'的节点\nlabel为organisation,属性name='Dhurakij_Pundit_University'的节点\nlabel为tag,属性name='Denis_Diderot'的节点\nlabel为tag,属性name='Genesis_1976–1982'的节点\nlabel为tag,属性name='Adil_Shahi_dynasty'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名字为Dith且位于Pursat的人的创建日期和使用的浏览器，最多返回11条结果",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n1.firstname='Dith' and n2.name='Pursat' return n1.creationdate, n1.browserused limit 11"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Robert_Louis_Stevenson in Poznań'的节点\nlabel为forum,属性title='Group for Ruhollah_Khomeini in Lubbock'的节点\nlabel为forum,属性title='Group for Robert_Redford in Ljubljana'的节点\nlabel为organisation,属性name='Faculty_of_Administration,_Ljubljana'的节点\nlabel为organisation,属性name='University_of_Ljubljana'的节点\nlabel为organisation,属性name='Faculty_of_Economics,_Ljubljana'的节点\nlabel为place,属性name='Mladá_Boleslav'的节点\nlabel为tag,属性name='Lutka_sa_naslovne_strane'的节点\nlabel为tag,属性name='Stanisław_Leszczyński'的节点\nlabel为tag,属性name='Ivan_Ljubičić'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找位于Ljubljana的人的名、使用的浏览器和Ljubljana的名称",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n2.name='Ljubljana' return n1.firstname, n1.browserused, n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='IE_Business_School'的节点\nlabel为organisation,属性name='Mekelle_Institute_of_Technology'的节点\nlabel为organisation,属性name='WebJet_Linhas_Aéreas'的节点\nlabel为tag,属性name='Eenie_Meenie'的节点\nlabel为tag,属性name='Take_Me_Home,_Country_Roads'的节点\nlabel为tag,属性name='We_Global'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Mee的人使用的浏览器、id、姓氏、位置IP、所在地点的名称和URL，以及他们的语言，并按地点名称排序",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n1.firstname='Mee' return n1.browserused, n1.id, n1.lastname, n1.locationip, n2.name, n2.url, n1.language order by n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Bing_Crosby in Belgorod'的节点\nlabel为forum,属性title='Group for Sergei_Eisenstein in Bijie'的节点\nlabel为organisation,属性name='Shahid_Beheshti_University'的节点\nlabel为organisation,属性name='José_Rizal_University'的节点\nlabel为organisation,属性name='Bashkir_State_University'的节点\nlabel为place,属性name='Bab_Ezzouar'的节点\nlabel为tag,属性name='Pedro_I_of_Brazil'的节点\nlabel为tag,属性name='No_Me_Dejes_de_Querer'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名字为Bechir的人所在地点的id，该人的id，关系的创建日期，该人的语言，浏览器以及姓氏，限制返回4条结果",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n1.firstname='Bechir' return n2.id, n1.id, r1.creationdate, n1.language, n1.browserused, n1.lastname limit 4"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='University_College_Utrecht'的节点\nlabel为organisation,属性name='Aurel_Vlaicu_University_of_Arad'的节点\nlabel为organisation,属性name='German_School_of_Athens'的节点\nlabel为tag,属性name='André_Gide'的节点\nlabel为tag,属性name='Du_&_jag_döden'的节点\nlabel为tag,属性name='Konrad_Adenauer'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找居住在Utrecht且名字为Aad De的人的语言、出生日期、性别、创建日期，以及Utrecht的名称和id，同时返回关系的创建日期",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n2.name='Utrecht' and n1.firstname='Aad De' return n1.language, n2.name, n2.id, n1.birthday, n1.gender, n1.creationdate, r1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Patrick_Vieira in Insein_Township'的节点\nlabel为forum,属性title='Group for Rafael_Nadal in Visonta'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为organisation,属性name='University_of_Pretoria'的节点\nlabel为organisation,属性name='Prafulla_Chandra_College'的节点\nlabel为organisation,属性name='Petra_University'的节点\nlabel为person,属性firstname='Bona Pinder Yayumayalolo'的节点\nlabel为place,属性name='Lagoa_da_Prata'的节点\nlabel为place,属性name='Pinar_del_Río'的节点\nlabel为place,属性name='Presidencia_Roque_Sáenz_Peña'的节点\nlabel为tag,属性name='Giovanni_Pierluigi_da_Palestrina'的节点\nlabel为tag,属性name='Mrtva_priroda'的节点\nlabel为tag,属性name='Regina_Spektor'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找位于Pretoria的人的姓氏和Pretoria的id",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n2.name='Pretoria' return n1.lastname, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Federal_Urdu_University'的节点\nlabel为organisation,属性name='Federal_University_of_Uberlândia'的节点\nlabel为organisation,属性name='Dhurakij_Pundit_University'的节点\nlabel为place,属性name='Freiburg_im_Breisgau'的节点\nlabel为tag,属性name='Dick_Van_Dyke'的节点\nlabel为tag,属性name='Roger_Federer'的节点\nlabel为tag,属性name='Greg_Rusedski'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Frederick且位于Unguja的人的信息，包括人的id、创建日期、生日、名字、姓氏、电子邮件、语言、浏览器使用情况、位置IP、性别，以及地点的id、URL和名称，并按地点名称排序。",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n1.firstname='Frederick' and n2.name='Unguja' return n1.id, n1.creationdate, n2.id, n1.birthday, n1.firstname, n1.lastname, n1.email, n1.language, n2.url, n2.name, n1.browserused, n1.locationip, r1.creationdate, n1.gender order by n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Mstislav_Rostropovich in Moscow'的节点\nlabel为forum,属性title='Group for Mstislav_Rostropovich in Moscow'的节点\nlabel为organisation,属性name='Adam_Mickiewicz_University_in_Poznań'的节点\nlabel为organisation,属性name='University_of_South_Bohemia_in_České_Budějovice'的节点\nlabel为organisation,属性name='Comenius_University_in_Bratislava'的节点\nlabel为place,属性name='České_Budějovice'的节点\nlabel为place,属性name='Moscow_International_Business_Center'的节点\nlabel为place,属性name='Mladá_Boleslav'的节点\nlabel为tag,属性name='Peter_Bogdanovich'的节点\nlabel为tag,属性name='Józef_Piłsudski'的节点\nlabel为tag,属性name='Nicholas_I_of_Russia'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找居住在České_Budějovice的人的生日、地点id、地点名称、创建日期、使用的浏览器、名字、性别、关系创建日期、语言、IP地址、地点URL、人id和邮箱，并按地点名称降序排列。",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n2.name='České_Budějovice' return n1.birthday, n2.id, n2.name, n1.creationdate, n1.browserused, n1.firstname, n1.gender, r1.creationdate, n1.language, n1.locationip, n2.url, n1.id, n1.email order by n2.name desc"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Rafael_Nadal in Visonta'的节点\nlabel为organisation,属性name='Jorge_A._Sabato_institute'的节点\nlabel为organisation,属性name='Sri_Sathya_Sai_University'的节点\nlabel为organisation,属性name='Sree_Chaitanya_College'的节点\nlabel为place,属性name='Sittwe_District'的节点\nlabel为place,属性name='Feira_de_Santana'的节点\nlabel为tag,属性name='Santiago_Ventura_Bertomeu'的节点\nlabel为tag,属性name='Shilpa_Shetty'的节点\nlabel为tag,属性name='Satavahana_dynasty'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Shweta且位于Salem的人的详细信息，包括关系的创建日期、人的名字、电子邮件、出生日期、语言、姓氏和创建日期，以及地点的id和网址。",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n1.firstname='Shweta' and n2.name='Salem' return r1.creationdate, n1.firstname, n1.email, n2.id, n1.birthday, n2.url, n1.language, n1.lastname, n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Aditya_College'的节点\nlabel为organisation,属性name='Alexandria_Technical_and_Community_College'的节点\nlabel为organisation,属性name='Aliah_University'的节点\nlabel为tag,属性name='Alan_Alda'的节点\nlabel为tag,属性name='Alea_Jacta_Est'的节点\nlabel为tag,属性name='The_Downeaster_Alexa'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Aditya且位于Talcher的人的浏览器使用情况、电子邮件、所在地点的id、个人id、名、创建日期、语言、位置IP、所在地点的URL、生日、姓氏、关系的创建日期、性别和所在地点的名称",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n1.firstname='Aditya' and n2.name='Talcher' return n1.browserused, n1.email, n2.id, n1.id, n1.firstname, n1.creationdate, n1.language, n1.locationip, n2.url, n1.birthday, n1.lastname, r1.creationdate, n1.gender, n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为forum,属性title='Group for Mustafa_Kemal_Atatürk in Indianapolis'的节点\nlabel为organisation,属性name='Eskişehir_Osmangazi_University'的节点\nlabel为organisation,属性name='İzmir_University'的节点\nlabel为organisation,属性name='El_Asher_University'的节点\nlabel为place,属性name='Addis_Ababa'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为tag,属性name='Sher_Shah_Suri'的节点\nlabel为tag,属性name='Aga_Khan_IV'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找居住在Eskişehir的人的姓氏、关系的创建日期、电子邮件、居住地名称、生日、性别和使用的浏览器，并按居住地名称降序排列",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n2.name='Eskişehir' return n1.lastname, r1.creationdate, n1.email, n2.name, n1.birthday, n1.gender, n1.browserused order by n2.name desc"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Columbia_College'的节点\nlabel为organisation,属性name='Columbia_College'的节点\nlabel为organisation,属性name='Columbia_College'的节点\nlabel为place,属性name='Quezon_City'的节点\nlabel为tag,属性name='California_Über_Alles'的节点\nlabel为tag,属性name='Live_in_Chicago_12.19.98_at_the_United_Center'的节点\nlabel为tag,属性name='Profiles'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找位于Columbia的人的姓氏、使用的浏览器、名字、创建日期、Columbia的URL、人的生日、语言、Columbia的id、人的id和性别，限制返回19条记录",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n2.name='Columbia' return n1.lastname, n1.browserused, n1.firstname, n1.creationdate, n2.url, n1.birthday, n1.language, n2.id, n1.id, n1.gender limit 19"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Wall of Emperor of Brazil Nascimento'的节点\nlabel为forum,属性title='Album 21 of Emperor of Brazil Dom Pedro II'的节点\nlabel为forum,属性title='Album 20 of Emperor of Brazil Dom Pedro II'的节点\nlabel为organisation,属性name='Sergio_Arboleda_University'的节点\nlabel为organisation,属性name='Universidad_del_Salvador'的节点\nlabel为organisation,属性name='Simón_Bolívar_University'的节点\nlabel为place,属性name='Distrito_de_Bellavista'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为place,属性name='Presidencia_Roque_Sáenz_Peña'的节点\nlabel为tag,属性name='Pedro_I_of_Brazil'的节点\nlabel为tag,属性name='Maria_I_of_Portugal'的节点\nlabel为tag,属性name='Manuel_I_of_Portugal'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Emperor of Brazil且位于Santa Maria的人的创建日期、位置IP、所在地点名称、使用的浏览器、姓氏和语言，最多返回20条记录",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n1.firstname='Emperor of Brazil' and n2.name='Santa_Maria' return n1.creationdate, n1.locationip, n2.name, n1.browserused, n1.lastname, n1.language limit 20"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Cairo_University'的节点\nlabel为organisation,属性name='Cairo_Aviation'的节点\nlabel为organisation,属性name='American_University_in_Cairo'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找居住在New Cairo的所有人的生日、语言、id、创建日期、位置关系的创建日期、地点名称、浏览器使用情况、地点id、名字、邮箱、网址、姓氏、性别和IP地址",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n2.name='New_Cairo' return n1.birthday, n1.language, n1.id, n1.creationdate, r1.creationdate, n2.name, n1.browserused, n2.id, n1.firstname, n1.email, n2.url, n1.lastname, n1.gender, n1.locationip"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for You_Found_Me in Kolkata'的节点\nlabel为forum,属性title='Group for Mustafa_Kemal_Atatürk in Indianapolis'的节点\nlabel为forum,属性title='Group for Mahmud_of_Ghazni in Raniganj'的节点\nlabel为organisation,属性name='Mohammad_Ali_Jinnah_University'的节点\nlabel为organisation,属性name='Maharaja_Manindra_Chandra_College'的节点\nlabel为organisation,属性name='Rani_Dhanya_Kumari_College'的节点\nlabel为person,属性firstname='Madan Krishna'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为place,属性name='Larkana_District'的节点\nlabel为place,属性name='Manokwari_Regency'的节点\nlabel为tag,属性name='Mohandas_Karamchand_Gandhi'的节点\nlabel为tag,属性name='Mahinda_Rajapaksa'的节点\nlabel为tag,属性name='Muhammad_Ali_Jinnah'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Mahinda且位于Kelaniya的人的生日、id、语言、名、创建日期、姓、邮箱、位置IP，以及该地点的id和名称、URL",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n1.firstname='Mahinda' and n2.name='Kelaniya' return n1.birthday, n1.id, n1.language, n1.firstname, n2.id, n1.creationdate, n1.lastname, n1.email, n1.locationip, n2.name, n2.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for John_Edward_Gray in Loikaw'的节点\nlabel为forum,属性title='Group for Albert_Günther in Loikaw'的节点\nlabel为forum,属性title='Group for Radek_Štěpánek in Orlando'的节点\nlabel为organisation,属性name='Computer_University,_Loikaw'的节点\nlabel为organisation,属性name='Ramon_Llull_University'的节点\nlabel为organisation,属性name='Anoka-Ramsey_Community_College'的节点\nlabel为tag,属性name='David_Rikl'的节点\nlabel为tag,属性name='Derek_Lowe'的节点\nlabel为tag,属性name='Lex_Luger'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Loikaw居住且名为Eric的人的性别、位置信息、名、姓、URL、ID、创建日期、浏览器使用情况和生日，同时返回关系的创建日期",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n2.name='Loikaw' and n1.firstname='Eric' return n1.gender, r1.creationdate, n1.locationip, n1.firstname, n1.lastname, n2.url, n1.id, n2.name, n1.creationdate, n1.browserused, n1.birthday"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Maulana_Azad_College'的节点\nlabel为organisation,属性name='Davangere_University'的节点\nlabel为organisation,属性name='Avadh_University'的节点\nlabel为tag,属性name='Azad_Hind'的节点\nlabel为tag,属性name='Arif_Mardin'的节点\nlabel为tag,属性name='Alan_Ladd'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Aad De且位于Maastricht的人的创建日期、电子邮件、语言、位置的URL、位置的id、人的id、关系的创建日期、名、姓、使用的浏览器、生日和性别",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n1.firstname='Aad De' and n2.name='Maastricht' return n1.creationdate, n1.email, n1.language, n2.url, n2.id, n1.id, r1.creationdate, n1.firstname, n1.lastname, n1.browserused, n1.birthday, n1.gender"
    }
]