[
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 1 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 1 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 31 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Fatehgarh_Sahib'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\nlabel为tag,属性name='The_Help_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 1 of Hossein Forouhar的创建日期、标题和id，最多返回5条结果",
        "output": "match (n1:forum)  where n1.title='Album 1 of Hossein Forouhar' return n1.creationdate, n1.title, n1.id limit 5"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 2 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 2 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 22 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Al_Jamea_tus_Saifiyah'的节点\nlabel为organisation,属性name='Al_Jamea_tus_Saifiyah'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Halo_2_Original_Soundtrack'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 2 of Hossein Forouhar的创建日期",
        "output": "match (n1:forum)  where n1.title='Album 2 of Hossein Forouhar' return n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 4 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 4 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 14 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Qazvin_Islamic_Azad_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Al_Hudaydah'的节点\nlabel为place,属性name='El_Oued'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='The_Help_Album'的节点\nlabel为tag,属性name='Hussein_of_Jordan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 4 of Hossein Forouhar的id",
        "output": "match (n1:forum)  where n1.title='Album 4 of Hossein Forouhar' return n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 5 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 5 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 5 of Ebrahim Forouhar'的节点\nlabel为organisation,属性name='Madarastul_Falaah_Kibra'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Al_Jamea_tus_Saifiyah'的节点\nlabel为place,属性name='El_Oued'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Glee:_The_Music,_Volume_5'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='Endless_Harmony_Soundtrack'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 5 of Hossein Forouhar的标题",
        "output": "match (n1:forum)  where n1.title='Album 5 of Hossein Forouhar' return n1.title"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 6 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 6 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 26 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Al_Jamea_tus_Saifiyah'的节点\nlabel为organisation,属性name='Al_Jamea_tus_Saifiyah'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='Glee:_The_Music,_Volume_6'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 6 of Hossein Forouhar的创建日期",
        "output": "match (n1:forum)  where n1.title='Album 6 of Hossein Forouhar' return n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 7 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 7 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 17 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Sindh_Madrasatul_Islam'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Al_Hudaydah'的节点\nlabel为place,属性name='Fatehgarh_Sahib'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='Mohammed_Zahir_Shah'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 7 of Hossein Forouhar的创建日期、id和标题",
        "output": "match (n1:forum)  where n1.title='Album 7 of Hossein Forouhar' return n1.creationdate, n1.id, n1.title"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 8 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 8 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 28 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Fatehgarh_Sahib'的节点\nlabel为place,属性name='Al_Hudaydah'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='Mohammed_Zahir_Shah'的节点\nlabel为tag,属性name='The_Help_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 8 of Hossein Forouhar的id、创建日期和标题",
        "output": "match (n1:forum)  where n1.title='Album 8 of Hossein Forouhar' return n1.id, n1.creationdate, n1.title"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 11 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 10 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 11 of Hassan Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Sindh_Madrasatul_Islam'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Al_Hudaydah'的节点\nlabel为place,属性name='Fatehgarh_Sahib'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='The_Help_Album'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 10 of Hossein Forouhar的创建日期、标题和id",
        "output": "match (n1:forum)  where n1.title='Album 10 of Hossein Forouhar' return n1.creationdate, n1.title, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 11 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 11 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 12 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Al_Jamea_tus_Saifiyah'的节点\nlabel为organisation,属性name='Al_Jamea_tus_Saifiyah'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='The_Capitol_Albums,_Volume_1'的节点\nlabel为tag,属性name='The_Help_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 11 of Hossein Forouhar的标题和创建日期",
        "output": "match (n1:forum)  where n1.title='Album 11 of Hossein Forouhar' return n1.title, n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 12 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 11 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 12 of Hassan Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Madarastul_Falaah_Kibra'的节点\nlabel为organisation,属性name='Al_Jamea_tus_Saifiyah'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Al_Hudaydah'的节点\nlabel为place,属性name='El_Mourouj'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='The_Barbra_Streisand_Album'的节点\nlabel为tag,属性name='The_Help_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找标题为Album 12 of Hossein Forouhar的论坛标题",
        "output": "match (n1:forum)  where n1.title='Album 12 of Hossein Forouhar' return n1.title"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 13 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 11 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 33 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Sindh_Madrasatul_Islam'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='New_Muslim_Town'的节点\nlabel为place,属性name='Fatehgarh_Sahib'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='The_Help_Album'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找标题为Album 13 of Hossein Forouhar的论坛，返回其标题，最多返回10条结果",
        "output": "match (n1:forum)  where n1.title='Album 13 of Hossein Forouhar' return n1.title limit 10"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 14 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 14 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 34 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Al_Jamea_tus_Saifiyah'的节点\nlabel为organisation,属性name='Al_Jamea_tus_Saifiyah'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='The_Help_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 14 of Hossein Forouhar的创建日期",
        "output": "match (n1:forum)  where n1.title='Album 14 of Hossein Forouhar' return n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 16 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 16 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 26 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Obirin_Junior_College'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Al_Hudaydah'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='The_Help_Album'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 16 of Hossein Forouhar的id和创建日期",
        "output": "match (n1:forum)  where n1.title='Album 16 of Hossein Forouhar' return n1.id, n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 17 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 17 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 27 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Ferdowsi_University_of_Mashhad'的节点\nlabel为organisation,属性name='Sindh_Madrasatul_Islam'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Bab_Ezzouar'的节点\nlabel为place,属性name='New_Muslim_Town'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='Pumping_on_Your_Stereo'的节点\nlabel为tag,属性name='Endless_Harmony_Soundtrack'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找标题为Album 17 of Hossein Forouhar的论坛标题",
        "output": "match (n1:forum)  where n1.title='Album 17 of Hossein Forouhar' return n1.title"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 18 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 18 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 28 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Sindh_Madrasatul_Islam'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Al_Hudaydah'的节点\nlabel为place,属性name='El_Oued'的节点\nlabel为tag,属性name='Music_for_18_Musicians'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='The_Help_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 18 of Hossein Forouhar的标题、id和创建日期",
        "output": "match (n1:forum)  where n1.title='Album 18 of Hossein Forouhar' return n1.title, n1.id, n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 19 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 19 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 21 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Al_Jamea_tus_Saifiyah'的节点\nlabel为organisation,属性name='Al_Jamea_tus_Saifiyah'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Fatehgarh_Sahib'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='The_Barbra_Streisand_Album'的节点\nlabel为tag,属性name='The_Help_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 19 of Hossein Forouhar的创建日期和标题",
        "output": "match (n1:forum)  where n1.title='Album 19 of Hossein Forouhar' return n1.creationdate, n1.title"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 21 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 22 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 22 of Hassan Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Sindh_Madrasatul_Islam'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='El_Oued'的节点\nlabel为place,属性name='Al_Hudaydah'的节点\nlabel为tag,属性name='The_Help_Album'的节点\nlabel为tag,属性name='The_Bodyguard:_Original_Soundtrack_Album'的节点\nlabel为tag,属性name='Waiting_to_Exhale:_Original_Soundtrack_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 22 of Hossein Forouhar的标题和id，仅返回一条结果",
        "output": "match (n1:forum)  where n1.title='Album 22 of Hossein Forouhar' return n1.title, n1.id limit 1"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 23 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 23 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 27 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Sindh_Madrasatul_Islam'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Al_Hudaydah'的节点\nlabel为place,属性name='Fatehgarh_Sahib'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='The_Help_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 23 of Hossein Forouhar的创建日期、id和标题",
        "output": "match (n1:forum)  where n1.title='Album 23 of Hossein Forouhar' return n1.creationdate, n1.id, n1.title"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 24 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 24 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 34 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Jamal_Mohamed_College'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Al_Hudaydah'的节点\nlabel为tag,属性name='The_Help_Album'的节点\nlabel为tag,属性name='The_Bodyguard:_Original_Soundtrack_Album'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 24 of Hossein Forouhar的标题、id和创建日期",
        "output": "match (n1:forum)  where n1.title='Album 24 of Hossein Forouhar' return n1.title, n1.id, n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 25 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 25 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 31 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Jamal_Mohamed_College'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Al_Hudaydah'的节点\nlabel为place,属性name='Fatehgarh_Sahib'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='The_Help_Album'的节点\nlabel为tag,属性name='The_Bodyguard:_Original_Soundtrack_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 25 of Hossein Forouhar的标题、创建日期和id",
        "output": "match (n1:forum)  where n1.title='Album 25 of Hossein Forouhar' return n1.title, n1.creationdate, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 26 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 26 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 31 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Qazvin_Islamic_Azad_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Al_Hudaydah'的节点\nlabel为tag,属性name='The_Help_Album'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 26 of Hossein Forouhar的id、创建日期和标题",
        "output": "match (n1:forum)  where n1.title='Album 26 of Hossein Forouhar' return n1.id, n1.creationdate, n1.title"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 28 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 28 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 31 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Al_Jamea_tus_Saifiyah'的节点\nlabel为organisation,属性name='Al_Jamea_tus_Saifiyah'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='The_Help_Album'的节点\nlabel为tag,属性name='Music_for_18_Musicians'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 28 of Hossein Forouhar的标题和创建日期，限制返回15条结果",
        "output": "match (n1:forum)  where n1.title='Album 28 of Hossein Forouhar' return n1.title, n1.creationdate limit 15"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 29 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 29 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 31 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Al_Jamea_tus_Saifiyah'的节点\nlabel为organisation,属性name='Al_Jamea_tus_Saifiyah'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='The_Help_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 29 of Hossein Forouhar的创建日期",
        "output": "match (n1:forum)  where n1.title='Album 29 of Hossein Forouhar' return n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 30 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 31 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 33 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Sindh_Madrasatul_Islam'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Al_Hudaydah'的节点\nlabel为place,属性name='Fatehgarh_Sahib'的节点\nlabel为tag,属性name='The_Help_Album'的节点\nlabel为tag,属性name='Hussein_of_Jordan'的节点\nlabel为tag,属性name='Pharoah_Sanders'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 30 of Hossein Forouhar的id和标题",
        "output": "match (n1:forum)  where n1.title='Album 30 of Hossein Forouhar' return n1.id, n1.title"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 31 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 31 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 34 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Al_Jamea_tus_Saifiyah'的节点\nlabel为organisation,属性name='Al_Jamea_tus_Saifiyah'的节点\nlabel为person,属性firstname='Mamoon Eshaq 0'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='The_Capitol_Albums,_Volume_1'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 31 of Hossein Forouhar的标题和创建日期",
        "output": "match (n1:forum)  where n1.title='Album 31 of Hossein Forouhar' return n1.title, n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 32 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 31 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 32 of Hassan Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Sindh_Madrasatul_Islam'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Al_Hudaydah'的节点\nlabel为tag,属性name='The_Help_Album'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='The_Bodyguard:_Original_Soundtrack_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 32 of Hossein Forouhar的标题、创建日期和id",
        "output": "match (n1:forum)  where n1.title='Album 32 of Hossein Forouhar' return n1.title, n1.creationdate, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 34 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 24 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 31 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Sindh_Madrasatul_Islam'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Al_Hudaydah'的节点\nlabel为tag,属性name='The_Help_Album'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='The_Bodyguard:_Original_Soundtrack_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 34 of Hossein Forouhar的标题、id和创建日期",
        "output": "match (n1:forum)  where n1.title='Album 34 of Hossein Forouhar' return n1.title, n1.id, n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 35 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 31 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 34 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Sindh_Madrasatul_Islam'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Al_Hudaydah'的节点\nlabel为place,属性name='Fatehgarh_Sahib'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='The_Help_Album'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 35 of Hossein Forouhar的创建日期、id和标题",
        "output": "match (n1:forum)  where n1.title='Album 35 of Hossein Forouhar' return n1.creationdate, n1.id, n1.title"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Wall of Jan Zakrzewski'的节点\nlabel为forum,属性title='Wall of Andrzej Zakrzewski'的节点\nlabel为forum,属性title='Wall of Pawel Zakrzewski'的节点\nlabel为organisation,属性name='Zaoksky_Adventist_University'的节点\nlabel为organisation,属性name='Jan_Matejko_Academy_of_Fine_Arts'的节点\nlabel为organisation,属性name='Cardinal_Stefan_Wyszyński_University_in_Warsaw'的节点\nlabel为place,属性name='Ivanovo_Oblast'的节点\nlabel为tag,属性name='Daniel_Vacek'的节点\nlabel为tag,属性name='Slavoj_Žižek'的节点\nlabel为tag,属性name='Alexander_Vladimirovich_Volkov'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Wall of Jan Zakrzewski的id、创建日期和标题",
        "output": "match (n1:forum)  where n1.title='Wall of Jan Zakrzewski' return n1.id, n1.creationdate, n1.title"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Wall of Wojciech Ciesla'的节点\nlabel为forum,属性title='Wall of Witold Ciesla'的节点\nlabel为forum,属性title='Wall of Wojciech Kowalski'的节点\nlabel为organisation,属性name='Cardinal_Stefan_Wyszyński_University_in_Warsaw'的节点\nlabel为organisation,属性name='Vesalius_College'的节点\nlabel为organisation,属性name='Valahia_University_of_Târgovişte'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为tag,属性name='Władysław_IV_Vasa'的节点\nlabel为tag,属性name='Lech_Wałęsa'的节点\nlabel为tag,属性name='John_II_Casimir_Vasa'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Wall of Wojciech Ciesla的创建日期",
        "output": "match (n1:forum)  where n1.title='Wall of Wojciech Ciesla' return n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Wall of Ali Ferrer'的节点\nlabel为forum,属性title='Wall of Rafael Alves'的节点\nlabel为forum,属性title='Wall of Mohamed Ferrer'的节点\nlabel为organisation,属性name='Farley_Hall'的节点\nlabel为organisation,属性name='Favaloro_University'的节点\nlabel为organisation,属性name='Walter_Lemke_Department_of_Journalism'的节点\nlabel为tag,属性name='Over_the_Wall'的节点\nlabel为tag,属性name='Back_Against_the_Wall'的节点\nlabel为tag,属性name='Shadow_on_the_Wall'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Wall of Ali Ferrer的标题，最多返回14个结果",
        "output": "match (n1:forum)  where n1.title='Wall of Ali Ferrer' return n1.title limit 14"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Wall of Ahmad Zakii Lee'的节点\nlabel为forum,属性title='Wall of Ali Achiou'的节点\nlabel为forum,属性title='Album 6 of Ali Achiou'的节点\nlabel为organisation,属性name='Al_Akhawayn_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Maulana_Azad_College'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Jiaganj_Azimganj'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为tag,属性name='Adil_Shahi_dynasty'的节点\nlabel为tag,属性name='Hyder_Ali'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Wall of Ali Achiou的id和标题，最多返回6条记录",
        "output": "match (n1:forum)  where n1.title='Wall of Ali Achiou' return n1.id, n1.title limit 6"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 1 of Ali Achiou'的节点\nlabel为forum,属性title='Album 1 of Abida Ali'的节点\nlabel为forum,属性title='Album 0 of Ali Achiou'的节点\nlabel为organisation,属性name='Azim_Premji_University'的节点\nlabel为organisation,属性name='Al_Akhawayn_University'的节点\nlabel为organisation,属性name='Al-Ahliyya_Amman_University'的节点\nlabel为person,属性firstname='Abay Ibrahim'的节点\nlabel为person,属性firstname='Ahmad Zakii'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Jiaganj_Azimganj'的节点\nlabel为tag,属性name='The_Help_Album'的节点\nlabel为tag,属性name='Lyricist_Lounge,_Volume_One'的节点\nlabel为tag,属性name='Some_Bizzare_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 1 of Ali Achiou的id",
        "output": "match (n1:forum)  where n1.title='Album 1 of Ali Achiou' return n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 2 of Ali Achiou'的节点\nlabel为forum,属性title='Album 22 of Ali Achiou'的节点\nlabel为forum,属性title='Album 32 of Ali Achiou'的节点\nlabel为organisation,属性name='Al-Ahliyya_Amman_University'的节点\nlabel为organisation,属性name='Al_Akhawayn_University'的节点\nlabel为organisation,属性name='Baku_Academy_of_Music'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='The_Help_Album'的节点\nlabel为tag,属性name='Long_Play_Album'的节点\nlabel为tag,属性name='Some_Bizzare_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 2 of Ali Achiou的标题、id和创建日期",
        "output": "match (n1:forum)  where n1.title='Album 2 of Ali Achiou' return n1.title, n1.id, n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 3 of Ali Achiou'的节点\nlabel为forum,属性title='Album 33 of Ali Achiou'的节点\nlabel为forum,属性title='Album 23 of Ali Achiou'的节点\nlabel为organisation,属性name='Baku_Academy_of_Music'的节点\nlabel为organisation,属性name='Al-Ahliyya_Amman_University'的节点\nlabel为organisation,属性name='Yale_School_of_Music'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为tag,属性name='Third_Album'的节点\nlabel为tag,属性name='The_Help_Album'的节点\nlabel为tag,属性name='The_Memphis_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 3 of Ali Achiou的标题和创建日期",
        "output": "match (n1:forum)  where n1.title='Album 3 of Ali Achiou' return n1.title, n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 5 of Ali Achiou'的节点\nlabel为forum,属性title='Album 15 of Ali Achiou'的节点\nlabel为forum,属性title='Album 5 of Abdoulatifou Aly'的节点\nlabel为organisation,属性name='Anahuac_Mayab_University'的节点\nlabel为organisation,属性name='Baku_Academy_of_Music'的节点\nlabel为organisation,属性name='Al_Akhawayn_University'的节点\nlabel为tag,属性name='Glee:_The_Music,_Volume_5'的节点\nlabel为tag,属性name='The_Help_Album'的节点\nlabel为tag,属性name='5_Years_in_a_Livetime'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 5 of Ali Achiou的创建日期",
        "output": "match (n1:forum)  where n1.title='Album 5 of Ali Achiou' return n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 6 of Ali Achiou'的节点\nlabel为forum,属性title='Album 26 of Ali Achiou'的节点\nlabel为forum,属性title='Album 6 of Abida Ali'的节点\nlabel为organisation,属性name='Al-Ahliyya_Amman_University'的节点\nlabel为organisation,属性name='Baku_Academy_of_Music'的节点\nlabel为organisation,属性name='Al_Akhawayn_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Jiaganj_Azimganj'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为tag,属性name='The_Help_Album'的节点\nlabel为tag,属性name='The_Yes_Album'的节点\nlabel为tag,属性name='Some_Bizzare_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 6 of Ali Achiou的标题、创建日期和id",
        "output": "match (n1:forum)  where n1.title='Album 6 of Ali Achiou' return n1.title, n1.creationdate, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 7 of Ali Achiou'的节点\nlabel为forum,属性title='Album 27 of Ali Achiou'的节点\nlabel为forum,属性title='Album 17 of Ali Achiou'的节点\nlabel为organisation,属性name='Al_Akhawayn_University'的节点\nlabel为organisation,属性name='Baku_Academy_of_Music'的节点\nlabel为organisation,属性name='Amman_Arab_University'的节点\nlabel为tag,属性name='The_Help_Album'的节点\nlabel为tag,属性name='ABBA:_The_Album'的节点\nlabel为tag,属性name='The_Yes_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 7 of Ali Achiou的创建日期",
        "output": "match (n1:forum)  where n1.title='Album 7 of Ali Achiou' return n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 10 of Ali Achiou'的节点\nlabel为forum,属性title='Album 11 of Ali Achiou'的节点\nlabel为forum,属性title='Album 12 of Ali Achiou'的节点\nlabel为organisation,属性name='Al-Ahliyya_Amman_University'的节点\nlabel为organisation,属性name='Al_Akhawayn_University'的节点\nlabel为organisation,属性name='Maulana_Azad_College'的节点\nlabel为place,属性name='Addis_Ababa'的节点\nlabel为place,属性name='Anantapur_district'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='The_Help_Album'的节点\nlabel为tag,属性name='Richard_D._James_Album'的节点\nlabel为tag,属性name='ABBA:_The_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 10 of Ali Achiou的id和创建日期",
        "output": "match (n1:forum)  where n1.title='Album 10 of Ali Achiou' return n1.id, n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 11 of Ali Achiou'的节点\nlabel为forum,属性title='Album 12 of Ali Achiou'的节点\nlabel为forum,属性title='Album 31 of Ali Achiou'的节点\nlabel为organisation,属性name='Al_Akhawayn_University'的节点\nlabel为organisation,属性name='Al-Ahliyya_Amman_University'的节点\nlabel为organisation,属性name='Baku_Academy_of_Music'的节点\nlabel为tag,属性name='The_Help_Album'的节点\nlabel为tag,属性name='ABBA:_The_Album'的节点\nlabel为tag,属性name='The_Yes_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 11 of Ali Achiou的创建日期",
        "output": "match (n1:forum)  where n1.title='Album 11 of Ali Achiou' return n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 13 of Ali Achiou'的节点\nlabel为forum,属性title='Album 13 of Abdoulatifou Aly'的节点\nlabel为forum,属性title='Album 33 of Ali Achiou'的节点\nlabel为organisation,属性name='Al_Akhawayn_University'的节点\nlabel为organisation,属性name='Al-Ahliyya_Amman_University'的节点\nlabel为organisation,属性name='Yale_School_of_Music'的节点\nlabel为tag,属性name='The_Help_Album'的节点\nlabel为tag,属性name='ABBA:_The_Album'的节点\nlabel为tag,属性name='Third_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 13 of Ali Achiou的创建日期",
        "output": "match (n1:forum)  where n1.title='Album 13 of Ali Achiou' return n1.creationdate"
    }
]