[
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Kalitta_Charters'的节点\nlabel为organisation,属性name='Gulbarga_University'的节点\nlabel为organisation,属性name='Sardar_Patel_University'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Bal_Gangadhar_Tilak'的节点\nlabel为tag,属性name='Price_Tag'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与标签Gibraltar相关的帖子的长度、内容、创建日期和语言，并按标签名称降序排列，同时返回标签的名称、URL和ID",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='Gibraltar' return n2.name, n1.length, n2.url, n2.id, n1.language, n1.creationdate, n1.content order by n2.name desc"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Baiko_Gakuin_University'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Cygnus_X-1_duology'的节点\nlabel为tag,属性name='Goon_Affiliated'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找包含标签Xiongnu的帖子内容、长度、标签名称、发帖IP、图片文件、标签URL及使用的浏览器，并按标签名称降序排列",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='Xiongnu' return n1.content, n1.length, n2.name, n1.locationip, n1.imagefile, n2.url, n1.browserused order by n2.name desc"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 17 of Amjad Islam Ahsan'的节点\nlabel为forum,属性title='Album 17 of Mohamed Hassan'的节点\nlabel为forum,属性title='Album 17 of Mohamed Amsalem'的节点\nlabel为organisation,属性name='Mohammad_Ali_Jinnah_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Imam_Sadiq_University'的节点\nlabel为tag,属性name='Manmohan_Singh'的节点\nlabel为tag,属性name='Amar_Sin_Mentiras'的节点\nlabel为tag,属性name='Adil_Shahi_dynasty'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与标签Manmohan_Singh相关的帖子的id和url，限制返回17条结果",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='Manmohan_Singh' return n2.id, n2.url limit 17"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Price_Tag'的节点\nlabel为tag,属性name='W._B._Yeats'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与标签W. B. Yeats相关的帖子的标签名称、IP地址、创建日期、内容以及关联关系的创建日期",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='W._B._Yeats' return n2.name, n1.locationip, n1.creationdate, n1.content, r1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Joseph_Haydn in Solapur'的节点\nlabel为organisation,属性name='Sahid_Khudiram_Siksha_Prangan'的节点\nlabel为organisation,属性name='Silpakorn_University'的节点\nlabel为organisation,属性name='Silpakorn_University'的节点\nlabel为tag,属性name='Paradorn_Srichaphan'的节点\nlabel为tag,属性name='Philip_Sheridan'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找包含标签Paradorn_Srichaphan的帖子的信息，包括关系的创建日期、帖子的语言、图片文件、标签名称、帖子的创建日期、位置IP、浏览器信息、长度、标签的id和URL",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='Paradorn_Srichaphan' return r1.creationdate, n1.language, n1.imagefile, n2.name, n1.creationdate, n1.locationip, n1.browserused, n1.length, n2.id, n2.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='DG_Vaishnav_College'的节点\nlabel为organisation,属性name='Link_Campus_University'的节点\nlabel为organisation,属性name='Virginia_Union_University'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='WWF_Forceable_Entry'的节点\nlabel为tag,属性name='Laura_Ingalls_Wilder'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与标签Virginia Woolf相关联的帖子的id，以及该标签的名称和URL，还有关联关系的创建日期",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='Virginia_Woolf' return n1.id, n2.name, n2.url, r1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Andrew_Jackson_High_School'的节点\nlabel为organisation,属性name='Daniel_Payne_College'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Alan_Jackson'的节点\nlabel为tag,属性name='Andrew_Jackson'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找包含标签Andrew_Jackson的帖子的语言、图片文件、标签id、帖子的创建日期、位置IP、长度、帖子id、标签URL和标签名称",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='Andrew_Jackson' return n1.language, n1.imagefile, n2.id, n1.creationdate, n1.locationip, n1.length, n1.id, n2.url, n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Robert_Louis_Stevenson in Poznań'的节点\nlabel为organisation,属性name='Paul_Sabatier_University'的节点\nlabel为organisation,属性name='Diego_Portales_University'的节点\nlabel为organisation,属性name='Servicio_de_Publicaciones'的节点\nlabel为tag,属性name='George_S._Patton'的节点\nlabel为tag,属性name='Paul_Gascoigne'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找包含标签George_S._Patton的帖子的内容和语言",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='George_S._Patton' return n1.content, n1.language"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Jose_Maria_Agurrie_T9'的节点\nlabel为organisation,属性name='Jean_Moulin_University_Lyon_3'的节点\nlabel为organisation,属性name='Walter_Lemke_Department_of_Journalism'的节点\nlabel为tag,属性name='Wyclef_Jean'的节点\nlabel为tag,属性name='One_After_909'的节点\nlabel为tag,属性name='Jeff_Lynne'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n跳过第一条记录，查找与标签Wyclef_Jean相关的帖子的语言、创建日期和长度，返回接下来的9条记录",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='Wyclef_Jean' return n1.language, n1.creationdate, n1.length skip 1 limit 9"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Western_Satraps'的节点\nlabel为tag,属性name='Price_Tag'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与标签Spinning_Around相关的帖子的内容、图片文件、长度、语言、IP地址、使用的浏览器、创建日期，以及标签的名称、ID和URL，按标签名称降序排列，限制返回17条结果。",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='Spinning_Around' return n2.name, n1.content, n1.imagefile, n2.id, n1.id, n1.length, n1.language, n1.locationip, n1.browserused, n2.url, n1.creationdate, r1.creationdate order by n2.name desc limit 17"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Hex_Enduction_Hour'的节点\nlabel为tag,属性name='Price_Tag'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与标签Hex_Enduction_Hour相关的帖子的长度、创建日期、标签的URL、帖子的图片文件、位置IP、标签的ID和名称、帖子的内容、使用的浏览器、关系的创建日期以及帖子的语言。",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='Hex_Enduction_Hour' return n1.length, n1.creationdate, n2.url, n1.imagefile, n1.locationip, n2.id, n2.name, n1.content, n1.browserused, r1.creationdate, n1.language"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Sahid_Khudiram_Siksha_Prangan'的节点\nlabel为organisation,属性name='Pandit_Sundarlal_Sharma_University'的节点\nlabel为organisation,属性name='Bidhan_Chandra_College,_Asansol'的节点\nlabel为tag,属性name='Paradorn_Srichaphan'的节点\nlabel为tag,属性name='Prithviraj_Sukumaran'的节点\nlabel为tag,属性name='Philip_Sheridan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与标签Paradorn Srichaphan相关的帖子的IP地址、语言、关系的创建日期、帖子的创建日期、使用的浏览器、标签的id和名称、帖子的图片文件、帖子的id、内容和标签的URL，限制返回16条结果。",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='Paradorn_Srichaphan' return n1.locationip, n1.language, r1.creationdate, n1.creationdate, n1.browserused, n2.id, n2.name, n1.imagefile, n1.id, n1.content, n2.url limit 16"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Price_Tag'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与Namibia标签关联的帖子的信息，包括图片文件、使用的浏览器、语言、标签名称、位置IP、关系创建日期、内容、标签URL、标签ID、帖子创建日期和长度",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='Namibia' return n1.imagefile, n1.browserused, n1.language, n2.name, n1.locationip, r1.creationdate, n1.content, n2.url, n2.id, n1.creationdate, n1.length"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Salem_International_University'的节点\nlabel为organisation,属性name='Imam_Sadiq_University'的节点\nlabel为organisation,属性name='Shivani_Institute_of_Technology'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='In_Search_of_Sunrise_6:_Ibiza'的节点\nlabel为tag,属性name='My_Back_Pages'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找包含标签Somalia的帖子的id、使用的浏览器、内容、标签id、创建日期和IP地址，最多返回6条结果",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='Somalia' return n1.id, n1.browserused, n1.content, n2.id, n1.creationdate, n1.locationip limit 6"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Joseph_Haydn in Solapur'的节点\nlabel为organisation,属性name='Sahid_Khudiram_Siksha_Prangan'的节点\nlabel为organisation,属性name='Sardar_Patel_University'的节点\nlabel为organisation,属性name='Sardar_Patel_University'的节点\nlabel为place,属性name='Sahiwal_Division'的节点\nlabel为place,属性name='Feira_de_Santana'的节点\nlabel为place,属性name='Pathum_Thani'的节点\nlabel为tag,属性name='Paradorn_Srichaphan'的节点\nlabel为tag,属性name='Philip_Sheridan'的节点\nlabel为tag,属性name='Prithviraj_Sukumaran'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与标签Paradorn_Srichaphan相关的帖子的长度、图片文件、内容和关联关系的创建日期，并按标签名称降序排列",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='Paradorn_Srichaphan' return n2.name, n1.length, n1.imagefile, n1.content, r1.creationdate order by n2.name desc"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Iggy_Pop'的节点\nlabel为tag,属性name='Price_Tag'的节点\nlabel为tag,属性name='Teddy_Picker'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找包含标签Iggy_Pop的帖子的长度、创建日期、图片文件、语言、关联关系的创建日期、内容、位置IP、帖子ID、标签URL、标签ID和浏览器使用情况",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='Iggy_Pop' return n1.length, n1.creationdate, n1.imagefile, n1.language, r1.creationdate, n1.content, n1.locationip, n1.id, n2.url, n1.browserused, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='DG_Vaishnav_College'的节点\nlabel为tag,属性name='Tiger_Woods'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='The_Grind_Date'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与标签Tiger_Woods相关联的帖子的内容及其创建日期，同时返回该标签的名称和id",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='Tiger_Woods' return n2.name, n2.id, n1.content, r1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Maximilian_I,_Holy_Roman_Emperor in Fujisawa'的节点\nlabel为forum,属性title='Group for Ferdinand_II,_Holy_Roman_Emperor in Chennai'的节点\nlabel为forum,属性title='Group for Ferdinand_II,_Holy_Roman_Emperor in Chennai'的节点\nlabel为organisation,属性name='German_Historical_Institute_in_Rome'的节点\nlabel为organisation,属性name='Martin_Luther_Christian_University'的节点\nlabel为organisation,属性name='Lubbock_Christian_University'的节点\nlabel为tag,属性name='Holy_Roman_Empire'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Francis_I,_Holy_Roman_Emperor'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与标签Holy_Roman_Empire相关的帖子的id、使用的浏览器、内容、创建日期和图片文件，同时返回该标签的名称和url。",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='Holy_Roman_Empire' return n2.name, n1.id, n1.browserused, n1.content, n2.url, n1.creationdate, n1.imagefile, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Sahid_Khudiram_Siksha_Prangan'的节点\nlabel为organisation,属性name='Sardar_Patel_University'的节点\nlabel为organisation,属性name='Sardar_Patel_University'的节点\nlabel为place,属性name='Sahiwal_Division'的节点\nlabel为tag,属性name='Paradorn_Srichaphan'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Philip_Sheridan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找包含标签Paradorn_Srichaphan的帖子的标签名称、图片文件、位置IP、语言、标签ID、帖子ID、内容和标签URL，并按标签名称排序",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='Paradorn_Srichaphan' return n2.name, n1.imagefile, n1.locationip, n1.language, n2.id, n1.id, n1.content, n2.url order by n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Daniel_Payne_College'的节点\nlabel为organisation,属性name='DePaul_University'的节点\nlabel为organisation,属性name='Paul_Sabatier_University'的节点\nlabel为tag,属性name='David_Wheaton'的节点\nlabel为tag,属性name='Price_Tag'的节点\nlabel为tag,属性name='The_Best_of_David_Bowie_1969/1974'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找包含标签David_Bowie的帖子的IP地址、标签id、关系创建日期、帖子内容、帖子id、标签URL、帖子创建日期、使用的浏览器、帖子长度和标签名称以及帖子的语言。",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='David_Bowie' return n1.locationip, n2.id, r1.creationdate, n1.content, n1.id, n2.url, n1.creationdate, n1.browserused, n1.length, n2.name, n1.language"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='John_Glenn_School_of_Public_Affairs'的节点\nlabel为organisation,属性name='Glendon_College'的节点\nlabel为tag,属性name='Goon_Affiliated'的节点\nlabel为tag,属性name='John_Gay'的节点\nlabel为tag,属性name='John_Gould'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与标签John_Gould关联的帖子的长度、关系的创建日期、使用的浏览器、帖子的id、语言、图片文件、标签的URL、标签名称、帖子的创建日期和位置IP",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='John_Gould' return n1.length, r1.creationdate, n1.browserused, n1.id, n1.language, n1.imagefile, n2.url, n2.name, n1.creationdate, n1.locationip"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Brian_Wilson in Loikaw'的节点\nlabel为organisation,属性name='Daniel_Payne_College'的节点\nlabel为organisation,属性name='Pawan_Hans'的节点\nlabel为organisation,属性name='Lindsey_Wilson_College'的节点\nlabel为place,属性name='Borey_Seang_Nam'的节点\nlabel为tag,属性name='Brian_Wilson'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='John_Bunyan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找包含标签Brian_Wilson的帖子的信息，包括标签的URL，帖子的IP地址、创建日期、内容、长度、图片文件、ID、使用的浏览器、标签关系的创建日期以及帖子的语言。",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='Brian_Wilson' return n2.url, n1.locationip, n2.name, n1.creationdate, n1.content, n1.length, n1.imagefile, n1.id, n1.browserused, r1.creationdate, n1.language"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Vietnam_Center_and_Archive'的节点\nlabel为organisation,属性name='Vietnam_Aviation_Academy'的节点\nlabel为organisation,属性name='Vietnam_Airlines'的节点\nlabel为place,属性name='Vietnam'的节点\nlabel为place,属性name='Navi_Mumbai'的节点\nlabel为place,属性name='Vallabh_Vidhyanagar'的节点\nlabel为tag,属性name='VH1_Divas'的节点\nlabel为tag,属性name='Vietnam'的节点\nlabel为tag,属性name='Zhou_Dynasty'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在越南发布的帖子的语言、内容、创建日期和图片文件",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Vietnam' return n1.language, n1.content, n1.creationdate, n1.imagefile"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 11 of Arjun Irani'的节点\nlabel为forum,属性title='Album 13 of Arjun Irani'的节点\nlabel为organisation,属性name='Iran_University_of_Medical_Sciences'的节点\nlabel为organisation,属性name='Iran_University_of_Science_and_Technology'的节点\nlabel为organisation,属性name='Iran_Air_Tours'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Ramadan_City'的节点\nlabel为tag,属性name='Days_of_Purgatory'的节点\nlabel为tag,属性name='Back_to_December'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在伊朗发布的帖子的创建日期，最多返回11条记录",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Iran' return r1.creationdate limit 11"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为forum,属性title='Album 14 of Arjun Irani'的节点\nlabel为organisation,属性name='Iran_University_of_Medical_Sciences'的节点\nlabel为organisation,属性name='Iran_University_of_Science_and_Technology'的节点\nlabel为organisation,属性name='Tehran_Psychiatric_Institute'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Ramadan_City'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Dil_Dil_Pakistan'的节点\nlabel为tag,属性name='Iraqi_Kurdistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在伊朗发布的帖子的地点名称、图片文件、发布日期、语言、使用的浏览器、地点的URL和帖子的内容长度，最多返回14条记录",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Iran' return n2.name, n1.imagefile, r1.creationdate, n1.language, n1.browserused, n2.url, n1.length limit 14"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Iran_University_of_Medical_Sciences'的节点\nlabel为organisation,属性name='Iran_University_of_Science_and_Technology'的节点\nlabel为organisation,属性name='Iran_Broadcasting_College'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Ramadan_City'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Islamic_Courts_Union'的节点\nlabel为tag,属性name='Dil_Dil_Pakistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在伊朗发布的帖子的内容长度和伊朗的位置URL",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Iran' return n1.length, n2.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Mustafa_Kemal_Atatürk in Indianapolis'的节点\nlabel为forum,属性title='Group for Mahmud_of_Ghazni in Raniganj'的节点\nlabel为forum,属性title='Album 21 of Arjun Irani'的节点\nlabel为organisation,属性name='Iran_University_of_Medical_Sciences'的节点\nlabel为organisation,属性name='Iran_University_of_Science_and_Technology'的节点\nlabel为organisation,属性name='Tehran_Psychiatric_Institute'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为place,属性name='Ramadan_City'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为tag,属性name='Arif_Mardin'的节点\nlabel为tag,属性name='Dil_Dil_Pakistan'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在伊朗发布的内容，返回内容、创建日期和帖子的id，限制20条结果",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Iran' return n1.content, r1.creationdate, n1.id limit 20"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为organisation,属性name='Iran_Air_Tours'的节点\nlabel为organisation,属性name='Iran_University_of_Science_and_Technology'的节点\nlabel为organisation,属性name='Iran_University_of_Medical_Sciences'的节点\nlabel为place,属性name='Ramadan_City'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为tag,属性name='Iraqi_Kurdistan'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Dil_Dil_Pakistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在伊朗发布的所有帖子的创建日期、长度、语言、使用的浏览器、内容、图片文件以及地点名称和地点id，并按地点名称排序",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Iran' return n1.creationdate, n1.length, n1.language, n1.browserused, n1.content, n2.name, n1.imagefile, n2.id order by n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Iran_University_of_Science_and_Technology'的节点\nlabel为organisation,属性name='Iran_University_of_Medical_Sciences'的节点\nlabel为organisation,属性name='Iran_Broadcasting_College'的节点\nlabel为tag,属性name='Iraqi_Kurdistan'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Dil_Dil_Pakistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在伊朗发布的帖子的浏览器使用情况、内容、地点URL、语言、长度以及关系的创建日期",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Iran' return n2.id, n1.browserused, n1.content, n2.url, n1.language, n1.length, n2.name, r1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为organisation,属性name='Iran_University_of_Science_and_Technology'的节点\nlabel为organisation,属性name='Iran_University_of_Medical_Sciences'的节点\nlabel为organisation,属性name='Al-Isra_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Ramadan_City'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Iraqi_Kurdistan'的节点\nlabel为tag,属性name='Dil_Dil_Pakistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在伊朗发布的帖子的创建日期、帖子id、语言、长度、浏览器使用情况、内容、位置IP，以及地点的id、URL和名称，并按地点名称排序",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Iran' return r1.creationdate, n1.creationdate, n1.id, n1.language, n2.id, n1.length, n1.browserused, n1.content, n2.url, n1.locationip, n2.name order by n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为forum,属性title='Group for Mahmud_of_Ghazni in Raniganj'的节点\nlabel为organisation,属性name='Iran_University_of_Medical_Sciences'的节点\nlabel为organisation,属性name='Sindh_Madrasatul_Islam'的节点\nlabel为organisation,属性name='Tehran_Psychiatric_Institute'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为tag,属性name='Dil_Dil_Pakistan'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Islamic_Courts_Union'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在伊朗发布的所有帖子的图片文件和长度信息",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Iran' return n1.imagefile, n1.length"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Robert_Louis_Stevenson in Poznań'的节点\nlabel为organisation,属性name='Adam_Mickiewicz_University_in_Poznań'的节点\nlabel为organisation,属性name='Poznań_University_of_Technology'的节点\nlabel为organisation,属性name='Servicio_de_Publicaciones'的节点\nlabel为place,属性name='Bosnia_and_Herzegovina'的节点\nlabel为place,属性name='Ivanovo_Oblast'的节点\nlabel为place,属性name='Campos_dos_Goytacazes'的节点\nlabel为tag,属性name='Lutka_sa_naslovne_strane'的节点\nlabel为tag,属性name='Polish_government-in-exile'的节点\nlabel为tag,属性name='Bosnia_and_Herzegovina'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在波斯尼亚和黑塞哥维那发布的内容，返回内容、地点的URL、帖子的id、关系的创建日期、帖子的位置IP、地点的id、帖子的创建日期和帖子的长度",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Bosnia_and_Herzegovina' return n1.content, n2.url, n1.id, r1.creationdate, n1.locationip, n2.id, n1.creationdate, n1.length"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='University_of_Zambia'的节点\nlabel为organisation,属性name='State_University_of_Zanzibar'的节点\nlabel为organisation,属性name='State_University_of_Zanzibar'的节点\nlabel为place,属性name='Zamboanga_City'的节点\nlabel为tag,属性name='Afrika_Bambaataa'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Zambia发布的内容的地点名称、内容长度、IP地址、关系创建日期、地点URL、内容ID、语言和浏览器信息",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Zambia' return n2.name, n1.length, n1.locationip, r1.creationdate, n2.url, n1.id, n1.language, n1.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为forum,属性title='Group for Mahmud_of_Ghazni in Raniganj'的节点\nlabel为forum,属性title='Group for Nikita_Khrushchev in Rahim_Yar_Khan'的节点\nlabel为organisation,属性name='Iran_University_of_Medical_Sciences'的节点\nlabel为organisation,属性name='Iran_University_of_Science_and_Technology'的节点\nlabel为organisation,属性name='Iran_Broadcasting_College'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Dil_Dil_Pakistan'的节点\nlabel为tag,属性name='Zirid_dynasty'的节点\nlabel为tag,属性name='Iraqi_Kurdistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在伊朗发布的帖子的语言和图片文件，同时返回伊朗的id",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Iran' return n2.id, n1.language, n1.imagefile"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 19 of Arjun Irani'的节点\nlabel为organisation,属性name='Iran_University_of_Medical_Sciences'的节点\nlabel为organisation,属性name='Iran_University_of_Science_and_Technology'的节点\nlabel为organisation,属性name='Iran_Air_Tours'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Seventeen_Provinces'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在伊朗发布的帖子的信息，包括使用的浏览器、帖子id、关联关系的创建日期、帖子的位置IP、地点的URL和名称、帖子的创建日期、内容、长度以及地点id，跳过前9条记录，返回接下来的19条记录。",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Iran' return n1.browserused, n1.id, r1.creationdate, n1.locationip, n2.url, n2.name, n1.creationdate, n1.content, n1.length, n2.id skip 9 limit 19"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Iran_University_of_Medical_Sciences'的节点\nlabel为organisation,属性name='Iran_University_of_Science_and_Technology'的节点\nlabel为organisation,属性name='Iranian_Air_Transport'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Adil_Shahi_dynasty'的节点\nlabel为tag,属性name='Days_of_Purgatory'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在伊朗发布的帖子的创建日期",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Iran' return r1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Iran_University_of_Science_and_Technology'的节点\nlabel为organisation,属性name='Iran_University_of_Medical_Sciences'的节点\nlabel为organisation,属性name='Iranian_Air_Transport'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Iraqi_Kurdistan'的节点\nlabel为tag,属性name='Arif_Mardin'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在伊朗发布的帖子的信息，包括伊朗的名称和id，帖子的IP地址、关系的创建日期、帖子的语言、帖子的创建日期、使用的浏览器、伊朗的URL和帖子的内容，按伊朗的名称排序",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Iran' return n2.name, n2.id, n1.locationip, r1.creationdate, n1.language, n1.creationdate, n1.browserused, n2.url, n1.content order by n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Iran_University_of_Medical_Sciences'的节点\nlabel为organisation,属性name='Iran_University_of_Science_and_Technology'的节点\nlabel为organisation,属性name='Tehran_Psychiatric_Institute'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Dil_Dil_Pakistan'的节点\nlabel为tag,属性name='United_Arab_Emirates'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在伊朗发布的帖子的详细信息，包括地点的URL、帖子的语言、内容、长度、地点名称、帖子的图片文件、关系的创建日期和帖子的创建日期，最多返回11条记录。",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Iran' return n2.url, n1.language, n1.content, n1.length, n2.name, n1.imagefile, r1.creationdate, n1.creationdate limit 11"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Iran_University_of_Science_and_Technology'的节点\nlabel为organisation,属性name='Iran_University_of_Medical_Sciences'的节点\nlabel为organisation,属性name='Iran_Broadcasting_College'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n在伊朗发布的帖子中，跳过前20条记录，返回第21到31条记录的帖子内容、发布IP、帖子长度、帖子ID、创建日期、使用的浏览器和语言，以及地点名称。",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Iran' return n2.name, n1.content, n1.locationip, n1.length, n1.id, n1.creationdate, n1.browserused, n1.language skip 20 limit 11"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为organisation,属性name='Iran_University_of_Medical_Sciences'的节点\nlabel为organisation,属性name='Iran_University_of_Science_and_Technology'的节点\nlabel为organisation,属性name='Al-Isra_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Iraqi_Kurdistan'的节点\nlabel为tag,属性name='Islamic_Courts_Union'的节点\nlabel为tag,属性name='Dil_Dil_Pakistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在伊朗发布的所有帖子的地点URL、帖子的创建日期、语言、IP地址和帖子ID",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Iran' return n2.url, r1.creationdate, n1.language, n1.locationip, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为organisation,属性name='Iran_Air'的节点\nlabel为organisation,属性name='Iran_University_of_Medical_Sciences'的节点\nlabel为organisation,属性name='Al-Isra_University'的节点\nlabel为place,属性name='Ramadan_City'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为tag,属性name='Iraqi_Kurdistan'的节点\nlabel为tag,属性name='Aga_Khan_IV'的节点\nlabel为tag,属性name='Dil_Dil_Pakistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在伊朗发布的帖子的内容、位置IP、ID、图片文件、关系的创建日期、地点的URL、ID、名称、帖子的长度、使用的浏览器和语言，并按地点名称降序排列",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Iran' return n2.url, n1.content, n1.locationip, n1.id, n1.imagefile, r1.creationdate, n2.id, n2.name, n1.length, n1.browserused, n1.language order by n2.name desc"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为forum,属性title='Group for Mahmud_of_Ghazni in Raniganj'的节点\nlabel为forum,属性title='Group for Andy_Roddick in Ahmedpur_Sial'的节点\nlabel为organisation,属性name='Iran_University_of_Medical_Sciences'的节点\nlabel为organisation,属性name='Iran_University_of_Science_and_Technology'的节点\nlabel为organisation,属性name='Shahid_Rajaee_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Ramadan_City'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\nlabel为tag,属性name='Zirid_dynasty'的节点\nlabel为tag,属性name='Dil_Dil_Pakistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在伊朗发布的帖子的id、长度、创建日期和地点id",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Iran' return n1.id, n1.length, n1.creationdate, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Iran_University_of_Science_and_Technology'的节点\nlabel为organisation,属性name='Iran_University_of_Medical_Sciences'的节点\nlabel为organisation,属性name='Iran_Air_Tours'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Iraqi_Kurdistan'的节点\nlabel为tag,属性name='Islamic_Courts_Union'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在伊朗发布的帖子的长度、内容、创建日期、语言、id、位置IP、浏览器使用情况、图片文件以及发布地点的URL和id，同时返回关系的创建日期。",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Iran' return n1.length, n2.url, n1.creationdate, n1.language, n1.id, n2.name, n1.locationip, r1.creationdate, n1.imagefile, n2.id, n1.content, n1.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为forum,属性title='Group for Mahmud_of_Ghazni in Raniganj'的节点\nlabel为forum,属性title='Group for Nikita_Khrushchev in Rahim_Yar_Khan'的节点\nlabel为organisation,属性name='Iran_University_of_Medical_Sciences'的节点\nlabel为organisation,属性name='Iran_University_of_Science_and_Technology'的节点\nlabel为organisation,属性name='Iran_Air_Tours'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为tag,属性name='Dil_Dil_Pakistan'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Iraqi_Kurdistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在伊朗发布的所有帖子的图片文件和语言，以及伊朗的名称和id",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Iran' return n2.name, n1.imagefile, n2.id, n1.language"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Iran_University_of_Medical_Sciences'的节点\nlabel为organisation,属性name='Iran_Air_Tours'的节点\nlabel为organisation,属性name='Iran_University_of_Science_and_Technology'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Ramadan_City'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Dil_Dil_Pakistan'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在伊朗发布的帖子的信息，包括帖子的图片文件、创建日期、语言、id，以及地点的名称、URL、帖子的位置IP和使用的浏览器，按地点名称降序排列，跳过前15条记录，返回接下来的9条记录。",
        "output": "match (n1:post)-[r1:islocatedinpost]->(n2:place)  where n2.name='Iran' return n1.imagefile, n1.creationdate, n1.language, n1.id, n2.name, n2.url, n1.locationip, n1.browserused order by n2.name desc skip 15 limit 9"
    }
]