[
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Deakin_University'的节点\nlabel为organisation,属性name='Deakin_University'的节点\nlabel为organisation,属性name='DePaul_University'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为tag,属性name='Philip_K._Dick'的节点\nlabel为tag,属性name='David_Rikl'的节点\nlabel为tag,属性name='Dick_Enberg'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由名为Deepak的人创建的帖子的信息，包括：人的语言、IP地址、ID、生日、性别、创建日期、邮箱、姓氏、名字；帖子的ID、语言、图片文件、创建日期、内容、浏览器使用情况、IP地址、长度；以及关系的创建日期。",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Deepak' return n2.language, n2.locationip, n2.id, n1.id, n2.birthday, n1.language, n1.imagefile, r1.creationdate, n2.gender, n1.creationdate, n1.content, n1.browserused, n2.lastname, n1.locationip, n2.browserused, n2.email, n2.firstname, n2.creationdate, n1.length"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Deakin_University'的节点\nlabel为organisation,属性name='Deakin_University'的节点\nlabel为organisation,属性name='DePaul_University'的节点\nlabel为tag,属性name='Teddy_Picker'的节点\nlabel为tag,属性name='Daniel_Vacek'的节点\nlabel为tag,属性name='Steven_Pinker'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由名为Deepak的人创建的帖子的长度、创建者的id、浏览器使用情况、创建日期、帖子的语言、创建者的电子邮件、位置IP和图片文件",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Deepak' return n1.length, n2.id, n2.browserused, n2.creationdate, n1.language, n2.email, n2.locationip, n1.imagefile"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Cheikh_Anta_Diop_University'的节点\nlabel为organisation,属性name='Deakin_University'的节点\nlabel为organisation,属性name='Deakin_University'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为tag,属性name='Dee_Bradley_Baker'的节点\nlabel为tag,属性name='No_Boys_Allowed'的节点\nlabel为tag,属性name='Steven_Pinker'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由名为Deepak的人创建的帖子所使用的浏览器，并返回该人的id和性别，限制结果为6条。",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Deepak' return n2.id, n2.gender, n1.browserused limit 6"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Dankook_University'的节点\nlabel为organisation,属性name='Daeduk_College'的节点\nlabel为organisation,属性name='DePaul_University'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为place,属性name='Hradec_Králové'的节点\nlabel为tag,属性name='Philip_K._Dick'的节点\nlabel为tag,属性name='Daddy_Yankee_Mundial'的节点\nlabel为tag,属性name='David_Hyde_Pierce'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n跳过前5个结果，返回Deepak创建的帖子的长度和他生日的后3条记录，同时返回Deepak的姓氏",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Deepak' return n2.lastname, n1.length, n2.birthday skip 5 limit 3"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='DePaul_University'的节点\nlabel为organisation,属性name='Deakin_University'的节点\nlabel为organisation,属性name='Deakin_University'的节点\nlabel为tag,属性name='Deval_Patrick'的节点\nlabel为tag,属性name='David_Rikl'的节点\nlabel为tag,属性name='Steven_Pinker'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Deepak的人所创建的帖子的语言、创建日期、位置IP以及该人的语言、浏览器使用情况、名字、ID和姓氏",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Deepak' return n2.language, n2.browserused, n2.firstname, n2.id, n1.language, n1.creationdate, n1.locationip, n2.lastname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='DePaul_University'的节点\nlabel为organisation,属性name='Deakin_University'的节点\nlabel为organisation,属性name='Deakin_University'的节点\nlabel为tag,属性name='Steven_Pinker'的节点\nlabel为tag,属性name='Deval_Patrick'的节点\nlabel为tag,属性name='James_K._Polk'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由名为Deepak的人创建的帖子的IP地址、创建日期、内容、语言，以及该人的IP地址、语言、浏览器使用情况、名字和电子邮件，最多返回11条记录。",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Deepak' return n1.locationip, n2.locationip, r1.creationdate, n2.language, n1.language, n1.content, n1.creationdate, n2.firstname, n2.email, n2.browserused limit 11"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 1 of Albaye Papa Diouf'的节点\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为forum,属性title='Album 3 of Albaye Papa Diouf'的节点\nlabel为organisation,属性name='Pablo_de_Olavide_University'的节点\nlabel为organisation,属性name='Paul_Sabatier_University'的节点\nlabel为organisation,属性name='Petre_Andrei_University_of_Iaşi'的节点\nlabel为person,属性firstname='Albaye Papa'的节点\nlabel为person,属性firstname='Albaye Papa'的节点\nlabel为person,属性firstname='Albaye Papa'的节点\nlabel为tag,属性name='Papa_Pingouin'的节点\nlabel为tag,属性name='Naked_Baby_Photos'的节点\nlabel为tag,属性name='The_Photo_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Albaye Papa的人创建的帖子的图片文件、该人的id、生日和使用的浏览器",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Albaye Papa' return n2.id, n1.imagefile, n2.birthday, n2.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Paul_Sabatier_University'的节点\nlabel为organisation,属性name='Sergio_Arboleda_University'的节点\nlabel为organisation,属性name='Pablo_de_Olavide_University'的节点\nlabel为person,属性firstname='Albaye Papa'的节点\nlabel为person,属性firstname='Albaye Papa'的节点\nlabel为person,属性firstname='Albaye Papa'的节点\nlabel为tag,属性name='Pedro_I_of_Brazil'的节点\nlabel为tag,属性name='Paul_Annacone'的节点\nlabel为tag,属性name='Pier_Paolo_Pasolini'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Albaye Papa创建的帖子的创建者的信息，包括创建日期、电子邮件、名字、语言、ID和姓氏",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Albaye Papa' return n2.creationdate, n2.email, n2.firstname, n2.language, n2.id, n2.lastname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Paul_Sabatier_University'的节点\nlabel为organisation,属性name='Pablo_de_Olavide_University'的节点\nlabel为organisation,属性name='Pavai_College_of_Technology'的节点\nlabel为person,属性firstname='Albaye Papa'的节点\nlabel为person,属性firstname='Albaye Papa'的节点\nlabel为person,属性firstname='Albaye Papa'的节点\nlabel为tag,属性name='Paul_Annacone'的节点\nlabel为tag,属性name='Papa_Pingouin'的节点\nlabel为tag,属性name='Paul_Anka'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Albaye Papa创建的帖子的信息，包括帖子的浏览器使用情况、图片文件、内容、语言、长度、位置IP，以及Albaye Papa的位置IP、ID、性别、姓氏、创建日期、生日、电子邮件、语言和关系的创建日期。",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Albaye Papa' return n2.locationip, n2.firstname, n1.browserused, n2.browserused, n1.imagefile, n1.content, n1.language, n1.length, n2.id, n2.gender, n2.lastname, n2.creationdate, n2.birthday, r1.creationdate, n2.email, n2.language, n1.locationip"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Paul_Sabatier_University'的节点\nlabel为organisation,属性name='Adama_University'的节点\nlabel为organisation,属性name='Pablo_de_Olavide_University'的节点\nlabel为person,属性firstname='Albaye Papa'的节点\nlabel为person,属性firstname='Albaye Papa'的节点\nlabel为person,属性firstname='Albaye Papa'的节点\nlabel为tag,属性name='Gene_Autry'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\nlabel为tag,属性name='Papa_Pingouin'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Albaye Papa创建的帖子的长度、浏览器使用情况、语言、id，以及Albaye Papa的生日、位置IP和id",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Albaye Papa' return n1.length, n2.birthday, n1.id, n1.browserused, n1.language, n2.locationip, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Paul_Sabatier_University'的节点\nlabel为organisation,属性name='Pavai_College_of_Technology'的节点\nlabel为organisation,属性name='Adama_University'的节点\nlabel为person,属性firstname='Albaye Papa'的节点\nlabel为person,属性firstname='Albaye Papa'的节点\nlabel为person,属性firstname='Albaye Papa'的节点\nlabel为tag,属性name='Paul_Annacone'的节点\nlabel为tag,属性name='Paul_Anka'的节点\nlabel为tag,属性name='Papa_Pingouin'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Albaye Papa创建的帖子的详细信息，包括性别、姓氏、帖子的语言、创建者的id、关系的创建日期、帖子的图片文件、创建者的生日、位置IP、帖子的创建日期、内容、帖子的id、创建者的语言、浏览器使用情况、创建日期以及帖子的长度。",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Albaye Papa' return n2.gender, n2.lastname, n1.language, n2.id, r1.creationdate, n1.imagefile, n2.birthday, n2.locationip, n1.creationdate, n1.content, n1.id, n2.language, n2.browserused, n2.creationdate, n1.browserused, n1.length"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Paul_Sabatier_University'的节点\nlabel为organisation,属性name='Pablo_de_Olavide_University'的节点\nlabel为organisation,属性name='Petre_Andrei_University_of_Iaşi'的节点\nlabel为person,属性firstname='Albaye Papa'的节点\nlabel为person,属性firstname='Albaye Papa'的节点\nlabel为person,属性firstname='Albaye Papa'的节点\nlabel为tag,属性name='Iparhi_Agapi_Edo'的节点\nlabel为tag,属性name='Papa_Pingouin'的节点\nlabel为tag,属性name='Paul_Annacone'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Albaye Papa创建的帖子的IP地址和使用的浏览器，以及他的名字",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Albaye Papa' return n1.locationip, n2.firstname, n1.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Paul_Sabatier_University'的节点\nlabel为organisation,属性name='Pablo_de_Olavide_University'的节点\nlabel为organisation,属性name='Abasaheb_Garware_College'的节点\nlabel为person,属性firstname='Albaye Papa'的节点\nlabel为person,属性firstname='Albaye Papa'的节点\nlabel为person,属性firstname='Albaye Papa'的节点\nlabel为tag,属性name='Papa_Pingouin'的节点\nlabel为tag,属性name='My_Back_Pages'的节点\nlabel为tag,属性name='Pier_Paolo_Pasolini'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Albaye Papa的用户创建的帖子的创建日期、使用的浏览器和图片文件",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Albaye Papa' return n2.creationdate, n1.browserused, n1.imagefile"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Friedrich_Nietzsche in Poznań'的节点\nlabel为organisation,属性name='Gheorghe_Zane_University'的节点\nlabel为organisation,属性name='Zaoksky_Adventist_University'的节点\nlabel为organisation,属性name='Adam_Mickiewicz_University_in_Poznań'的节点\nlabel为tag,属性name='Zakk_Wylde'的节点\nlabel为tag,属性name='Zinedine_Zidane'的节点\nlabel为tag,属性name='Daniel_Vacek'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由名为Zdenek的人创建的帖子的内容、位置IP、创建者的IP位置、关系的创建日期、帖子ID、创建者使用的浏览器、性别和姓氏，最多返回4条记录。",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Zdenek' return n1.content, n1.locationip, n2.locationip, r1.creationdate, n1.id, n2.browserused, n2.gender, n2.lastname limit 4"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Paul_Sabatier_University'的节点\nlabel为organisation,属性name='Sardar_Patel_University'的节点\nlabel为organisation,属性name='Sardar_Patel_University'的节点\nlabel为tag,属性name='Andrei_Pavel'的节点\nlabel为tag,属性name='Paul_Rudd'的节点\nlabel为tag,属性name='Paul_Schrader'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Pavel的人创建的帖子的id、长度、创建日期，以及该人的id、语言、创建日期、性别、邮箱、IP地址和生日",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Pavel' return n2.id, n1.id, n2.language, n2.creationdate, n2.gender, n1.length, n2.email, n1.locationip, n2.locationip, n2.birthday, n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Ibb_University'的节点\nlabel为organisation,属性name='Baiko_Gakuin_University'的节点\nlabel为organisation,属性name='PC_Jabin_College'的节点\nlabel为place,属性name='Borey_Seang_Nam'的节点\nlabel为tag,属性name='Regis_Philbin'的节点\nlabel为tag,属性name='Jimmy_Webb'的节点\nlabel为tag,属性name='Steven_Pinker'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由名为Bingbing的人创建的帖子的创建者生日、位置IP、性别以及帖子的创建日期，最多返回12条记录",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Bingbing' return n2.birthday, n2.locationip, n2.gender, r1.creationdate limit 12"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Baiko_Gakuin_University'的节点\nlabel为organisation,属性name='Bengbu_Medical_College'的节点\nlabel为organisation,属性name='Ibb_University'的节点\nlabel为place,属性name='Borey_Seang_Nam'的节点\nlabel为place,属性name='Badung_Regency'的节点\nlabel为tag,属性name='Jimmy_Page'的节点\nlabel为tag,属性name='John_Bunyan'的节点\nlabel为tag,属性name='Jim_Bunning'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Bingbing创建的帖子的相关信息，包括创建者的邮箱、语言、生日、帖子的位置IP、创建日期、姓氏、使用的浏览器、帖子的图片文件、浏览器使用情况、帖子ID、语言、关系创建日期、帖子长度、创建者ID、位置IP、性别、名和内容。",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Bingbing' return n2.email, n2.language, n2.birthday, n1.locationip, n2.creationdate, n2.lastname, n2.browserused, n1.imagefile, n1.browserused, n1.id, n1.language, r1.creationdate, n1.length, n2.id, n2.locationip, n2.gender, n2.firstname, n1.content"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Ibb_University'的节点\nlabel为organisation,属性name='Baiko_Gakuin_University'的节点\nlabel为organisation,属性name='Ajay_Binay_Institute_of_Technology'的节点\nlabel为tag,属性name='Regis_Philbin'的节点\nlabel为tag,属性name='Robin_Gibb'的节点\nlabel为tag,属性name='I_Got_Id'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Bingbing创建的帖子的IP地址、内容、创建者的生日、姓氏和帖子ID，限制返回10条结果",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Bingbing' return n1.locationip, n1.content, n2.birthday, n2.lastname, n1.id limit 10"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Baiko_Gakuin_University'的节点\nlabel为tag,属性name='Regis_Philbin'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Bingbing创建的帖子的图片文件、位置IP、帖子ID、创建者ID、帖子语言和创建者的创建日期",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Bingbing' return n1.imagefile, n2.locationip, n1.id, n2.id, n1.language, n2.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Baiko_Gakuin_University'的节点\nlabel为organisation,属性name='Ibb_University'的节点\nlabel为organisation,属性name='Bengbu_Medical_College'的节点\nlabel为tag,属性name='Wingspan:_Hits_and_History'的节点\nlabel为tag,属性name='Jibbs_Featuring_Jibbs'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Bingbing创建的帖子的内容、位置IP、使用的浏览器、创建日期，以及Bingbing的位置IP、使用的浏览器、创建日期、电子邮件、性别、生日、ID、图像文件、帖子的ID、语言、Bingbing的语言和姓氏。",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Bingbing' return n1.content, n2.locationip, n1.browserused, r1.creationdate, n1.locationip, n1.length, n2.browserused, n2.creationdate, n2.email, n1.creationdate, n2.gender, n2.birthday, n2.id, n1.imagefile, n1.id, n2.firstname, n1.language, n2.language, n2.lastname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Michael_Madhusudan_Memorial_College'的节点\nlabel为organisation,属性name='Gheorghe_Zane_University'的节点\nlabel为organisation,属性name='Zaoksky_Adventist_University'的节点\nlabel为tag,属性name='Wolfgang_Amadeus_Mozart'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Price_Tag'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与标签Wolfgang Amadeus Mozart相关的帖子的id、标签的id和名称、帖子的IP地址、关系的创建日期、帖子的语言和浏览器，按标签名称排序，限制返回7条结果",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='Wolfgang_Amadeus_Mozart' return n1.id, n2.id, n2.name, n1.locationip, r1.creationdate, n1.language, n1.browserused order by n2.name limit 7"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Frank_H._Peterson_Academies_of_Technology'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='T_John_Institute_of_Technology'的节点\nlabel为tag,属性name='Thomas_Jefferson'的节点\nlabel为tag,属性name='Jesse_Jackson'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找包含Thomas_Jefferson标签的帖子的语言、IP地址、id、关系的创建日期、标签的id、帖子使用的浏览器和标签的URL",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='Thomas_Jefferson' return n1.language, n1.locationip, n1.id, r1.creationdate, n2.id, n1.browserused, n2.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Hans_Raj_College'的节点\nlabel为organisation,属性name='Mohammad_Ali_Jinnah_University'的节点\nlabel为tag,属性name='Images_and_Words'的节点\nlabel为tag,属性name='Jennifer_Jason_Leigh'的节点\nlabel为tag,属性name='Jesse_Helms'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与Henry_James标签相关的帖子的图片文件、创建日期、语言、长度，以及标签的名称、id和关系的创建日期，并按标签名称排序",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='Henry_James' return n1.imagefile, n1.creationdate, n1.language, n1.length, n2.name, n2.id, r1.creationdate order by n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Paul_Sabatier_University'的节点\nlabel为organisation,属性name='Sardar_Patel_University'的节点\nlabel为organisation,属性name='Sardar_Patel_University'的节点\nlabel为place,属性name='Anantapur_district'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Paul_Schrader'的节点\nlabel为tag,属性name='Simon_Aspelin'的节点\nlabel为tag,属性name='Adam_Sandler'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找包含Adam_Sandler标签的帖子的IP地址和创建日期",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='Adam_Sandler' return n1.locationip, n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Fisk_University'的节点\nlabel为organisation,属性name='Florida_Student_Association'的节点\nlabel为organisation,属性name='Franklin_University'的节点\nlabel为tag,属性name='Felix_Frankfurter'的节点\nlabel为tag,属性name='Stephen_Foster'的节点\nlabel为tag,属性name='John_Franklin'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与F. Scott Fitzgerald相关的帖子的创建日期、语言、标签名称、图片文件、内容、IP地址、帖子ID、使用的浏览器、标签ID、关系的创建日期和帖子长度，并按标签名称降序排列",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='F._Scott_Fitzgerald' return n1.creationdate, n1.language, n2.name, n1.imagefile, n1.content, n1.locationip, n1.id, n1.browserused, n2.id, r1.creationdate, n1.length order by n2.name desc"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Dale_Bumpers_College_of_Agricultural,_Food_and_Life_Sciences'的节点\nlabel为organisation,属性name='Daniel_Payne_College'的节点\nlabel为tag,属性name='Denny_Hulme'的节点\nlabel为tag,属性name='Denny_Hamlin'的节点\nlabel为tag,属性name='David_Hume'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找包含标签Denny_Hulme的帖子的信息，包括帖子的图片文件、关系的创建日期、帖子的创建日期、标签的URL、标签的id、标签的名称、帖子的id、帖子的内容、帖子的长度和帖子的位置IP。",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='Denny_Hulme' return n1.imagefile, r1.creationdate, n1.creationdate, n2.url, n2.id, n2.name, n1.id, n1.content, n1.length, n1.locationip"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Star_Media_Institute'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Antichrist_Superstar'的节点\nlabel为tag,属性name='Price_Tag'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与标签Antichrist_Superstar相关的帖子的内容、使用的浏览器、创建日期、标签名称、图片文件、帖子ID、标签ID、帖子长度、帖子的位置IP以及关系的创建日期和帖子的语言。",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='Antichrist_Superstar' return n1.content, n1.browserused, n1.creationdate, n2.name, n1.imagefile, n1.id, n2.id, n1.length, n1.locationip, r1.creationdate, n1.language"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Sorin_Hall'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Safarilink_Aviation'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Harold_Arlen'的节点\nlabel为tag,属性name='Alexander_Shulgin'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与标签Ariel_Sharon相关的帖子的url、长度、关联关系的创建日期、使用的浏览器、内容、id和图片文件",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='Ariel_Sharon' return n2.url, n1.length, r1.creationdate, n1.browserused, n1.content, n1.id, n1.imagefile"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Denny_Hulme'的节点\nlabel为tag,属性name='Denny_Hamlin'的节点\nlabel为tag,属性name='Damon_Hill'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找包含Denny_Hulme标签的帖子的id、内容、关系的创建日期、帖子的创建日期、帖子的长度以及标签的id",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='Denny_Hulme' return n1.id, n1.content, r1.creationdate, n1.creationdate, n1.length, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Xinjiang_Arts_Institute'的节点\nlabel为organisation,属性name='Özyeğin_University'的节点\nlabel为organisation,属性name='Qazvin_Islamic_Azad_University'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Uzbek_Soviet_Socialist_Republic'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找包含Uzbekistan标签的帖子的创建日期、语言、IP地址、id以及该标签的URL和帖子的图片文件。",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='Uzbekistan' return n1.creationdate, n1.language, n1.locationip, n1.id, n2.url, n1.imagefile"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Paul_Sabatier_University'的节点\nlabel为tag,属性name='Bag_It_Up'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Get_Buck_in_Here'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找带有标签Bag_It_Up的帖子的IP地址、长度、使用的浏览器、帖子ID和内容",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='Bag_It_Up' return n1.locationip, n1.length, n1.browserused, n1.id, n1.content"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Rafael_Belloso_Chacin_University'的节点\nlabel为organisation,属性name='Comillas_Pontifical_University'的节点\nlabel为organisation,属性name='Las_Condes_University'的节点\nlabel为tag,属性name='Fidel_Castro'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Francis_Ford_Coppola'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与Fidel_Castro标签关联的帖子的内容和创建日期，同时返回该标签的URL",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='Fidel_Castro' return n2.url, n1.content, n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Joseph_Haydn in Solapur'的节点\nlabel为organisation,属性name='Silpakorn_University'的节点\nlabel为organisation,属性name='Silpakorn_University'的节点\nlabel为organisation,属性name='Sahid_Khudiram_Siksha_Prangan'的节点\nlabel为tag,属性name='Paradorn_Srichaphan'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Philip_Sheridan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与标签Paradorn_Srichaphan相关的帖子的图片文件、语言、标签id、关系创建日期、浏览器使用情况、帖子长度、标签URL、帖子id和帖子创建日期",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='Paradorn_Srichaphan' return n1.imagefile, n1.language, n2.id, r1.creationdate, n1.browserused, n1.length, n2.url, n1.id, n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Gaston_Berger_University'的节点\nlabel为organisation,属性name='Bolan_Medical_College'的节点\nlabel为organisation,属性name='Baghlan_University'的节点\nlabel为place,属性name='Badung_Regency'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Bob_Dylan_at_Budokan'的节点\nlabel为tag,属性name='Bob_Dylan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与标签Lord_Byron关联的帖子的创建日期、位置IP、标签URL、使用的浏览器、帖子ID、内容、图片文件和长度，限制返回17条结果",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='Lord_Byron' return n1.creationdate, n1.locationip, n2.url, n1.browserused, n1.id, n1.content, n1.imagefile, n1.length limit 17"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Hapag-Lloyd_Flug'的节点\nlabel为organisation,属性name='John_Wheatley_College'的节点\nlabel为organisation,属性name='Hannan_University'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Price_Tag'的节点\nlabel为tag,属性name='Harold_Wilson'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与标签Harold_Wilson相关的帖子的浏览器使用情况、语言、内容、标签id、帖子id、图片文件、标签URL、帖子长度、位置IP、关系创建日期和标签名称",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='Harold_Wilson' return n1.browserused, n1.language, n1.content, n2.id, n1.id, n1.imagefile, n2.url, n1.length, n1.locationip, r1.creationdate, n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='John_Wesley_College'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Jesus_Walks'的节点\nlabel为tag,属性name='Price_Tag'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与标签Jesus_Walks相关的帖子的创建日期、内容长度、标签id、图片文件、帖子id和标签名称",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='Jesus_Walks' return r1.creationdate, n1.length, n2.id, n1.imagefile, n1.id, n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Link_Campus_University'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Hapag-Lloyd_Express'的节点\nlabel为tag,属性name='Run_to_the_Hills'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='All_the_Roadrunning'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与标签Run_to_the_Hills相关的帖子的创建日期、id、图片文件、标签的URL、关系的创建日期、标签名称、帖子的语言、使用的浏览器、长度和IP地址，限制返回12条结果",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='Run_to_the_Hills' return n1.creationdate, n1.id, n1.imagefile, n2.url, r1.creationdate, n2.name, n1.language, n1.browserused, n1.length, n1.locationip limit 12"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Feel_Good_Time'的节点\nlabel为tag,属性name='Any_Time,_Any_Place'的节点\nlabel为tag,属性name='Price_Tag'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找包含标签Feel_Good_Time的帖子的IP地址、创建日期、帖子ID和标签名称",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='Feel_Good_Time' return n1.locationip, n1.creationdate, n1.id, n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Ralph_J._Bunche_International_Affairs_Center'的节点\nlabel为organisation,属性name='Paul_Sabatier_University'的节点\nlabel为organisation,属性name='Center_for_Public_Leadership'的节点\nlabel为tag,属性name='Bless_Its_Pointed_Little_Head'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Jagged_Little_Pill'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与标签Bless_Its_Pointed_Little_Head相关的帖子的详细信息，包括标签的URL、关系的创建日期、标签名称、帖子ID、帖子的IP地址、内容、使用的浏览器、标签ID、帖子的语言、帖子的创建日期和图片文件，并按标签名称排序，限制返回9条结果。",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='Bless_Its_Pointed_Little_Head' return n2.url, r1.creationdate, n2.name, n1.id, n1.locationip, n1.content, n1.browserused, n2.id, n1.language, n1.creationdate, n1.imagefile order by n2.name limit 9"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Dante_Alighieri in Dar_es_Salaam'的节点\nlabel为forum,属性title='Group for Dante_Alighieri in Dar_es_Salaam'的节点\nlabel为organisation,属性name='Alitalia-Linee_Aeree_Italiane'的节点\nlabel为organisation,属性name='Dusit_Thani_College'的节点\nlabel为organisation,属性name='Almaty_Aviation'的节点\nlabel为place,属性name='Pathum_Thani'的节点\nlabel为tag,属性name='Dante_Alighieri'的节点\nlabel为tag,属性name='Adil_Shahi_dynasty'的节点\nlabel为tag,属性name='Paolo_Maldini'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找包含Dante_Alighieri标签的帖子的图片文件、创建日期、长度和语言信息",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='Dante_Alighieri' return n1.imagefile, n1.creationdate, n1.length, n1.language"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Joseph_Haydn in Solapur'的节点\nlabel为organisation,属性name='Sahid_Khudiram_Siksha_Prangan'的节点\nlabel为organisation,属性name='Silpakorn_University'的节点\nlabel为organisation,属性name='Silpakorn_University'的节点\nlabel为tag,属性name='Paradorn_Srichaphan'的节点\nlabel为tag,属性name='Philip_Sheridan'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与标签Paradorn_Srichaphan相关的帖子的id、使用的浏览器、语言、标签名称、关系创建日期、IP地址、标签id、图片文件和帖子创建日期",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='Paradorn_Srichaphan' return n1.id, n1.browserused, n1.language, n2.name, r1.creationdate, n1.locationip, n2.id, n1.imagefile, n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Robert_Louis_Stevenson in Poznań'的节点\nlabel为organisation,属性name='Webster_University_Geneva'的节点\nlabel为organisation,属性name='Webster_University_Vienna'的节点\nlabel为organisation,属性name='John_Wesley_College'的节点\nlabel为tag,属性name='William_Ewart_Gladstone'的节点\nlabel为tag,属性name='John_Eliot_Gardiner'的节点\nlabel为tag,属性name='Eric_Walter_Elst'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找包含William_Ewart_Gladstone标签的帖子的IP地址和语言",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='William_Ewart_Gladstone' return n1.locationip, n1.language"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与标签Cuba相关的帖子的创建日期、图片文件、创建日期、语言、位置IP、标签名称、帖子ID、标签ID和内容",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='Cuba' return r1.creationdate, n1.imagefile, n1.creationdate, n1.language, n1.locationip, n2.name, n1.id, n2.id, n1.content"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Gulbarga_University'的节点\nlabel为organisation,属性name='Baghlan_University'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Gulshan_Grover'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找包含标签Gulzar的所有帖子的图片文件、标签名称、使用的浏览器、帖子id、关联关系的创建日期、帖子的位置IP、标签的URL、帖子的创建日期、帖子内容、帖子长度和标签id，并按标签名称降序排列",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='Gulzar' return n1.imagefile, n2.name, n1.browserused, n1.id, r1.creationdate, n1.locationip, n2.url, n1.creationdate, n1.content, n1.length, n2.id order by n2.name desc"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Joseph_Haydn in Solapur'的节点\nlabel为organisation,属性name='Silpakorn_University'的节点\nlabel为organisation,属性name='Silpakorn_University'的节点\nlabel为organisation,属性name='Sardar_Patel_University'的节点\nlabel为tag,属性name='Paradorn_Srichaphan'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Philip_Sheridan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与标签Paradorn_Srichaphan相关的帖子的长度、标签id、帖子的语言、帖子id、内容、关系创建日期、帖子的位置IP和标签URL，最多返回13条结果",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='Paradorn_Srichaphan' return n1.length, n2.id, n1.language, n1.id, n1.content, r1.creationdate, n1.locationip, n2.url limit 13"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Suleyman_Demirel_University'的节点\nlabel为organisation,属性name='Ramon_Llull_University'的节点\nlabel为tag,属性name='Larry_Hagman'的节点\nlabel为tag,属性name='Harry_S._Truman'的节点\nlabel为tag,属性name='Saddam_Hussein'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与Harry S. Truman相关的帖子的IP地址、标签名称、标签URL、帖子创建日期、帖子语言、帖子图片文件、标签ID、关系创建日期和帖子内容",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='Harry_S._Truman' return n1.locationip, n2.name, n2.url, n1.creationdate, n1.language, n1.imagefile, n2.id, r1.creationdate, n1.content"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Philip_K._Dick'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Teddy_Picker'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与标签Philip K. Dick相关的帖子的图片文件、使用的浏览器、内容、id、标签的URL、帖子的语言、IP地址、长度和标签的id",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='Philip_K._Dick' return n1.imagefile, n1.browserused, n1.content, n1.id, n2.url, n1.language, n1.locationip, n1.length, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Congo_Express'的节点\nlabel为organisation,属性name='Cambodian_Mekong_University'的节点\nlabel为place,属性name='Democratic_Republic_of_the_Congo'的节点\nlabel为tag,属性name='Democratic_Republic_of_the_Congo'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Kingdom_of_Kongo'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与标签Republic_of_the_Congo关联的帖子的语言、创建日期、使用的浏览器、标签的URL、帖子的位置IP、长度、标签名称、关联关系的创建日期、帖子ID、内容和图片文件",
        "output": "match (n1:post)-[r1:hastagpost]->(n2:tag)  where n2.name='Republic_of_the_Congo' return n1.language, n1.creationdate, n1.browserused, n2.url, n1.locationip, n1.length, n2.name, r1.creationdate, n1.id, n1.content, n1.imagefile"
    }
]