[
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Imam_Sadiq_University'的节点\nlabel为organisation,属性name='Shah_Abdul_Latif_University'的节点\nlabel为person,属性firstname='Salim Ahmed'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为place,属性name='Fatehgarh_Sahib'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\nlabel为tag,属性name='Saif_Ali_Khan'的节点\nlabel为tag,属性name='Muhammad_Ali_of_Egypt'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Salim Ahmed的人喜欢的帖子的id、创建日期、位置IP、语言、喜欢的时间、图片文件、帖子长度、Salim Ahmed的语言、Salim Ahmed的创建日期、Salim Ahmed的生日以及使用的浏览器。",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='Salim Ahmed' return n2.id, n2.creationdate, n1.locationip, n2.language, r1.creationdate, n2.imagefile, n1.language, n2.length, n1.creationdate, n1.birthday, n2.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='William_Carey_University'的节点\nlabel为organisation,属性name='Seirei_Christopher_University'的节点\nlabel为organisation,属性name='Patricia_Stevens_College'的节点\nlabel为tag,属性name='Chris_Sabin'的节点\nlabel为tag,属性name='Jamie_Lee_Curtis'的节点\nlabel为tag,属性name='Charlie_Crist'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Chris的人喜欢的帖子的IP地址、Chris的生日、Chris的创建日期以及帖子的内容长度",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='Chris' return n2.locationip, n1.birthday, n1.creationdate, n2.length"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='William_Carey_University'的节点\nlabel为organisation,属性name='Seirei_Christopher_University'的节点\nlabel为organisation,属性name='Charles_Sturt_University_Study_Centres'的节点\nlabel为tag,属性name='Chris_Sabin'的节点\nlabel为tag,属性name='Jamie_Lee_Curtis'的节点\nlabel为tag,属性name='John_Cleese'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Chris的人喜欢的帖子的长度、Chris的IP地址、喜欢的时间、Chris的名、帖子的内容、帖子的创建时间、Chris的生日、帖子的IP地址、Chris使用的浏览器、Chris的姓、Chris的邮箱、帖子的id和帖子的语言，仅返回一条结果。",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='Chris' return n2.length, n1.locationip, r1.creationdate, n1.firstname, n2.content, n2.creationdate, n1.birthday, n2.locationip, n1.browserused, n1.lastname, n1.email, n2.id, n2.language limit 1"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Grooveshark_University'的节点\nlabel为organisation,属性name='Gachongil_College'的节点\nlabel为organisation,属性name='Jose_Maria_Agurrie_T9'的节点\nlabel为tag,属性name='Richard_Gere'的节点\nlabel为tag,属性name='Maxim_Gorky'的节点\nlabel为tag,属性name='Live_at_the_Gorge_05/06'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Grigore的人喜欢的帖子，返回该人的IP地址、喜欢的创建日期、帖子长度、帖子语言、该人的ID、帖子的IP地址、该人的浏览器、帖子的图片文件、该人的语言、该人的名字、该人的姓氏、该人的生日、帖子的内容、帖子的浏览器，跳过前17条记录，限制返回10条记录。",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='Grigore' return n1.locationip, r1.creationdate, n2.length, n2.language, n1.id, n2.locationip, n1.browserused, n2.imagefile, n1.language, n1.firstname, n1.lastname, n1.birthday, n2.content, n2.browserused skip 17 limit 10"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='K_L_University'的节点\nlabel为organisation,属性name='Jinnah_University_for_Women'的节点\nlabel为organisation,属性name='KIMEP_University'的节点\nlabel为tag,属性name='K.d._lang'的节点\nlabel为tag,属性name='Philip_K._Dick'的节点\nlabel为tag,属性name='Ken_Loach'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为K.的人喜欢的帖子的性别、帖子的位置IP、长度、创建日期、语言以及K.的姓氏",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='K.' return n1.gender, n2.locationip, n2.length, n1.creationdate, n2.language, n1.lastname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for John_Edward_Gray in Loikaw'的节点\nlabel为forum,属性title='Group for Kevin_Rudd in Zhukovsky'的节点\nlabel为forum,属性title='Group for Kevin_Rudd in Zhukovsky'的节点\nlabel为organisation,属性name='ITM_Jose_Marti'的节点\nlabel为organisation,属性name='ITM_Jose_Marti'的节点\nlabel为organisation,属性name='Richard_J._Daley_College'的节点\nlabel为place,属性name='Jagüey_Grande'的节点\nlabel为tag,属性name='Johnny_Remember_Me'的节点\nlabel为tag,属性name='I_Got_Id'的节点\nlabel为tag,属性name='My_Jamaican_Guy'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Jorge的人的id，这些人都喜欢过某些帖子",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='Jorge' return n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为forum,属性title='Album 19 of Amjad Islam Ahsan'的节点\nlabel为organisation,属性name='Mohammad_Ali_Jinnah_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Aligarh_Muslim_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为place,属性name='Ramadan_City'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\nlabel为tag,属性name='Arif_Mardin'的节点\nlabel为tag,属性name='Muhammad_Iqbal'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Abdul-Malik的人喜欢的帖子的长度、创建日期、位置IP、浏览器使用情况、语言、喜欢的创建日期、人的创建日期、名、内容、语言、邮箱、姓、性别、图片文件、人和帖子的ID、生日、浏览器使用情况，限制返回19条结果。",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='Abdul-Malik' return n2.length, n1.creationdate, n1.locationip, n2.browserused, n1.language, r1.creationdate, n1.firstname, n2.content, n2.language, n1.email, n1.lastname, n1.gender, n2.imagefile, n1.id, n1.birthday, n2.creationdate, n1.browserused, n2.id limit 19"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='William_Carey_University'的节点\nlabel为organisation,属性name='Seirei_Christopher_University'的节点\nlabel为organisation,属性name='Park_Lane_College_Leeds'的节点\nlabel为tag,属性name='Chris_Sabin'的节点\nlabel为tag,属性name='Jamie_Lee_Curtis'的节点\nlabel为tag,属性name='Cheri,_Cheri_Lady'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Chris的人喜欢的帖子的信息，包括帖子使用的浏览器、Chris的id、帖子的id、Chris的生日、帖子的长度、Chris的性别，限制返回5条结果",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='Chris' return n2.browserused, n1.id, n2.id, n1.birthday, n2.length, n1.gender limit 5"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Gachongil_College'的节点\nlabel为organisation,属性name='Ghislieri_College'的节点\nlabel为organisation,属性name='Grooveshark_University'的节点\nlabel为place,属性name='Jagüey_Grande'的节点\nlabel为tag,属性name='Live_at_the_Gorge_05/06'的节点\nlabel为tag,属性name='I_Got_Id'的节点\nlabel为tag,属性name='The_Grind_Date'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Grigore的人喜欢的帖子的信息，包括该人的姓氏、id、性别、生日、创建日期、位置IP、浏览器使用情况、电子邮件，以及帖子的id、创建日期、语言、内容、长度和浏览器使用情况。同时返回喜欢关系的创建日期。",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='Grigore' return n1.lastname, n1.id, n2.id, r1.creationdate, n2.language, n1.gender, n2.content, n2.creationdate, n1.locationip, n2.browserused, n1.birthday, n1.creationdate, n1.firstname, n2.length, n1.browserused, n1.email"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='K_L_University'的节点\nlabel为organisation,属性name='KIMEP_University'的节点\nlabel为organisation,属性name='Keen_College'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为tag,属性name='K.d._lang'的节点\nlabel为tag,属性name='I_Got_Id'的节点\nlabel为tag,属性name='Philip_K._Dick'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名字为K.的人喜欢的帖子的id，该人的创建日期，帖子的创建日期，帖子的位置IP以及该人的语言信息",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='K.' return n2.id, n1.creationdate, n2.creationdate, n2.locationip, n1.language"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='James_Cook_University'的节点\nlabel为organisation,属性name='Jorge_Amado_University_Center'的节点\nlabel为organisation,属性name='Jaypee_Institute_of_Information_Technology'的节点\nlabel为place,属性name='Jagüey_Grande'的节点\nlabel为tag,属性name='John_Gay'的节点\nlabel为tag,属性name='Jeff_Gordon'的节点\nlabel为tag,属性name='Geoff_Johns'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Jorge的人喜欢的帖子的语言、使用的浏览器、IP位置，以及该人的生日、使用的浏览器、创建日期和电子邮件，同时返回帖子的ID和图片文件。",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='Jorge' return n2.language, n2.browserused, n2.locationip, n1.birthday, n2.imagefile, n1.id, n1.browserused, n2.id, n1.creationdate, n1.language, n1.email"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为forum,属性title='Group for Mustafa_Kemal_Atatürk in Indianapolis'的节点\nlabel为forum,属性title='Album 7 of Amjad Islam Ahsan'的节点\nlabel为organisation,属性name='Imam_Sadiq_University'的节点\nlabel为organisation,属性name='Mohammad_Ali_Jinnah_University'的节点\nlabel为organisation,属性name='Maulana_Azad_College'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Ramadan_City'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为tag,属性name='Muhammad_Iqbal'的节点\nlabel为tag,属性name='Arif_Mardin'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Abdul-Malik的人喜欢的帖子的长度、创建日期、位置IP和性别，跳过前2条结果，返回接下来的7条记录",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='Abdul-Malik' return n2.length, n1.creationdate, n2.locationip, n1.gender skip 2 limit 7"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Wall of Emperor of Brazil Nascimento'的节点\nlabel为forum,属性title='Album 24 of Emperor of Brazil Dom Pedro II'的节点\nlabel为forum,属性title='Album 27 of Emperor of Brazil Dom Pedro II'的节点\nlabel为organisation,属性name='Sergio_Arboleda_University'的节点\nlabel为organisation,属性name='Rafael_Belloso_Chacin_University'的节点\nlabel为organisation,属性name='Adolfo_Ibáñez_University'的节点\nlabel为place,属性name='Pedro_Escobedo'的节点\nlabel为place,属性name='Antón_Lizardo'的节点\nlabel为place,属性name='Presidencia_Roque_Sáenz_Peña'的节点\nlabel为tag,属性name='Pedro_I_of_Brazil'的节点\nlabel为tag,属性name='John_VI_of_Portugal'的节点\nlabel为tag,属性name='Manuel_I_of_Portugal'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Emperor of Brazil的人的邮箱、语言、创建日期、性别、以及他喜欢的帖子的id和内容，同时返回该人的生日和使用的浏览器。",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='Emperor of Brazil' return n1.email, n1.language, n1.creationdate, n1.gender, n2.id, n1.birthday, n1.browserused, n2.content"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Gachongil_College'的节点\nlabel为organisation,属性name='Ghislieri_College'的节点\nlabel为organisation,属性name='Grooveshark_University'的节点\nlabel为tag,属性name='Maxim_Gorky'的节点\nlabel为tag,属性name='I_Got_Id'的节点\nlabel为tag,属性name='Greg_Biffle'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Grigore喜欢的帖子的长度、图片文件、内容、id、语言、发帖人的邮箱、浏览器使用情况、发帖人的IP地址以及Grigore的姓氏和IP地址",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='Grigore' return n2.length, n2.imagefile, n2.content, n2.id, n2.language, n1.email, n2.browserused, n1.firstname, n2.locationip, n1.locationip, n1.lastname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Andrés_Bello_University'的节点\nlabel为organisation,属性name='Andres_Soriano_College'的节点\nlabel为organisation,属性name='Adolfo_Ibáñez_University'的节点\nlabel为tag,属性name='Fernando_Alonso'的节点\nlabel为tag,属性name='Antonio_López_de_Santa_Anna'的节点\nlabel为tag,属性name='Alfredo_Di_Stéfano'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Alfonso的人的创建日期和性别",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='Alfonso' return n1.creationdate, n1.gender"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Wall of Emperor of Brazil Nascimento'的节点\nlabel为forum,属性title='Album 24 of Emperor of Brazil Dom Pedro II'的节点\nlabel为forum,属性title='Album 1 of Emperor of Brazil Machado'的节点\nlabel为organisation,属性name='Rafael_Belloso_Chacin_University'的节点\nlabel为organisation,属性name='Sergio_Arboleda_University'的节点\nlabel为organisation,属性name='Simón_Bolívar_University'的节点\nlabel为place,属性name='Pedro_Escobedo'的节点\nlabel为place,属性name='Presidencia_Roque_Sáenz_Peña'的节点\nlabel为place,属性name='Antón_Lizardo'的节点\nlabel为tag,属性name='Pedro_I_of_Brazil'的节点\nlabel为tag,属性name='Manuel_I_of_Portugal'的节点\nlabel为tag,属性name='John_VI_of_Portugal'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Emperor of Brazil的人喜欢的帖子的语言、该人的电子邮件和生日，以及帖子的内容",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='Emperor of Brazil' return n2.language, n1.email, n1.birthday, n2.content"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Al-Ahliyya_Amman_University'的节点\nlabel为organisation,属性name='Aliah_University'的节点\nlabel为organisation,属性name='Mohammad_Ali_Jinnah_University'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\nlabel为tag,属性name='Hyder_Ali'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Ali的人喜欢的帖子的详细信息，包括该人的id、性别、创建日期、电子邮件、生日、位置IP、浏览器使用情况、语言，以及帖子的id、图片文件、创建日期、内容、长度、位置IP、浏览器使用情况、语言，还有喜欢关系的创建日期。",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='Ali' return n1.id, n2.id, n1.gender, n1.creationdate, n2.imagefile, n1.email, n2.creationdate, n2.content, r1.creationdate, n2.length, n1.lastname, n2.locationip, n1.browserused, n2.language, n1.firstname, n2.browserused, n1.birthday, n1.locationip, n1.language"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 13 of Emperor of Brazil Machado'的节点\nlabel为forum,属性title='Album 19 of Emperor of Brazil Machado'的节点\nlabel为forum,属性title='Album 3 of Emperor of Brazil Machado'的节点\nlabel为organisation,属性name='Simón_Bolívar_University'的节点\nlabel为organisation,属性name='Rafael_Belloso_Chacin_University'的节点\nlabel为organisation,属性name='Boliviana_de_Aviación'的节点\nlabel为place,属性name='English_Bazar'的节点\nlabel为place,属性name='Pedro_Escobedo'的节点\nlabel为place,属性name='El_Salvador'的节点\nlabel为tag,属性name='Pedro_I_of_Brazil'的节点\nlabel为tag,属性name='Portuguese_Empire'的节点\nlabel为tag,属性name='Francoist_Spain'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Emperor of Brazil的人喜欢的帖子的语言，最多返回13个结果",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='Emperor of Brazil' return n2.language limit 13"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为organisation,属性name='Allen_University'的节点\nlabel为organisation,属性name='Angeles_University_Foundation'的节点\nlabel为organisation,属性name='Aliah_University'的节点\nlabel为tag,属性name='Alan_Ladd'的节点\nlabel为tag,属性name='Alan_Alda'的节点\nlabel为tag,属性name='Hyder_Ali'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Allister的人喜欢的帖子的图片文件、他的姓氏、帖子的id以及他使用的浏览器",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='Allister' return n2.imagefile, n1.lastname, n2.id, n1.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='SNDT_Women's_University'的节点\nlabel为organisation,属性name='SNDT_Women's_University'的节点\nlabel为organisation,属性name='Hesser_College'的节点\nlabel为tag,属性name='Profiles'的节点\nlabel为tag,属性name='My_Homies'的节点\nlabel为tag,属性name='Secret_Messages'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Horst的人喜欢的帖子的电子邮件、浏览器使用情况、语言、帖子长度、创建日期和帖子的语言",
        "output": "match (n1:person)-[r1:likespost]->(n2:post)  where n1.firstname='Horst' return n1.email, n1.browserused, n1.language, n2.length, n2.creationdate, n2.language"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Jordan_Aviation'的节点\nlabel为organisation,属性name='Daniel_Payne_College'的节点\nlabel为organisation,属性name='SNDT_Women's_University'的节点\nlabel为tag,属性name='John_Gay'的节点\nlabel为tag,属性name='Johnny_One_Note'的节点\nlabel为tag,属性name='Jonathan_Swift'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Johan的人喜欢的评论的浏览器使用情况、电子邮件、评论id、位置IP、内容、创建日期，以及Johan的创建日期、浏览器使用情况、位置IP、姓氏、性别，还有喜欢关系的创建日期",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='Johan' return n2.browserused, n1.email, n2.id, n2.locationip, n2.content, n1.creationdate, n1.browserused, n1.lastname, n1.locationip, n1.gender, n2.creationdate, r1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='SNDT_Women's_University'的节点\nlabel为organisation,属性name='SNDT_Women's_University'的节点\nlabel为organisation,属性name='Mihin_Lanka'的节点\nlabel为place,属性name='Pyin_U_Lwin'的节点\nlabel为tag,属性name='Lynn_Swann'的节点\nlabel为tag,属性name='Neil_Young'的节点\nlabel为tag,属性name='Vera_Lynn'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Lin的人喜欢的评论的创建日期、内容、长度、使用的浏览器、IP地址以及该人的性别",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='Lin' return r1.creationdate, n2.content, n2.length, n2.browserused, n2.locationip, n1.gender"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='ITM_Jose_Marti'的节点\nlabel为organisation,属性name='ITM_Jose_Marti'的节点\nlabel为organisation,属性name='Miriam_College'的节点\nlabel为tag,属性name='John_Madden'的节点\nlabel为tag,属性name='Milt_Jackson'的节点\nlabel为tag,属性name='Maxim_Gorky'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Max的人喜欢的评论的id，Max的姓氏、生日以及评论的长度，最多返回19条结果",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='Max' return n2.id, n1.lastname, n1.birthday, n2.length limit 19"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Alicia_Keys in Jalpaiguri'的节点\nlabel为organisation,属性name='Allen_University'的节点\nlabel为organisation,属性name='Anna_University'的节点\nlabel为organisation,属性name='Aliah_University'的节点\nlabel为place,属性name='Ann_Arbor'的节点\nlabel为tag,属性name='Alan_Ladd'的节点\nlabel为tag,属性name='Alan_Alda'的节点\nlabel为tag,属性name='My_All'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Allister的人喜欢的评论的IP地址、位置、长度、id、创建日期，以及Allister的创建日期、使用的语言、浏览器，还有喜欢关系的创建日期，限制返回5条结果",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='Allister' return n2.locationip, n1.locationip, n2.length, n2.id, n2.creationdate, n1.creationdate, n1.language, n1.browserused, r1.creationdate, n1.firstname limit 5"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Sergio_Arboleda_University'的节点\nlabel为organisation,属性name='Alberto_Hurtado_University'的节点\nlabel为organisation,属性name='José_Rizal_University'的节点\nlabel为place,属性name='Antón_Lizardo'的节点\nlabel为place,属性name='Pedro_Escobedo'的节点\nlabel为tag,属性name='Pedro_I_of_Brazil'的节点\nlabel为tag,属性name='John_VI_of_Portugal'的节点\nlabel为tag,属性name='Manuel_I_of_Portugal'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Emperor of Brazil的人喜欢的评论的浏览器使用情况、创建日期、该人的id、浏览器使用情况、电子邮件、语言、位置IP、评论的id、该人的姓氏、性别、评论的位置IP、评论内容以及该人的创建日期",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='Emperor of Brazil' return n2.browserused, n2.creationdate, n1.id, n1.browserused, n1.email, n1.language, n1.locationip, n2.id, n1.lastname, n1.gender, n2.locationip, n2.content, n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='SNDT_Women's_University'的节点\nlabel为organisation,属性name='SNDT_Women's_University'的节点\nlabel为organisation,属性name='IE_Business_School'的节点\nlabel为tag,属性name='Strawberry_Letter_23'的节点\nlabel为tag,属性name='Sex_Packets'的节点\nlabel为tag,属性name='My_All'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Eric喜欢的评论的浏览器使用情况、性别、评论id和内容，最多返回15条结果",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='Eric' return n2.browserused, n1.gender, n2.id, n2.content limit 15"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Francis_Marion_University'的节点\nlabel为organisation,属性name='Rafael_Belloso_Chacin_University'的节点\nlabel为organisation,属性name='City_College_of_San_Francisco'的节点\nlabel为tag,属性name='Felix_Frankfurter'的节点\nlabel为tag,属性name='Francis_Ford_Coppola'的节点\nlabel为tag,属性name='Francisco_Franco'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Francisco的人喜欢的评论的内容、Francisco的性别、评论的长度、Francisco的创建日期、浏览器使用情况、语言、生日、邮箱、位置IP、评论的创建日期、浏览器使用情况，限制返回12条结果",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='Francisco' return n1.gender, n2.content, n1.creationdate, n1.browserused, n1.language, r1.creationdate, n1.birthday, n1.email, n2.length, n1.locationip, n2.creationdate, n2.browserused, n1.firstname limit 12"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Calvin_University'的节点\nlabel为organisation,属性name='Kalitta_Charters'的节点\nlabel为organisation,属性name='Škoda_Auto_University'的节点\nlabel为tag,属性name='Adam_Carolla'的节点\nlabel为tag,属性name='Calvin_Coolidge'的节点\nlabel为tag,属性name='Ella_Loves_Cole'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Carlo的人喜欢的评论的创建日期、使用的浏览器、评论长度、评论创建日期、评论使用的浏览器、评论的IP地址、Carlo的性别、Carlo的IP地址以及评论的ID",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='Carlo' return n1.creationdate, n1.browserused, n2.length, n2.creationdate, n2.browserused, n2.locationip, n1.gender, n1.locationip, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Terry_Parker_High_School'的节点\nlabel为organisation,属性name='University_of_Pittsburgh_School_of_Education'的节点\nlabel为organisation,属性name='PEC_University_of_Technology'的节点\nlabel为tag,属性name='Peter_Pan'的节点\nlabel为tag,属性name='Peter_Paul_Rubens'的节点\nlabel为tag,属性name='Jon_Pertwee'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Peter的人喜欢的评论的详细信息，包括Peter使用的浏览器、电子邮件、ID、位置IP、名字、关系创建日期、生日、评论内容、评论长度、性别和姓氏。",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='Peter' return n1.browserused, n1.email, n1.id, n2.locationip, n1.locationip, n1.firstname, r1.creationdate, n1.birthday, n2.content, n1.language, n2.length, n1.gender, n1.lastname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Nikolay_Davydenko in Ahmedpur_Sial'的节点\nlabel为forum,属性title='Group for Rafael_Nadal in Visonta'的节点\nlabel为forum,属性title='Group for Neil_Diamond in Bhagalpur'的节点\nlabel为organisation,属性name='Adikavi_Nannaya_University'的节点\nlabel为organisation,属性name='Bidhan_Chandra_College,_Asansol'的节点\nlabel为organisation,属性name='Dhamar_University'的节点\nlabel为place,属性name='Anantapur_district'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为tag,属性name='David_Nalbandian'的节点\nlabel为tag,属性name='Adil_Shahi_dynasty'的节点\nlabel为tag,属性name='Arif_Mardin'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Daendranath喜欢的评论的用户id、位置IP和姓氏，最多返回8个结果",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='Daendranath' return n1.id, n1.locationip, n1.lastname limit 8"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='DAT_Danish_Air_Transport'的节点\nlabel为organisation,属性name='Davangere_University'的节点\nlabel为organisation,属性name='Aerovías_DAP'的节点\nlabel为tag,属性name='David_Weber'的节点\nlabel为tag,属性name='Larry_David'的节点\nlabel为tag,属性name='John_Denver'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为David的人所使用的语言、浏览器以及他的名字",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='David' return n1.language, n1.browserused, n1.firstname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为organisation,属性name='Sam_Ratulangi_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Jamal_Mohamed_College'的节点\nlabel为place,属性name='Dar_es_Salaam'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Saif_Ali_Khan'的节点\nlabel为tag,属性name='Sam_Raimi'的节点\nlabel为tag,属性name='Phil_LaMarr'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Fali Sam的人的姓氏，以及他喜欢的评论的IP地址、浏览器、内容，同时返回该人的IP地址、创建日期、语言和ID",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='Fali Sam' return n1.lastname, n2.locationip, n2.browserused, n1.locationip, n1.creationdate, n1.language, n1.id, n2.content"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Arturo_Prat_University'的节点\nlabel为organisation,属性name='Paul_Sabatier_University'的节点\nlabel为organisation,属性name='Alberto_Hurtado_University'的节点\nlabel为tag,属性name='Peter_Abelard'的节点\nlabel为tag,属性name='Marv_Albert'的节点\nlabel为tag,属性name='Adam_Lambert'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Albert的人喜欢的评论的创建日期、内容、长度、位置IP、浏览器、以及该人的创建日期、生日、语言、位置IP、性别、ID、电子邮件、名、姓和浏览器，跳过前16条记录，返回接下来的7条记录。",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='Albert' return n2.creationdate, n2.content, n1.creationdate, n2.length, r1.creationdate, n1.birthday, n1.language, n2.locationip, n2.browserused, n1.locationip, n1.gender, n1.id, n1.email, n1.firstname, n1.browserused, n1.lastname, n2.id skip 16 limit 7"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for John_Adams in New_Haven'的节点\nlabel为organisation,属性name='Allen_University'的节点\nlabel为organisation,属性name='Ain_Shams_University'的节点\nlabel为organisation,属性name='Admas_College'的节点\nlabel为tag,属性name='Adrian_Edmondson'的节点\nlabel为tag,属性name='Day_&_Age'的节点\nlabel为tag,属性name='Ogden_Nash'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Anh的人的生日、姓氏、id以及他喜欢的评论的创建日期",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='Anh' return n1.birthday, n1.lastname, n1.id, n2.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Arturo_Michelena_University'的节点\nlabel为organisation,属性name='Maitripa_College'的节点\nlabel为organisation,属性name='Santa_Isabel_College,_Manila'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为tag,属性name='Take_a_Letter_Maria'的节点\nlabel为tag,属性name='Maria_Luisa_of_Parma'的节点\nlabel为tag,属性name='Reba_McEntire'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Maria的人的IP地址和电子邮件",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='Maria' return n1.locationip, n1.email"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Fergusson_College'的节点\nlabel为organisation,属性name='University_of_North_Florida_Jazz_Department'的节点\nlabel为organisation,属性name='Fleming_College_Florence'的节点\nlabel为tag,属性name='Felix_Frankfurter'的节点\nlabel为tag,属性name='Mariusz_Fyrstenberg'的节点\nlabel为tag,属性name='Franks_Wild_Years'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Fritz的人喜欢的评论的创建日期，以及该人的语言和性别",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='Fritz' return n1.language, n1.gender, n2.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Nawaz_Sharif in Cali'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Sam_Ratulangi_University'的节点\nlabel为organisation,属性name='Salem_State_University'的节点\nlabel为person,属性firstname='Fali Sam'的节点\nlabel为person,属性firstname='Fali Sam'的节点\nlabel为person,属性firstname='Fali Sam'的节点\nlabel为place,属性name='Dar_es_Salaam'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为tag,属性name='Saif_Ali_Khan'的节点\nlabel为tag,属性name='Phil_LaMarr'的节点\nlabel为tag,属性name='Sam_Raimi'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Fali Sam的人的姓氏和电子邮件地址",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='Fali Sam' return n1.lastname, n1.email"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Anna_University,_Chennai'的节点\nlabel为organisation,属性name='Anna_University_of_Technology,_Chennai'的节点\nlabel为tag,属性name='Chen_Dynasty'的节点\nlabel为tag,属性name='Michael_Caine'的节点\nlabel为tag,属性name='The_Age_of_Consent'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Chen的人喜欢的评论的长度、该人的id、名字、评论的创建日期、该人的创建日期、生日、姓氏、使用的浏览器、语言和性别，以及评论的id。",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='Chen' return n2.length, n1.id, n1.firstname, n2.creationdate, n1.creationdate, n1.birthday, n1.lastname, n1.browserused, n1.language, n2.id, n1.gender"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Alicia_Keys in Jalpaiguri'的节点\nlabel为organisation,属性name='Askari_Aviation'的节点\nlabel为organisation,属性name='Akita_University'的节点\nlabel为organisation,属性name='Aichi_Mizuho_College'的节点\nlabel为place,属性name='Akita_City'的节点\nlabel为tag,属性name='Hyder_Ali'的节点\nlabel为tag,属性name='Hank_Azaria'的节点\nlabel为tag,属性name='Kara_DioGuardi'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Akira的人喜欢的评论的内容、创建日期、使用的浏览器、Akira的生日以及评论的id和使用的浏览器",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='Akira' return n2.content, n2.creationdate, n1.browserused, n1.birthday, n2.browserused, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Miriam_College'的节点\nlabel为organisation,属性name='Martin_College'的节点\nlabel为organisation,属性name='Martin_College'的节点\nlabel为tag,属性name='Michael_Ignatieff'的节点\nlabel为tag,属性name='Rik_Mayall'的节点\nlabel为tag,属性name='Michael_McKean'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Michel的人喜欢的评论的IP地址、评论ID，以及该人的语言、电子邮件、性别、创建日期、姓氏和名字",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='Michel' return n1.language, n1.email, n1.gender, n2.locationip, n1.creationdate, n1.lastname, n1.firstname, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Andres_Soriano_College'的节点\nlabel为organisation,属性name='Sergio_Arboleda_University'的节点\nlabel为organisation,属性name='Jorge_A._Sabato_institute'的节点\nlabel为tag,属性name='Dog_Man_Star'的节点\nlabel为tag,属性name='Swagga_Like_Us'的节点\nlabel为tag,属性name='John_Singer_Sargent'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Sergio的人所喜欢的评论，返回该人的邮箱、性别、id、语言、位置IP、姓氏、浏览器使用情况、创建日期、生日，以及评论的浏览器使用情况、位置IP、创建日期，还有喜欢关系的创建日期和评论的id",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='Sergio' return n1.email, n1.gender, n1.id, n2.browserused, n1.language, n1.locationip, n1.lastname, n1.browserused, n1.firstname, n1.creationdate, n2.locationip, n1.birthday, n2.creationdate, r1.creationdate, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Nicholas_School_of_the_Environment'的节点\nlabel为organisation,属性name='Nizam_College'的节点\nlabel为tag,属性name='John_Knox'的节点\nlabel为tag,属性name='Anna_Nicole_Smith'的节点\nlabel为tag,属性name='Yannick_Noah'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Nicolas的人喜欢的评论的内容，以及该人的电子邮件、IP地址、浏览器、名字、创建日期、性别、姓氏、评论的创建日期、喜欢的创建日期、评论的长度、该人的ID、语言和生日",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='Nicolas' return n2.content, n1.email, n1.locationip, n1.browserused, n1.firstname, n1.creationdate, n1.gender, n1.lastname, n2.creationdate, r1.creationdate, n2.length, n1.id, n1.language, n1.birthday, n2.locationip"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Calvin_Coolidge'的节点\nlabel为tag,属性name='Kurt_Gödel'的节点\nlabel为tag,属性name='Konrad_Adenauer'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Claude的人及其喜欢的评论的id、语言、生日、位置IP、创建日期、性别以及评论的创建日期和使用的浏览器",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='Claude' return n1.id, n1.language, n1.birthday, n1.locationip, n1.creationdate, n2.creationdate, n1.gender, n2.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='K_L_University'的节点\nlabel为organisation,属性name='Keen_College'的节点\nlabel为organisation,属性name='K-Mile_Air'的节点\nlabel为tag,属性name='K.d._lang'的节点\nlabel为tag,属性name='Ken_Loach'的节点\nlabel为tag,属性name='Mark_Knopfler'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为K.的人喜欢的评论的内容、长度以及该人的姓氏和语言",
        "output": "match (n1:person)-[r1:likescomment]->(n2:comment)  where n1.firstname='K.' return n2.content, n2.length, n1.firstname, n1.lastname, n1.language"
    }
]