[
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与标签Suspicious_Minds相关的评论的id、使用的浏览器、长度、关联关系的创建日期、标签的URL、名称和id，以及评论的内容，限制返回3条结果。",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='Suspicious_Minds' return n1.id, n1.browserused, n1.length, r1.creationdate, n2.url, n2.name, n2.id, n1.content limit 3"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Perimeter_Aviation'的节点\nlabel为tag,属性name='Long_Tall_Sally'的节点\nlabel为tag,属性name='Shania_Twain'的节点\nlabel为tag,属性name='Long_Distance_Runaround'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找包含Shania_Twain标签的评论的长度",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='Shania_Twain' return n1.length"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Muddy_Waters'的节点\nlabel为tag,属性name='Dirty_Water'的节点\nlabel为tag,属性name='Price_Tag'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找包含标签Muddy_Waters的评论的长度、id、创建日期、使用的浏览器、内容以及关系的创建日期",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='Muddy_Waters' return n2.name, n1.length, n1.id, r1.creationdate, n1.browserused, n1.content, n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Price_Tag'的节点\nlabel为tag,属性name='Kamal_Haasan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与标签Isaac Hayes相关的评论的id、标签id、标签URL、评论的创建日期和内容",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='Isaac_Hayes' return n1.id, n2.id, n2.url, n1.creationdate, n1.content"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Link_Campus_University'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Puff,_the_Magic_Dragon'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找包含标签Puff, the Magic Dragon的评论的url、关联关系的创建日期、评论的长度、内容和id",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='Puff,_the_Magic_Dragon' return n2.url, r1.creationdate, n1.length, n1.content, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Hans_Raj_College'的节点\nlabel为organisation,属性name='Jai_Hind_College'的节点\nlabel为tag,属性name='Hyder_Ali'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='I_Got_Id'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找具有标签Hi, Hi, Hi的评论的id和该标签的URL",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='Hi,_Hi,_Hi' return n1.id, n2.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Mohammad_Ali_Jinnah_University'的节点\nlabel为organisation,属性name='Sydney_Institute_of_Business_and_Technology'的节点\nlabel为organisation,属性name='Shivani_Institute_of_Technology'的节点\nlabel为tag,属性name='Shania_Twain'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Price_Tag'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与Shania_Twain标签相关的评论的浏览器使用情况、位置IP、创建日期、评论内容、长度，并按标签名称排序，同时返回标签的id和URL。",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='Shania_Twain' return n1.browserused, n2.name, n1.locationip, n2.id, r1.creationdate, n1.id, n1.content, n2.url, n1.length order by n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Michael_Madhusudan_Memorial_College'的节点\nlabel为organisation,属性name='Martin_College'的节点\nlabel为organisation,属性name='Martin_College'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Price_Tag'的节点\nlabel为tag,属性name='Greg_Maddux'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找包含George_Michael标签的评论的创建日期、标签的URL、评论的id、使用的浏览器和评论长度",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='George_Michael' return r1.creationdate, n2.url, n1.id, n1.browserused, n1.length"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Price_Tag'的节点\nlabel为tag,属性name='For_the_Record'的节点\nlabel为tag,属性name='Lonely_No_More'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与标签Lonely_No_More相关的评论的id、内容、使用的浏览器、长度，以及标签的名称、id和URL，返回前8条记录，同时返回关系的创建日期",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='Lonely_No_More' return n2.name, n1.id, n2.id, r1.creationdate, n1.content, n1.browserused, n2.url, n1.length limit 8"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='What_the_World_Needs_Now_Is_Love'的节点\nlabel为tag,属性name='I_Need_Love'的节点\nlabel为tag,属性name='People_Need_Love'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找标记为What_the_World_Needs_Now_Is_Love的评论的长度、标签的URL和名称、评论的IP地址、关系的创建日期以及评论的创建日期",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='What_the_World_Needs_Now_Is_Love' return n1.length, n2.url, n2.name, n1.locationip, r1.creationdate, n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Shania_Twain'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Price_Tag'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找包含标签Shania_Twain的评论内容、评论id、标签id、关系创建日期、使用的浏览器、评论长度、标签名称、评论创建日期和标签URL，并按标签名称排序",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='Shania_Twain' return n1.content, n1.id, n2.id, r1.creationdate, n1.browserused, n1.length, n2.name, n1.creationdate, n2.url order by n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Hans_Raj_College'的节点\nlabel为organisation,属性name='DG_Vaishnav_College'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Price_Tag'的节点\nlabel为tag,属性name='Hank_Williams'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与Hank_Williams标签相关的评论的浏览器使用情况、创建日期、id、标签的URL、评论长度、标签名称、标签id、评论内容和评论的IP地址，并按标签名称排序",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='Hank_Williams' return n1.browserused, n1.creationdate, n1.id, n2.url, n1.length, n2.name, n2.id, n1.content, n1.locationip order by n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Muddy_Waters'的节点\nlabel为tag,属性name='Price_Tag'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与标签Muddy_Waters相关的评论的浏览器使用情况、内容、位置IP、标签ID、评论ID、标签URL、关系创建日期，并按标签名称排序",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='Muddy_Waters' return n1.browserused, n1.content, n1.locationip, n2.id, n1.id, n2.url, r1.creationdate, n2.name order by n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Kamal_Haasan'的节点\nlabel为tag,属性name='Crazy_Hits'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与Isaac_Hayes标签相关的评论的名称、创建日期、URL、位置IP、浏览器使用情况、长度、内容、关系创建日期和评论ID，限制返回8条记录。",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='Isaac_Hayes' return n2.name, n1.creationdate, n2.url, n1.locationip, n1.browserused, n1.length, n1.content, r1.creationdate, n1.id limit 8"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Perimeter_Aviation'的节点\nlabel为tag,属性name='Deep_Water_Slang_V2.0'的节点\nlabel为tag,属性name='Long_Distance_Voyager'的节点\nlabel为tag,属性name='Long_Tall_Sally'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找包含Deep_Water_Slang_V2.0标签的评论的长度",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='Deep_Water_Slang_V2.0' return n1.length"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Astar_Air_Cargo'的节点\nlabel为organisation,属性name='Star_Air_Cargo'的节点\nlabel为organisation,属性name='Cosmos_Air_Cargo'的节点\nlabel为tag,属性name='Paper_Planes'的节点\nlabel为tag,属性name='Price_Tag'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找包含标签Paper_Planes的评论所使用的浏览器和该标签的名称",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='Paper_Planes' return n1.browserused, n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Park_Lane_College_Leeds'的节点\nlabel为organisation,属性name='John_Wesley_College'的节点\nlabel为organisation,属性name='Lesley_University'的节点\nlabel为tag,属性name='Jerry_Lee_Lewis'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Jerry_Lewis'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与标签Jerry_Lee_Lewis相关的评论的长度、使用的浏览器、标签名称、创建日期和位置IP，限制返回9条结果",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='Jerry_Lee_Lewis' return n1.length, n1.browserused, n2.name, n1.creationdate, n1.locationip limit 9"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Perimeter_Aviation'的节点\nlabel为tag,属性name='A_Thousand_Leaves'的节点\nlabel为tag,属性name='Strawberry_Letter_23'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找包含标签A_Thousand_Leaves的评论的长度、IP地址和内容",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='A_Thousand_Leaves' return n1.length, n1.locationip, n1.content"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Park_Lane_College_Leeds'的节点\nlabel为organisation,属性name='Richard_J._Daley_College'的节点\nlabel为organisation,属性name='Lee_University'的节点\nlabel为tag,属性name='Jerry_Lee_Lewis'的节点\nlabel为tag,属性name='Jerry_Lewis'的节点\nlabel为tag,属性name='Jim_Lee'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与Jerry_Lee_Lewis标签相关的评论的长度以及关系的创建日期和标签的id",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='Jerry_Lee_Lewis' return n2.id, r1.creationdate, n1.length"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Cortez_the_Killer'的节点\nlabel为tag,属性name='Price_Tag'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找具有标签Cortez the Killer的评论的创建日期、使用的浏览器以及该标签与评论关联的创建日期",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='Cortez_the_Killer' return n1.creationdate, n1.browserused, r1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Price_Tag'的节点\nlabel为tag,属性name='Shania_Twain'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与标签Shania_Twain相关的评论的标签名称、评论的IP地址、标签ID、评论ID、使用的浏览器、创建日期、长度、关系的创建日期和评论内容，并按标签名称排序",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='Shania_Twain' return n2.name, n1.locationip, n2.id, n1.id, n1.browserused, n1.creationdate, n1.length, r1.creationdate, n1.content order by n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 14 of Joakim Larsson'的节点\nlabel为forum,属性title='Album 13 of Joakim Larsson'的节点\nlabel为forum,属性title='Album 17 of Joakim Larsson'的节点\nlabel为organisation,属性name='James_Cook_University'的节点\nlabel为organisation,属性name='Andrew_Jackson_High_School'的节点\nlabel为organisation,属性name='Jackson_Junior_High_School'的节点\nlabel为tag,属性name='Strawberry_Letter_23'的节点\nlabel为tag,属性name='The_John_Lennon_Collection'的节点\nlabel为tag,属性name='John_the_Revelator_Lilian'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与J.R.R.Tolkien相关的评论的内容长度、内容以及标签的id和url，跳过前11条结果，返回接下来的14条结果",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='J._R._R._Tolkien' return n1.length, n1.content, n2.id, n2.url skip 11 limit 14"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Vision_Air_International'的节点\nlabel为tag,属性name='Eye_Legacy'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Price_Tag'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与标签Eye_Legacy相关的评论内容、创建日期、长度以及标签的id和名称",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='Eye_Legacy' return n2.id, n1.content, n1.creationdate, n1.length, n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='European_Association_for_Evolutionary_Political_Economy'的节点\nlabel为organisation,属性name='Global_Urban_Research_Unit'的节点\nlabel为organisation,属性name='Anand_Agricultural_University'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Price_Tag'的节点\nlabel为tag,属性name='Etruscan_civilization'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与Etruscan_civilization标签相关的评论的内容、长度、浏览器使用情况、位置IP、创建日期以及标签的URL和ID，并按标签名称降序排列。返回值包括标签的URL、评论的内容、标签的名称、评论的ID、评论的长度、评论的浏览器使用情况、评论的位置IP、标签的ID、评论的创建日期和关系的创建日期。",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='Etruscan_civilization' return n2.url, n1.content, n2.name, n1.id, n1.length, n1.browserused, n1.locationip, n2.id, n1.creationdate, r1.creationdate order by n2.name desc"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Hamdard_University'的节点\nlabel为organisation,属性name='Hamdard_University'的节点\nlabel为tag,属性name='Price_Tag'的节点\nlabel为tag,属性name='Harold_Arlen'的节点\nlabel为tag,属性name='Adolf_Hitler'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与标签Adolf_Hitler相关的评论的标签名称、评论长度、标签URL、关系创建日期、标签ID、评论IP地址、评论创建日期、评论内容、评论ID，并限制结果数量为6条。",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='Adolf_Hitler' return n2.name, n1.length, n2.url, r1.creationdate, n2.id, n1.locationip, n1.creationdate, n1.content, n1.id, n1.browserused limit 6"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Daniel_Payne_College'的节点\nlabel为organisation,属性name='Mohammad_Ali_Jinnah_University'的节点\nlabel为organisation,属性name='Stanley_Medical_College'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Shania_Twain'的节点\nlabel为tag,属性name='Price_Tag'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找包含标签Shania_Twain的评论的内容、IP地址、长度和创建日期，同时返回该标签的名称和URL",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='Shania_Twain' return n2.name, n2.url, n1.content, n1.locationip, n1.length, n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Vision_Air_International'的节点\nlabel为organisation,属性name='Link_Air_Express'的节点\nlabel为tag,属性name='Eye_Legacy'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Doctor_My_Eyes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找包含Eye_Legacy标签的评论的id、使用的浏览器、内容以及该标签的id和URL，还有评论的位置IP",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='Eye_Legacy' return n1.id, n1.browserused, n1.content, n2.id, n2.url, n1.locationip"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Louis_XIV_of_France in Indianapolis'的节点\nlabel为organisation,属性name='Jean_Moulin_University_Lyon_3'的节点\nlabel为organisation,属性name='Paris_Diderot_University'的节点\nlabel为organisation,属性name='Claude_Bernard_University_Lyon_1'的节点\nlabel为tag,属性name='Louis_XIII_of_France'的节点\nlabel为tag,属性name='Louis_XI_of_France'的节点\nlabel为tag,属性name='Louis_XVIII_of_France'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与标签Louis_XVIII_of_France相关的评论的id、创建日期、位置IP、关系的创建日期、标签的URL、标签的id、标签的名称、评论的内容和长度，最多返回13条记录",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='Louis_XVIII_of_France' return n1.id, n1.creationdate, n1.locationip, r1.creationdate, n2.url, n2.id, n2.name, n1.content, n1.length limit 13"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Sabena_Flight_Academy'的节点\nlabel为organisation,属性name='Sabena_Flight_Academy'的节点\nlabel为organisation,属性name='Sabena_Flight_Academy'的节点\nlabel为tag,属性name='Shania_Twain'的节点\nlabel为tag,属性name='Wynonna_Judd'的节点\nlabel为tag,属性name='Strawberry_Letter_23'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与Shania_Twain标签相关的评论的浏览器使用情况和id，跳过前18条记录，返回接下来的7条记录",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='Shania_Twain' return n1.browserused, n1.id skip 18 limit 7"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Adolfo_Ibáñez_University'的节点\nlabel为organisation,属性name='Servicio_de_Publicaciones'的节点\nlabel为organisation,属性name='Imam_Sadiq_University'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Philip_IV_of_Spain'的节点\nlabel为tag,属性name='Charles_IV_of_Spain'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与Philip IV of Spain相关的评论的长度、内容以及该标签的id和URL",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='Philip_IV_of_Spain' return n2.id, n1.length, n2.url, n1.content"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='John_F._Kennedy_School_of_Government'的节点\nlabel为organisation,属性name='Kinnaird_College'的节点\nlabel为organisation,属性name='Kendall_College'的节点\nlabel为tag,属性name='John_F._Kennedy'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='John_Knox'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找包含John_F._Kennedy标签的评论的创建日期、标签id和使用的浏览器",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='John_F._Kennedy' return n1.creationdate, n2.id, n1.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Hayfield_University'的节点\nlabel为organisation,属性name='Hapag-Lloyd_Express'的节点\nlabel为organisation,属性name='Howard_University'的节点\nlabel为tag,属性name='Howard_Hughes'的节点\nlabel为tag,属性name='Mark_Hughes'的节点\nlabel为tag,属性name='Devon_Hughes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找包含Howard_Hughes标签的评论的内容、创建日期、标签名称、标签id、标签URL、评论id、关系创建日期、使用的浏览器、评论长度和评论的IP地址",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='Howard_Hughes' return n1.content, n1.creationdate, n2.name, n2.id, n2.url, n1.id, r1.creationdate, n1.browserused, n1.length, n1.locationip"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 15 of Agustiar Anwar'的节点\nlabel为forum,属性title='Album 15 of Adrian Allende'的节点\nlabel为organisation,属性name='ARD_Charters'的节点\nlabel为organisation,属性name='Wings_Abadi_Air'的节点\nlabel为organisation,属性name='Los_Angeles_Recording_School'的节点\nlabel为tag,属性name='Andre_Agassi'的节点\nlabel为tag,属性name='Trace_Adkins'的节点\nlabel为tag,属性name='Antonio_Gramsci'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与Andre Agassi标签相关的评论内容、评论的创建日期、标签的id和名称、评论的id，跳过前8条记录，返回接下来的15条记录",
        "output": "match (n1:comment)-[r1:hastagcomment]->(n2:tag)  where n2.name='Andre_Agassi' return n1.content, r1.creationdate, n2.id, n2.name, n1.id, n1.creationdate skip 8 limit 15"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Jenderal_Soedirman_University'的节点\nlabel为organisation,属性name='İzmir_University'的节点\nlabel为tag,属性name='Yemen_Arab_Republic'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Yemen地点的评论的IP地址、id、内容、关系的创建日期、评论的创建日期、长度、使用的浏览器，以及地点的id、URL和名称",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='Yemen' return n1.locationip, n1.id, n2.id, n1.content, r1.creationdate, n1.creationdate, n1.length, n1.browserused, n2.url, n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Universidad_Panamericana_Sede_México'的节点\nlabel为organisation,属性name='MIP_Politecnico_di_Milano'的节点\nlabel为organisation,属性name='Mexicana_de_Aviación'的节点\nlabel为place,属性name='Mexico_City'的节点\nlabel为place,属性name='Quezon_City'的节点\nlabel为tag,属性name='PopMart:_Live_from_Mexico_City'的节点\nlabel为tag,属性name='Amor_a_la_Mexicana'的节点\nlabel为tag,属性name='Mexico_En_La_Piel'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Mexico地点的评论，返回评论的创建日期、地点的URL、评论使用的浏览器、地点的id、评论的IP地址、评论内容和长度，限制返回9条结果",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='Mexico' return r1.creationdate, n2.url, n1.browserused, n2.id, n1.locationip, n1.content, n1.length limit 9"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Moscow_State_Institute_of_International_Relations'的节点\nlabel为organisation,属性name='Poznań_University_of_Technology'的节点\nlabel为organisation,属性name='Institute_of_International_Relations_Yekaterinburg'的节点\nlabel为tag,属性name='Lutka_sa_naslovne_strane'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在捷克共和国发布的评论的IP地址、创建日期、浏览器使用情况、评论长度、评论内容，以及发布地点的名称、URL和ID，同时返回关系的创建日期。",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='Czech_Republic' return n1.locationip, n1.creationdate, n1.browserused, n2.name, n1.length, n2.url, n1.id, n2.id, n1.content, r1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Mexicana_de_Aviación'的节点\nlabel为organisation,属性name='MIP_Politecnico_di_Milano'的节点\nlabel为organisation,属性name='El_Colegio_de_México'的节点\nlabel为place,属性name='Mexico_City'的节点\nlabel为place,属性name='San_Pedro_Garza_García'的节点\nlabel为place,属性name='Campos_dos_Goytacazes'的节点\nlabel为tag,属性name='Amor_a_la_Mexicana'的节点\nlabel为tag,属性name='Mexico_En_La_Piel'的节点\nlabel为tag,属性name='PopMart:_Live_from_Mexico_City'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找位于墨西哥的评论内容，最多返回6条",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='Mexico' return n1.content limit 6"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Jenderal_Soedirman_University'的节点\nlabel为organisation,属性name='İzmir_University'的节点\nlabel为organisation,属性name='Eskişehir_Osmangazi_University'的节点\nlabel为tag,属性name='South_Yemen'的节点\nlabel为tag,属性name='Yemen_Arab_Republic'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Yemen地点下的评论信息，返回地点的id和名称，评论的id、创建日期、内容、长度、位置IP、浏览器使用情况以及关系的创建日期，并按地点名称排序，限制结果为20条。",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='Yemen' return n2.id, n1.id, n2.name, n1.creationdate, n1.content, n1.length, n2.url, n1.locationip, n1.browserused, r1.creationdate order by n2.name limit 20"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Cubana_de_Aviación'的节点\nlabel为organisation,属性name='Chiba_University'的节点\nlabel为organisation,属性name='Sergio_Arboleda_University'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Cuba发布的评论的长度、创建日期、位置IP、关联关系的创建日期、Cuba的URL、评论的id和内容",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='Cuba' return n1.length, n1.creationdate, n1.locationip, r1.creationdate, n2.url, n1.id, n1.content"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Angola_Air_Charter'的节点\nlabel为organisation,属性name='Al-Ahliyya_Amman_University'的节点\nlabel为organisation,属性name='Air_Arabia_Egypt'的节点\nlabel为place,属性name='Addis_Ababa'的节点\nlabel为place,属性name='Jiaganj_Azimganj'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\nlabel为tag,属性name='Aceh_Sultanate'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Algeria地点下的评论信息，返回评论的创建日期、内容、地点的id和名称、评论的id、位置IP、浏览器使用情况、评论长度、评论创建日期以及地点的URL，并按地点名称排序。",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='Algeria' return r1.creationdate, n1.content, n2.id, n2.name, n1.id, n1.locationip, n1.browserused, n1.length, n1.creationdate, n2.url order by n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Cubana_de_Aviación'的节点\nlabel为organisation,属性name='Mercu_Buana_University'的节点\nlabel为organisation,属性name='Kuban_Airlines'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Cuba中发布的所有评论的创建日期、内容长度、评论ID、内容、地点URL、关系创建日期和使用的浏览器，并按地点名称降序排列。",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='Cuba' return n1.creationdate, n2.name, n1.length, n1.id, n1.content, n2.url, r1.creationdate, n1.browserused order by n2.name desc"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Instituto_Tecnológico_de_Buenos_Aires'的节点\nlabel为organisation,属性name='Instituto_Tecnológico_de_Puebla'的节点\nlabel为organisation,属性name='Sergio_Arboleda_University'的节点\nlabel为place,属性name='Distrito_de_Bellavista'的节点\nlabel为tag,属性name='Santiago_Ventura_Bertomeu'的节点\nlabel为tag,属性name='Pedro_I_of_Brazil'的节点\nlabel为tag,属性name='Paulinho_da_Costa'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在巴西的评论的IP地址、位置名称、位置ID、评论ID和浏览器使用情况，并按位置名称降序排列，限制返回6条结果",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='Brazil' return n1.locationip, n2.name, n2.id, n1.id, n1.browserused order by n2.name desc limit 6"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Maulana_Azad_College'的节点\nlabel为organisation,属性name='ItAli_Airlines'的节点\nlabel为organisation,属性name='Agra_College'的节点\nlabel为place,属性name='Addis_Ababa'的节点\nlabel为place,属性name='Jiaganj_Azimganj'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\nlabel为tag,属性name='Aga_Khan_IV'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Algeria发布的评论的创建日期、内容、地点id、评论id、地点名称、使用的浏览器和关系的创建日期，并按地点名称排序",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='Algeria' return n1.creationdate, n1.content, n2.id, n1.id, n2.name, n1.browserused, r1.creationdate, n2.url order by n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Philippine_Women's_University'的节点\nlabel为organisation,属性name='Philippine_Airlines'的节点\nlabel为organisation,属性name='Instituto_Tecnológico_de_Puebla'的节点\nlabel为tag,属性name='First_Philippine_Republic'的节点\nlabel为tag,属性name='Dil_Dil_Pakistan'的节点\nlabel为tag,属性name='Electoral_Palatinate'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在菲律宾发布的评论的内容、长度、创建日期、使用的浏览器，以及菲律宾的URL和ID，按菲律宾名称排序",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='Philippines' return n2.url, n1.content, n2.id, r1.creationdate, n1.length, n1.creationdate, n1.browserused, n2.name order by n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Swiss_German_University'的节点\nlabel为organisation,属性name='Gdańsk_University_of_Technology'的节点\nlabel为organisation,属性name='Transavia_Denmark_ApS'的节点\nlabel为tag,属性name='Komm_zurück/Die_Banane'的节点\nlabel为tag,属性name='Chrome,_Smoke_&_BBQ'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在德国发布的评论所使用的浏览器类型",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='Germany' return n1.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Air_Express_Sweden'的节点\nlabel为organisation,属性name='Swiss_Private_Aviation'的节点\nlabel为organisation,属性name='EasyJet_Switzerland'的节点\nlabel为tag,属性name='Swagga_Like_Us'的节点\nlabel为tag,属性name='Shel_Silverstein'的节点\nlabel为tag,属性name='Swedish_Pomerania'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在瑞典发布的评论所使用的浏览器",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='Sweden' return n1.browserused"
    },
    {
        "instruction": "\n请将以下自然语言翻译为对该数据库的Cypher查询:\n在Cuba中查找第19到第25条评论的长度、位置ID、创建日期、关系创建日期、评论ID、IP地址、内容、浏览器信息以及Cuba的URL和名称。",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='Cuba' return n1.length, n2.id, n1.creationdate, r1.creationdate, n1.id, n1.locationip, n1.content, n1.browserused, n2.url, n2.name skip 18 limit 7"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Yang-En_University'的节点\nlabel为organisation,属性name='Universitas_Methodist_Indonesia'的节点\nlabel为organisation,属性name='Asia_LIFE_University'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在中国发表的评论的id以及中国的url、id和名称",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='China' return n2.url, n2.id, n2.name, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Instituto_Tecnológico_de_Jiquilpan'的节点\nlabel为tag,属性name='China_in_Your_Hand'的节点\nlabel为tag,属性name='This_Is_Not_America'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找位于中国的评论的IP地址和中国的名字",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='China' return n1.locationip, n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Semmelweis_University'的节点\nlabel为organisation,属性name='Air_Express_Sweden'的节点\nlabel为organisation,属性name='Swiss_German_University'的节点\nlabel为tag,属性name='Swagga_Like_Us'的节点\nlabel为tag,属性name='Shel_Silverstein'的节点\nlabel为tag,属性name='Strawberry_Letter_23'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在瑞典发表的评论所使用的浏览器和评论长度",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='Sweden' return n1.browserused, n1.length"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Confucius in Santiago_de_Cuba'的节点\nlabel为forum,属性title='Group for Paul_Newman in Santiago_de_Cuba'的节点\nlabel为organisation,属性name='Cubana_de_Aviación'的节点\nlabel为organisation,属性name='University_of_Cuenca_del_Plata'的节点\nlabel为organisation,属性name='Mercu_Buana_University'的节点\nlabel为place,属性name='Distrito_de_Bellavista'的节点\nlabel为tag,属性name='Santiago_Ventura_Bertomeu'的节点\nlabel为tag,属性name='Antigua_and_Barbuda'的节点\nlabel为tag,属性name='Paulinho_da_Costa'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找评论中位于Cuba的地方的网址",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='Cuba' return n2.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Cubana_de_Aviación'的节点\nlabel为organisation,属性name='Mercu_Buana_University'的节点\nlabel为organisation,属性name='WebJet_Linhas_Aéreas'的节点\nlabel为tag,属性name='My_Back_Pages'的节点\nlabel为tag,属性name='Swagga_Like_Us'的节点\nlabel为tag,属性name='In_Dulci_Jubilo_/_On_Horseback'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Cuba发布的评论所使用的浏览器和Cuba的网址",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='Cuba' return n2.url, n1.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 17 of Emperor of Brazil Machado'的节点\nlabel为organisation,属性name='Brazilian_Naval_School'的节点\nlabel为organisation,属性name='Avianca_Brazil'的节点\nlabel为organisation,属性name='Sergio_Arboleda_University'的节点\nlabel为place,属性name='Distrito_de_Bellavista'的节点\nlabel为tag,属性name='Seventeen_Provinces'的节点\nlabel为tag,属性name='Pedro_I_of_Brazil'的节点\nlabel为tag,属性name='Antigua_and_Barbuda'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n跳过17条记录，限制返回15条在巴西发布的评论的创建日期、位置ID、关联关系的创建日期、位置名称、IP地址、评论ID和浏览器信息",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='Brazil' return n1.creationdate, n2.id, r1.creationdate, n2.name, n1.locationip, n1.id, n1.browserused skip 17 limit 15"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Philippine_Women's_University'的节点\nlabel为organisation,属性name='Aerolift_Philippines'的节点\nlabel为organisation,属性name='Airlines_PNG'的节点\nlabel为tag,属性name='Strawberry_Letter_23'的节点\nlabel为tag,属性name='Philip_Sheridan'的节点\nlabel为tag,属性name='Crazy_Hits'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n在菲律宾发布的评论中，跳过前9条，返回接下来5条评论的创建日期、长度、使用的浏览器、IP地址以及评论的创建日期和ID",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='Philippines' return n1.creationdate, n1.length, n1.browserused, n1.locationip, r1.creationdate, n1.id skip 9 limit 5"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Air_Express_Sweden'的节点\nlabel为organisation,属性name='Stephens_College'的节点\nlabel为organisation,属性name='Servicio_de_Publicaciones'的节点\nlabel为tag,属性name='Wingspan:_Hits_and_History'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Strawberry_Letter_23'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在斯威士兰发布的评论的创建日期、位置IP、长度、斯威士兰的URL、浏览器使用情况和评论内容",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='Swaziland' return n1.creationdate, n1.locationip, n1.length, n2.url, n1.browserused, n1.content"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Stephens_College'的节点\nlabel为organisation,属性name='Stanley_Medical_College'的节点\nlabel为organisation,属性name='Air_Express_Sweden'的节点\nlabel为place,属性name='Sittwe_District'的节点\nlabel为tag,属性name='Wingspan:_Hits_and_History'的节点\nlabel为tag,属性name='Strawberry_Letter_23'的节点\nlabel为tag,属性name='Shel_Silverstein'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找位于斯威士兰的评论的长度、IP地址、创建日期、内容以及斯威士兰的id和评论的创建日期",
        "output": "match (n1:comment)-[r1:islocatedincomment]->(n2:place)  where n2.name='Swaziland' return n1.length, n1.locationip, r1.creationdate, n1.content, n2.id, n1.creationdate"
    }
]