[
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Islamic_Azad_University_of_Mashhad'的节点\nlabel为person,属性firstname='Abdul-Malik'的节点\nlabel为person,属性firstname='Abdul-Malik'的节点\nlabel为person,属性firstname='Abdullah'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为place,属性name='Al_Hudaydah'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Mohammad_Mosaddegh'的节点\nlabel为tag,属性name='Mahmoud_Ahmadinejad'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Abdul-Malik的成员在Album 1 of Hossein Forouhar论坛中的姓氏、电子邮件、生日、论坛的id、成员的创建日期、加入论坛的日期以及论坛的标题",
        "output": "match (n1:forum)-[r1:hasmember]->(n2:person)  where n1.title='Album 1 of Hossein Forouhar' and n2.firstname='Abdul-Malik' return n2.lastname, n2.firstname, n2.email, n2.birthday, n1.id, n2.creationdate, r1.creationdate, n1.title"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 1 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 1 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 4 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\nlabel为tag,属性name='The_Help_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 1 of Hossein Forouhar的成员的id、生日、论坛的创建日期、成员加入论坛的日期以及成员的邮箱地址",
        "output": "match (n1:forum)-[r1:hasmember]->(n2:person)  where n1.title='Album 1 of Hossein Forouhar' return n2.id, n2.birthday, n1.creationdate, r1.creationdate, n2.email"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 2 of K. Khan'的节点\nlabel为forum,属性title='Album 2 of K. Khan'的节点\nlabel为forum,属性title='Album 2 of R. Khan'的节点\nlabel为organisation,属性name='Madarastul_Falaah_Kibra'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Kunuz_College'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为place,属性name='Khyber_Pakhtunkhwa'的节点\nlabel为tag,属性name='Saif_Ali_Khan'的节点\nlabel为tag,属性name='Aamir_Khan'的节点\nlabel为tag,属性name='Untitled_Korn_album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为K.的人在Album 2 of Hossein Forouhar论坛中使用的浏览器信息",
        "output": "match (n1:forum)-[r1:hasmember]->(n2:person)  where n2.firstname='K.' and n1.title='Album 2 of Hossein Forouhar' return n2.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Jorge_Amado_University_Center'的节点\nlabel为organisation,属性name='Pablo_de_Olavide_University'的节点\nlabel为organisation,属性name='Adolfo_Ibáñez_University'的节点\nlabel为place,属性name='Pedro_Escobedo'的节点\nlabel为place,属性name='Ivanovo_Oblast'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为tag,属性name='Fernando_Alonso'的节点\nlabel为tag,属性name='Phil_Esposito'的节点\nlabel为tag,属性name='Martín_Vassallo_Argüello'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Alfonso的人所加入的论坛的标题以及他的IP地址位置",
        "output": "match (n1:forum)-[r1:hasmember]->(n2:person)  where n2.firstname='Alfonso' return n1.title, n2.locationip"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 2 of Ahmad Shah Aman'的节点\nlabel为forum,属性title='Album 2 of Amjad Islam Ahsan'的节点\nlabel为forum,属性title='Album 2 of Ali Abdeslam'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Qazvin_Islamic_Azad_University'的节点\nlabel为organisation,属性name='Al-Ahliyya_Amman_University'的节点\nlabel为person,属性firstname='Salim Ahmed'的节点\nlabel为person,属性firstname='Yahya Ould Ahmed El'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Fatehgarh_Sahib'的节点\nlabel为tag,属性name='Saif_Ali_Khan'的节点\nlabel为tag,属性name='Mohammed_Zahir_Shah'的节点\nlabel为tag,属性name='Abdus_Salam'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Salim Ahmed的人在Album 2 of Hossein Forouhar论坛中使用的浏览器",
        "output": "match (n1:forum)-[r1:hasmember]->(n2:person)  where n2.firstname='Salim Ahmed' and n1.title='Album 2 of Hossein Forouhar' return n2.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 2 of Abdullah Koksal'的节点\nlabel为forum,属性title='Album 2 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 2 of Hassan Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Madarastul_Falaah_Kibra'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为person,属性firstname='Kamal'的节点\nlabel为person,属性firstname='Kamal'的节点\nlabel为person,属性firstname='Kamal'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为tag,属性name='Saif_Ali_Khan'的节点\nlabel为tag,属性name='Shashi_Kapoor'的节点\nlabel为tag,属性name='Kamal_Haasan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 2 of Hossein Forouhar中的成员Karl的语言、id、性别、论坛的创建日期、Karl的创建日期以及他使用的浏览器。",
        "output": "match (n1:forum)-[r1:hasmember]->(n2:person)  where n1.title='Album 2 of Hossein Forouhar' and n2.firstname='Karl' return n2.language, n2.id, n2.gender, n1.creationdate, n2.creationdate, n2.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Wall of Emperor of Brazil Nascimento'的节点\nlabel为forum,属性title='Wall of Emperor of Brazil Machado'的节点\nlabel为forum,属性title='Group for Miguel_de_Cervantes in Rio_de_Janeiro'的节点\nlabel为organisation,属性name='Sergio_Arboleda_University'的节点\nlabel为organisation,属性name='Adolfo_Ibáñez_University'的节点\nlabel为organisation,属性name='Rafael_Belloso_Chacin_University'的节点\nlabel为place,属性name='Antón_Lizardo'的节点\nlabel为place,属性name='Pedro_Escobedo'的节点\nlabel为place,属性name='Presidencia_Roque_Sáenz_Peña'的节点\nlabel为tag,属性name='Pedro_I_of_Brazil'的节点\nlabel为tag,属性name='Afonso_I_of_Portugal'的节点\nlabel为tag,属性name='John_VI_of_Portugal'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Emperor of Brazil的人加入的论坛的id、他使用的浏览器、性别以及论坛的标题",
        "output": "match (n1:forum)-[r1:hasmember]->(n2:person)  where n2.firstname='Emperor of Brazil' return n1.id, n2.browserused, n2.gender, n1.title"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 3 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 3 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 23 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\nlabel为tag,属性name='Mohammed_Zahir_Shah'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 3 of Hossein Forouhar的成员，返回成员的加入日期、IP地址、名字、论坛标题、生日、邮箱、语言、创建日期、浏览器使用情况、性别，以及论坛的id和创建日期。",
        "output": "match (n1:forum)-[r1:hasmember]->(n2:person)  where n1.title='Album 3 of Hossein Forouhar' return r1.creationdate, n2.locationip, n2.firstname, n1.title, n2.birthday, n2.email, n2.language, n2.creationdate, n2.browserused, n1.id, n1.creationdate, n2.gender"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='KPC_Medical_College_and_Hospital'的节点\nlabel为organisation,属性name='K_L_University'的节点\nlabel为organisation,属性name='KIMEP_University'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为tag,属性name='James_K._Polk'的节点\nlabel为tag,属性name='Philip_K._Dick'的节点\nlabel为tag,属性name='Krzysztof_Kieślowski'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为K.的人所在的论坛的标题，以及这个人的邮箱、语言、性别、使用的浏览器和IP地址",
        "output": "match (n1:forum)-[r1:hasmember]->(n2:person)  where n2.firstname='K.' return n2.email, n2.language, n2.gender, n1.title, n2.browserused, n2.locationip"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 3 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 23 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 3 of Hassan Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为tag,属性name='Mohammed_Zahir_Shah'的节点\nlabel为tag,属性name='Kamal_Haasan'的节点\nlabel为tag,属性name='Saif_Ali_Khan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 3 of Hossein Forouhar的成员的浏览器使用情况、姓氏、生日、语言、id、电子邮件、名字、论坛id和论坛标题",
        "output": "match (n1:forum)-[r1:hasmember]->(n2:person)  where n1.title='Album 3 of Hossein Forouhar' return n2.browserused, n2.lastname, n2.birthday, n2.language, n2.id, n2.email, n2.firstname, n1.id, n2.locationip, n1.title"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 3 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 3 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 23 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Faculty_of_Medicine_Al-Azhar_University-_Girls'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Ethiraj_College_for_Women'的节点\nlabel为tag,属性name='Mohammed_Zahir_Shah'的节点\nlabel为tag,属性name='Tres_Hombres'的节点\nlabel为tag,属性name='WWF_The_Music,_Vol._3'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 3 of Hossein Forouhar的成员的性别",
        "output": "match (n1:forum)-[r1:hasmember]->(n2:person)  where n1.title='Album 3 of Hossein Forouhar' return n2.gender"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 3 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 5 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 13 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为place,属性name='Fatehgarh_Sahib'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\nlabel为tag,属性name='Mohammed_Zahir_Shah'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 3 of Hossein Forouhar的成员的加入日期、IP地址、id、名字和生日，限制返回5个结果",
        "output": "match (n1:forum)-[r1:hasmember]->(n2:person)  where n1.title='Album 3 of Hossein Forouhar' return r1.creationdate, n2.locationip, n2.id, n2.firstname, n2.birthday limit 5"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Alicia_Keys in Jalpaiguri'的节点\nlabel为forum,属性title='Group for Karl_Marx in New_Haven'的节点\nlabel为forum,属性title='Group for Catherine_the_Great in Lubbock'的节点\nlabel为organisation,属性name='Kendall_College'的节点\nlabel为organisation,属性name='Walter_Lemke_Department_of_Journalism'的节点\nlabel为organisation,属性name='Kazan_Federal_University'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为place,属性name='Hradec_Králové'的节点\nlabel为tag,属性name='The_Köln_Concert'的节点\nlabel为tag,属性name='Carl_Maria_von_Weber'的节点\nlabel为tag,属性name='Karl_Popper'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名字为Karl的人所在的论坛的创建日期和标题，同时返回这些人的IP地址、电子邮件、语言和性别，最多返回9条记录",
        "output": "match (n1:forum)-[r1:hasmember]->(n2:person)  where n2.firstname='Karl' return n2.locationip, n2.email, n2.language, n2.gender, n1.creationdate, n1.title limit 9"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 4 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 4 of Yasir Hussain'的节点\nlabel为forum,属性title='Album 4 of Faiz Qaderi'的节点\nlabel为organisation,属性name='Seirei_Christopher_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为place,属性name='Chorrillos_District'的节点\nlabel为tag,属性name='Billy_Ray_Cyrus'的节点\nlabel为tag,属性name='Mohammed_Zahir_Shah'的节点\nlabel为tag,属性name='Sher_Shah_Suri'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Chris的人在Album 4 of Hossein Forouhar论坛中的邮箱地址，以及该论坛的创建日期和id",
        "output": "match (n1:forum)-[r1:hasmember]->(n2:person)  where n2.firstname='Chris' and n1.title='Album 4 of Hossein Forouhar' return n2.email, n1.creationdate, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Genghis_Khan in Gardēz'的节点\nlabel为forum,属性title='Group for Howard_Hughes in Gardēz'的节点\nlabel为forum,属性title='Group for Genghis_Khan in Asadabad'的节点\nlabel为organisation,属性name='Jogesh_Chandra_Chaudhuri_College'的节点\nlabel为organisation,属性name='Gokhale_Memorial_Girls'_College'的节点\nlabel为organisation,属性name='Grooveshark_University'的节点\nlabel为place,属性name='Jagüey_Grande'的节点\nlabel为tag,属性name='Sourav_Ganguly'的节点\nlabel为tag,属性name='Live_at_the_Gorge_05/06'的节点\nlabel为tag,属性name='Glee:_The_Music,_Volume_4'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Grigore的成员在Album 4 of Hossein Forouhar论坛中的详细信息，包括成员的id、生日、邮箱、浏览器使用情况、位置IP、姓氏、语言、性别、名，以及论坛的标题、id、创建日期，还有成员加入论坛的创建日期。",
        "output": "match (n1:forum)-[r1:hasmember]->(n2:person)  where n2.firstname='Grigore' and n1.title='Album 4 of Hossein Forouhar' return n2.id, n2.birthday, n1.title, n2.email, n2.browserused, r1.creationdate, n2.locationip, n2.lastname, n2.language, n1.id, n1.creationdate, n2.creationdate, n2.gender, n2.firstname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 4 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 24 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 34 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Al-Zaytoonah_University_of_Jordan'的节点\nlabel为organisation,属性name='Air_Arabia_Jordan'的节点\nlabel为place,属性name='Jiaganj_Azimganj'的节点\nlabel为place,属性name='Jagüey_Grande'的节点\nlabel为tag,属性name='Hussein_of_Jordan'的节点\nlabel为tag,属性name='Glee:_The_Music,_Volume_4'的节点\nlabel为tag,属性name='Geoff_Johns'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 4 of Hossein Forouhar中的成员Jorge的id、姓氏、性别、语言、创建日期、id和生日",
        "output": "match (n1:forum)-[r1:hasmember]->(n2:person)  where n2.firstname='Jorge' and n1.title='Album 4 of Hossein Forouhar' return n1.id, n2.lastname, n2.gender, n2.language, n2.creationdate, n2.id, n2.birthday"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为forum,属性title='Group for Mahmud_of_Ghazni in Raniganj'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为organisation,属性name='Maulana_Azad_College'的节点\nlabel为organisation,属性name='Aligarh_Muslim_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为person,属性firstname='Abdul-Malik'的节点\nlabel为person,属性firstname='Abdul-Malik'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为place,属性name='Jiaganj_Azimganj'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\nlabel为tag,属性name='Arif_Mardin'的节点\nlabel为tag,属性name='Mohammad_Mosaddegh'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Abdul-Malik的人的论坛成员关系，返回他的语言、性别、IP地址、成员关系创建日期、姓氏、所在论坛的标题和他的电子邮件地址。",
        "output": "match (n1:forum)-[r1:hasmember]->(n2:person)  where n2.firstname='Abdul-Malik' return n2.language, n2.gender, n2.locationip, r1.creationdate, n2.lastname, n1.title, n2.email"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Alicia_Keys in Jalpaiguri'的节点\nlabel为organisation,属性name='Kendall_College'的节点\nlabel为organisation,属性name='Kazan_Federal_University'的节点\nlabel为organisation,属性name='Cleveland_State_Community_College'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为tag,属性name='Ken_Schrader'的节点\nlabel为tag,属性name='Karl_Malden'的节点\nlabel为tag,属性name='Kyle_MacLachlan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Karl的人加入的论坛的id、标题，以及该人的电子邮件、性别、语言、浏览器、id、名、生日、位置IP和姓氏",
        "output": "match (n1:forum)-[r1:hasmember]->(n2:person)  where n2.firstname='Karl' return n2.email, n2.gender, n2.language, n2.browserused, n2.id, n2.firstname, n1.title, n2.birthday, n1.id, n2.locationip, n2.lastname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 24 of Emperor of Brazil Dom Pedro II'的节点\nlabel为forum,属性title='Album 21 of Emperor of Brazil Dom Pedro II'的节点\nlabel为forum,属性title='Album 30 of Emperor of Brazil Dom Pedro II'的节点\nlabel为organisation,属性name='Brazilian_Naval_School'的节点\nlabel为organisation,属性name='Sergio_Arboleda_University'的节点\nlabel为organisation,属性name='Catholic_University_of_Portugal'的节点\nlabel为person,属性firstname='Emperor of Brazil'的节点\nlabel为person,属性firstname='Emperor of Brazil'的节点\nlabel为person,属性firstname='Emperor of Brazil'的节点\nlabel为place,属性name='Presidencia_Roque_Sáenz_Peña'的节点\nlabel为place,属性name='Pedro_Escobedo'的节点\nlabel为tag,属性name='Pedro_I_of_Brazil'的节点\nlabel为tag,属性name='Brazilian_military_government'的节点\nlabel为tag,属性name='Afonso_I_of_Portugal'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Emperor of Brazil的成员的生日",
        "output": "match (n1:forum)-[r1:hasmember]->(n2:person)  where n2.firstname='Emperor of Brazil' return n2.birthday"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 5 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 5 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 5 of Faiz Qaderi'的节点\nlabel为organisation,属性name='Curtis_Institute_of_Music'的节点\nlabel为organisation,属性name='Swathi_Thirunal_College_of_Music'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为tag,属性name='5_Years_in_a_Livetime'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='Glee:_The_Music,_Volume_5'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Chris的人加入Album 5 of Hossein Forouhar的时间",
        "output": "match (n1:forum)-[r1:hasmember]->(n2:person)  where n2.firstname='Chris' and n1.title='Album 5 of Hossein Forouhar' return n2.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 5 of K. Khan'的节点\nlabel为forum,属性title='Album 5 of K. Khan'的节点\nlabel为forum,属性title='Album 5 of Abdullah Koksal'的节点\nlabel为organisation,属性name='Baku_Academy_of_Music'的节点\nlabel为organisation,属性name='Kunuz_College'的节点\nlabel为organisation,属性name='Kazan_Federal_University'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为tag,属性name='Saif_Ali_Khan'的节点\nlabel为tag,属性name='Rahsaan_Roland_Kirk'的节点\nlabel为tag,属性name='Ibn_Khaldun'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 5 of Hossein Forouhar中成员名为K.的用户的姓氏、邮箱、生日、id、论坛标题、用户的位置IP、论坛的创建日期、论坛的id和用户的语言信息",
        "output": "match (n1:forum)-[r1:hasmember]->(n2:person)  where n1.title='Album 5 of Hossein Forouhar' and n2.firstname='K.' return n2.lastname, n2.email, n2.birthday, n2.id, n1.title, n2.locationip, n1.creationdate, n1.id, n2.language"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 5 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 11 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 5 of Hassan Forouhar'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\nlabel为tag,属性name='The_Fugs_First_Album'的节点\nlabel为tag,属性name='The_Help_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 5 of Hossein Forouhar的成员关系的创建日期、论坛的id以及成员的创建日期，最多返回11条记录",
        "output": "match (n1:forum)-[r1:hasmember]->(n2:person)  where n1.title='Album 5 of Hossein Forouhar' return r1.creationdate, n1.id, n2.creationdate limit 11"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 5 of Faisal Ahmed'的节点\nlabel为forum,属性title='Album 5 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 5 of Ahmad Shah Aman'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Jamal_Mohamed_College'的节点\nlabel为organisation,属性name='Qazvin_Islamic_Azad_University'的节点\nlabel为person,属性firstname='Salim Ahmed'的节点\nlabel为person,属性firstname='Yahya Ould Ahmed El'的节点\nlabel为person,属性firstname='Abdullah'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为place,属性name='Fatehgarh_Sahib'的节点\nlabel为tag,属性name='Mohammed_Zahir_Shah'的节点\nlabel为tag,属性name='Saif_Ali_Khan'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 5 of Hossein Forouhar中成员Salim Ahmed的论坛标题、电子邮件、语言、姓氏、生日、创建日期和id",
        "output": "match (n1:forum)-[r1:hasmember]->(n2:person)  where n1.title='Album 5 of Hossein Forouhar' and n2.firstname='Salim Ahmed' return n1.title, n2.email, n2.language, n2.lastname, n2.birthday, n2.creationdate, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为forum,属性title='Album 16 of Amjad Islam Ahsan'的节点\nlabel为forum,属性title='Group for Mahmud_of_Ghazni in Raniganj'的节点\nlabel为organisation,属性name='Michael_Madhusudan_Memorial_College'的节点\nlabel为organisation,属性name='Maulana_Azad_College'的节点\nlabel为organisation,属性name='Jamal_Mohamed_College'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Jiaganj_Azimganj'的节点\nlabel为place,属性name='Moscow_International_Business_Center'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\nlabel为tag,属性name='Arif_Mardin'的节点\nlabel为tag,属性name='Mohammad_Mosaddegh'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Abdul-Malik的人加入的论坛，返回第16到第23条记录，包括人的IP地址、论坛的id、人的名字、加入时间、邮箱、姓氏、论坛标题、语言和人的创建日期",
        "output": "match (n1:forum)-[r1:hasmember]->(n2:person)  where n2.firstname='Abdul-Malik' return n2.locationip, n1.id, n2.firstname, r1.creationdate, n2.email, n2.lastname, n1.title, n2.language, n2.creationdate skip 15 limit 8"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 5 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 5 of Hassan Forouhar'的节点\nlabel为forum,属性title='Album 5 of Abdullah Koksal'的节点\nlabel为organisation,属性name='Madarastul_Falaah_Kibra'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Saif_Ali_Khan'的节点\nlabel为tag,属性name='Mohammed_Zahir_Shah'的节点\nlabel为tag,属性name='DJ_Khaled'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 5 of Hossein Forouhar中的成员Karl的详细信息，包括论坛的id、创建日期和标题，成员的姓氏、性别、生日和语言，以及成员加入论坛的创建日期。",
        "output": "match (n1:forum)-[r1:hasmember]->(n2:person)  where n1.title='Album 5 of Hossein Forouhar' and n2.firstname='Karl' return n1.id, n2.lastname, r1.creationdate, n2.firstname, n2.gender, n2.birthday, n1.creationdate, n1.title, n2.language"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Chen_Shui-bian in Dar_es_Salaam'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为organisation,属性name='Seirei_Christopher_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Khalsa_College,_Amritsar'的节点\nlabel为tag,属性name='Mohammed_Zahir_Shah'的节点\nlabel为tag,属性name='Sher_Shah_Suri'的节点\nlabel为tag,属性name='Chris_Sabin'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Chris的成员在Album 6 of Hossein Forouhar论坛中的性别、论坛的创建日期、成员的创建日期、语言、邮箱、加入论坛的日期、论坛的id、成员的名、成员的IP地址、成员的id、成员的生日、成员使用的浏览器、论坛的标题和成员的姓。",
        "output": "match (n1:forum)-[r1:hasmember]->(n2:person)  where n2.firstname='Chris' and n1.title='Album 6 of Hossein Forouhar' return n2.gender, n1.creationdate, n2.creationdate, n2.language, n2.email, r1.creationdate, n1.id, n2.firstname, n2.locationip, n2.id, n2.birthday, n2.browserused, n1.title, n2.lastname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for John_Edward_Gray in Loikaw'的节点\nlabel为forum,属性title='Group for Albert_Günther in Loikaw'的节点\nlabel为organisation,属性name='Grooveshark_University'的节点\nlabel为organisation,属性name='Georgia_Tech_Alumni_Association'的节点\nlabel为organisation,属性name='Webster_University_Geneva'的节点\nlabel为tag,属性name='Live_at_the_Gorge_05/06'的节点\nlabel为tag,属性name='The_Globe_Sessions'的节点\nlabel为tag,属性name='Roger_Glover'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Grigore的成员所加入的论坛信息，包括成员使用的浏览器、关系的创建日期、成员的IP地址、名字、ID、生日、论坛标题、成员的姓氏、语言和性别，跳过前2个结果，返回接下来的18个结果。",
        "output": "match (n1:forum)-[r1:hasmember]->(n2:person)  where n2.firstname='Grigore' return n2.browserused, r1.creationdate, n2.locationip, n2.firstname, n2.id, n2.birthday, n1.title, n2.lastname, n2.language, n1.id, n2.gender skip 2 limit 18"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 6 of Hossein Forouhar'的节点\nlabel为forum,属性title='Group for Joseph_Haydn in Solapur'的节点\nlabel为forum,属性title='Album 7 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Al-Zaytoonah_University_of_Jordan'的节点\nlabel为organisation,属性name='Gokhale_Memorial_Girls'_College'的节点\nlabel为place,属性name='Jiaganj_Azimganj'的节点\nlabel为tag,属性name='Hussein_of_Jordan'的节点\nlabel为tag,属性name='Glee:_The_Music,_Volume_6'的节点\nlabel为tag,属性name='Live_at_the_Gorge_05/06'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 6 of Hossein Forouhar中名为Jorge的成员的id、创建日期、姓氏、论坛创建日期、语言、名字、生日、邮箱、性别和论坛id，限制返回7条记录",
        "output": "match (n1:forum)-[r1:hasmember]->(n2:person)  where n2.firstname='Jorge' and n1.title='Album 6 of Hossein Forouhar' return n2.id, n2.creationdate, n2.lastname, n1.creationdate, n2.language, n2.firstname, n2.birthday, n2.email, n2.gender, n1.id, n2.browserused limit 7"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Jamal_Mohamed_College'的节点\nlabel为person,属性firstname='Abdul-Malik'的节点\nlabel为person,属性firstname='Abdul-Malik'的节点\nlabel为person,属性firstname='Abdullah'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为tag,属性name='Mohammed_Zahir_Shah'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Mohammad_Mosaddegh'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Abdul-Malik的人在Album 6 of Hossein Forouhar论坛中的成员关系，返回该人的名字、论坛标题、使用的浏览器、生日、成员关系创建日期和性别",
        "output": "match (n1:forum)-[r1:hasmember]->(n2:person)  where n1.title='Album 6 of Hossein Forouhar' and n2.firstname='Abdul-Malik' return n2.firstname, n1.title, n2.browserused, n2.birthday, r1.creationdate, n2.gender"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Kamal_Haasan in Orlando'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为organisation,属性name='Jamal_Mohamed_College'的节点\nlabel为organisation,属性name='Al-Khair_University'的节点\nlabel为person,属性firstname='Kamal'的节点\nlabel为person,属性firstname='Kamal'的节点\nlabel为person,属性firstname='Kamal'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为tag,属性name='Saif_Ali_Khan'的节点\nlabel为tag,属性name='Shashi_Kapoor'的节点\nlabel为tag,属性name='Kamal_Haasan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Karl的成员在Album 6 of Hossein Forouhar中的姓氏、论坛标题、成员的创建日期、性别、生日以及论坛的创建日期，限制返回3条结果",
        "output": "match (n1:forum)-[r1:hasmember]->(n2:person)  where n2.firstname='Karl' and n1.title='Album 6 of Hossein Forouhar' return n2.lastname, n1.title, n2.creationdate, n2.gender, n2.birthday, n1.creationdate limit 3"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 7 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 7 of Faiz Qaderi'的节点\nlabel为forum,属性title='Album 17 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Mahishadal_Girls_College'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为organisation,属性name='Faculty_of_Medicine_Al-Azhar_University-_Girls'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为tag,属性name='Mohammed_Zahir_Shah'的节点\nlabel为tag,属性name='Sher_Shah_Suri'的节点\nlabel为tag,属性name='Billy_Ray_Cyrus'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 7 of Hossein Forouhar中的成员Chris的性别，以及该论坛的id和Chris加入该论坛的时间",
        "output": "match (n1:forum)-[r1:hasmember]->(n2:person)  where n1.title='Album 7 of Hossein Forouhar' and n2.firstname='Chris' return n2.gender, n1.id, r1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 35 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 30 of Hossein Forouhar'的节点\nlabel为forum,属性title='Album 25 of Hossein Forouhar'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Obirin_Junior_College'的节点\nlabel为organisation,属性name='Fakir_Mohan_University'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\nlabel为tag,属性name='Hosni_Mubarak'的节点\nlabel为tag,属性name='Hussein_of_Jordan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 35 of Hossein Forouhar的管理员Hossein的位置IP、管理员的名、关系的创建日期和论坛的id，限制返回20条结果",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n2.firstname='Hossein' and n1.title='Album 35 of Hossein Forouhar' return n2.locationip, n2.firstname, r1.creationdate, n1.id limit 20"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for John_McCain in Zhukovsky'的节点\nlabel为forum,属性title='Wall of Jan Zakrzewski'的节点\nlabel为forum,属性title='Wall of Andrzej Zakrzewski'的节点\nlabel为organisation,属性name='Jagran_Institute_of_Communication_and_Management'的节点\nlabel为organisation,属性name='Jain_Institute_of_Technology'的节点\nlabel为organisation,属性name='Jagan_Institute_of_Management_Studies'的节点\nlabel为tag,属性name='John_Krasinski'的节点\nlabel为tag,属性name='The_Jean_Genie'的节点\nlabel为tag,属性name='Jack_Warner'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Jan作为管理员的Wall of Jan Zakrzewski论坛的信息，包括关系的创建日期、Jan的IP地址、电子邮件、生日、姓氏、论坛的id以及Jan的名字。",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n2.firstname='Jan' and n1.title='Wall of Jan Zakrzewski' return r1.creationdate, n2.locationip, n2.email, n2.birthday, n2.lastname, n1.id, n2.firstname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Wall of Wojciech Ciesla'的节点\nlabel为forum,属性title='Wall of Wojciech Kowalski'的节点\nlabel为forum,属性title='Group for William_Shakespeare in Vitebsk'的节点\nlabel为organisation,属性name='Cardinal_Stefan_Wyszyński_University_in_Warsaw'的节点\nlabel为organisation,属性name='Wrocław_University_of_Technology'的节点\nlabel为organisation,属性name='Webster_University_Geneva'的节点\nlabel为tag,属性name='Władysław_IV_Vasa'的节点\nlabel为tag,属性name='Lech_Wałęsa'的节点\nlabel为tag,属性name='Walter_Winchell'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Wall of Wojciech Ciesla的管理员Wojciech的生日、创建日期、管理关系的创建日期、论坛的id、管理员的名、邮箱、语言、姓氏、使用的浏览器以及论坛的创建日期",
        "output": "match (n1:forum)-[r1:hasmoderator]->(n2:person)  where n2.firstname='Wojciech' and n1.title='Wall of Wojciech Ciesla' return n2.birthday, n2.creationdate, r1.creationdate, n1.id, n2.firstname, n2.email, n2.language, n2.lastname, n2.browserused, n1.creationdate"
    }
]