[
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Spike_Lee in Debre_Marqos'的节点\nlabel为forum,属性title='Group for Lady_Gaga in Kerala'的节点\nlabel为forum,属性title='Album 0 of Dale Garcia'的节点\nlabel为organisation,属性name='Jogamaya_Devi_College'的节点\nlabel为organisation,属性name='Ida_Scudder_School'的节点\nlabel为organisation,属性name='Jamia_Siddiqia'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为tag,属性name='Gisela_Dulko'的节点\nlabel为tag,属性name='Lisa_Kudrow'的节点\nlabel为tag,属性name='Diana_Rigg'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Gisela_Dulko的id",
        "output": "match (n1:tag)  where n1.name='Gisela_Dulko' return n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Miguel_de_Cervantes in Debre_Marqos'的节点\nlabel为forum,属性title='Group for Miguel_de_Cervantes in Rio_de_Janeiro'的节点\nlabel为forum,属性title='Album 3 of Jesus Mendez'的节点\nlabel为organisation,属性name='Saint_John's_School,_San_Pedro_de_la_Paz'的节点\nlabel为organisation,属性name='San_Juan_De_Dios_Educational_Foundation'的节点\nlabel为organisation,属性name='National_University_of_General_San_Martín'的节点\nlabel为place,属性name='João_Monlevade'的节点\nlabel为place,属性name='San_Salvador'的节点\nlabel为place,属性name='San_Martín'的节点\nlabel为tag,属性name='José_de_San_Martín'的节点\nlabel为tag,属性name='José_A._Santos'的节点\nlabel为tag,属性name='Juan_Martín_del_Potro'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找José_de_San_Martín的id和名称",
        "output": "match (n1:tag)  where n1.name='José_de_San_Martín' return n1.id, n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 11 of Paulo Santos'的节点\nlabel为forum,属性title='Album 13 of Paulo Santos'的节点\nlabel为forum,属性title='Album 21 of Paulo Santos'的节点\nlabel为organisation,属性name='José_Rizal_University'的节点\nlabel为organisation,属性name='Diego_Portales_University'的节点\nlabel为organisation,属性name='Sardar_Patel_University'的节点\nlabel为place,属性name='San_Pedro_Garza_García'的节点\nlabel为place,属性name='Presidencia_Roque_Sáenz_Peña'的节点\nlabel为place,属性name='Feira_de_Santana'的节点\nlabel为tag,属性name='Paola_Suárez'的节点\nlabel为tag,属性name='Busca_una_mujer'的节点\nlabel为tag,属性name='Searching_for_Jerry_Garcia'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名称为Paola_Suárez的标签的id、名称和URL，最多返回11条结果",
        "output": "match (n1:tag)  where n1.name='Paola_Suárez' return n1.id, n1.name, n1.url limit 11"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 3 of Gregorio Manalo'的节点\nlabel为forum,属性title='Album 13 of Georgios Antoniou'的节点\nlabel为forum,属性title='Album 3 of Miguel Gonzalez'的节点\nlabel为organisation,属性name='Gachongil_College'的节点\nlabel为organisation,属性name='Garcia_College_of_Technology'的节点\nlabel为organisation,属性name='Georgia_Tech_Alumni_Association'的节点\nlabel为place,属性name='San_Pedro_Garza_García'的节点\nlabel为place,属性name='Campos_dos_Goytacazes'的节点\nlabel为place,属性name='San_Nicolás_de_los_Garza'的节点\nlabel为tag,属性name='Gastón_Gaudio'的节点\nlabel为tag,属性name='Getúlio_Vargas'的节点\nlabel为tag,属性name='Ga_Ga_Ga_Ga_Ga'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找标签名为Gastón Gaudio的URL",
        "output": "match (n1:tag)  where n1.name='Gastón_Gaudio' return n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Paul_Newman in Santiago_de_Cuba'的节点\nlabel为forum,属性title='Album 2 of Juan Cardenas'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为organisation,属性name='Rafael_Belloso_Chacin_University'的节点\nlabel为organisation,属性name='Cubana_de_Aviación'的节点\nlabel为organisation,属性name='Comillas_Pontifical_University'的节点\nlabel为place,属性name='San_Pedro_Garza_García'的节点\nlabel为place,属性name='Campos_dos_Goytacazes'的节点\nlabel为place,属性name='San_Miguel_de_Tucumán'的节点\nlabel为tag,属性name='California_Gurls'的节点\nlabel为tag,属性name='Ruggero_Leoncavallo'的节点\nlabel为tag,属性name='Getúlio_Vargas'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找标签Guillermo_Cañas的URL",
        "output": "match (n1:tag)  where n1.name='Guillermo_Cañas' return n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Augustine_of_Hippo in Dazhou'的节点\nlabel为organisation,属性name='Jorge_Amado_University_Center'的节点\nlabel为organisation,属性name='Adolfo_Ibáñez_University'的节点\nlabel为organisation,属性name='José_Rizal_University'的节点\nlabel为place,属性name='Ixtlán_de_Juárez'的节点\nlabel为place,属性name='Campos_dos_Goytacazes'的节点\nlabel为tag,属性name='José_Acasuso'的节点\nlabel为tag,属性name='Louis_Agassiz'的节点\nlabel为tag,属性name='Jaco_Pastorius'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找José_Acasuso的id、名称和URL",
        "output": "match (n1:tag)  where n1.name='José_Acasuso' return n1.id, n1.name, n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Jorge_Tadeo_Lozano_University'的节点\nlabel为organisation,属性name='Arturo_Michelena_University'的节点\nlabel为organisation,属性name='Jorge_Amado_University_Center'的节点\nlabel为place,属性name='João_Monlevade'的节点\nlabel为tag,属性name='Juan_Mónaco'的节点\nlabel为tag,属性name='Juan_Martín_del_Potro'的节点\nlabel为tag,属性name='Busca_una_mujer'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名称为Juan_Mónaco的标签的id、url和名称，并按名称排序",
        "output": "match (n1:tag)  where n1.name='Juan_Mónaco' return n1.id, n1.url, n1.name order by n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Gabriel_Dumont_Institute'的节点\nlabel为organisation,属性name='Debre_Markos_University'的节点\nlabel为organisation,属性name='Damaso_Centeno'的节点\nlabel为tag,属性name='Carlos_Menem'的节点\nlabel为tag,属性name='Hans_Zimmer'的节点\nlabel为tag,属性name='Carl_Gustaf_Emil_Mannerheim'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名称为Carlos Menem的标签的id",
        "output": "match (n1:tag)  where n1.name='Carlos_Menem' return n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Spike_Lee in Debre_Marqos'的节点\nlabel为organisation,属性name='EMI_Ecole_Mohammadia_d'Ingénieurs'的节点\nlabel为organisation,属性name='MIP_Politecnico_di_Milano'的节点\nlabel为organisation,属性name='José_Rizal_University'的节点\nlabel为tag,属性name='Lionel_Messi'的节点\nlabel为tag,属性name='Marco_Melandri'的节点\nlabel为tag,属性name='Lourdes_Domínguez_Lino'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Lionel_Messi的标签的id",
        "output": "match (n1:tag)  where n1.name='Lionel_Messi' return n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 0 of Jetsada Aguilar'的节点\nlabel为forum,属性title='Album 1 of Jetsada Aguilar'的节点\nlabel为forum,属性title='Album 1 of Alexandre Pinzaru'的节点\nlabel为organisation,属性name='Sergio_Arboleda_University'的节点\nlabel为organisation,属性name='Arturo_Prat_University'的节点\nlabel为organisation,属性name='Sardar_Patel_University'的节点\nlabel为place,属性name='San_Pedro_Garza_García'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为place,属性name='Anantapur_district'的节点\nlabel为tag,属性name='Ástor_Piazzolla'的节点\nlabel为tag,属性name='Paulinho_da_Costa'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Ástor_Piazzolla的标签的名称和URL",
        "output": "match (n1:tag)  where n1.name='Ástor_Piazzolla' return n1.name, n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Friedrich_Nietzsche in Poznań'的节点\nlabel为tag,属性name='Néstor_Kirchner'的节点\nlabel为tag,属性name='Menachem_Mendel_Schneerson'的节点\nlabel为tag,属性name='Cristina_Fernández_de_Kirchner'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名称为Néstor Kirchner的标签名称",
        "output": "match (n1:tag)  where n1.name='Néstor_Kirchner' return n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Gabriel_Dumont_Institute'的节点\nlabel为organisation,属性name='Daniel_Payne_College'的节点\nlabel为organisation,属性name='Paul_Sabatier_University'的节点\nlabel为place,属性name='Borey_Seang_Nam'的节点\nlabel为tag,属性name='Daniel_Barenboim'的节点\nlabel为tag,属性name='David_Nalbandian'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名称为Daniel_Barenboim的标签的url和名称，并按名称降序排列",
        "output": "match (n1:tag)  where n1.name='Daniel_Barenboim' return n1.url, n1.name order by n1.name desc"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Jan_Van_Eyck_Academie'的节点\nlabel为tag,属性name='Jonathan_Erlich'的节点\nlabel为tag,属性name='Ivan_Lendl'的节点\nlabel为tag,属性name='John_Dillinger'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名称为Jonathan_Erlich的标签的名称和id",
        "output": "match (n1:tag)  where n1.name='Jonathan_Erlich' return n1.name, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Gabriel_Dumont_Institute'的节点\nlabel为organisation,属性name='Gibbs_College_Vienna'的节点\nlabel为organisation,属性name='Mar_Ivanios_College'的节点\nlabel为tag,属性name='Getúlio_Vargas'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Mario_Vargas_Llosa'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名称为Guillermo_Vilas的标签的id、URL和名称",
        "output": "match (n1:tag)  where n1.name='Guillermo_Vilas' return n1.id, n1.url, n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 21 of Natalia Barbu Codreanu'的节点\nlabel为forum,属性title='Album 13 of Natalia Barbu Codreanu'的节点\nlabel为forum,属性title='Album 11 of Natalia Barbu Codreanu'的节点\nlabel为organisation,属性name='Basanti_Devi_College'的节点\nlabel为organisation,属性name='Jorge_A._Sabato_institute'的节点\nlabel为organisation,属性name='Sant_Gadge_Baba_Amravati_University'的节点\nlabel为tag,属性name='Gabriela_Sabatini'的节点\nlabel为tag,属性name='Anabel_Medina_Garrigues'的节点\nlabel为tag,属性name='Giuseppe_Garibaldi'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名称为Gabriela_Sabatini的标签的id，最多返回8个结果",
        "output": "match (n1:tag)  where n1.name='Gabriela_Sabatini' return n1.id limit 8"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Catherine_the_Great in Lubbock'的节点\nlabel为organisation,属性name='Martin_Luther_Christian_University'的节点\nlabel为organisation,属性name='Ramon_Llull_University'的节点\nlabel为organisation,属性name='Lubbock_Christian_University'的节点\nlabel为tag,属性name='Lucas_Arnold_Ker'的节点\nlabel为tag,属性name='Rufus_Does_Judy_at_Carnegie_Hall'的节点\nlabel为tag,属性name='Lex_Luger'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名称为Lucas_Arnold_Ker的标签的url，最多返回15个结果",
        "output": "match (n1:tag)  where n1.name='Lucas_Arnold_Ker' return n1.url limit 15"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Manuela_Beltrán_University'的节点\nlabel为organisation,属性name='Universitas_Kristen_Krida_Wacana'的节点\nlabel为organisation,属性name='Universidad_Argentina_John_F._Kennedy'的节点\nlabel为person,属性firstname='Bona Pinder Yayumayalolo'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为place,属性name='Presidencia_Roque_Sáenz_Peña'的节点\nlabel为tag,属性name='Cristina_Fernández_de_Kirchner'的节点\nlabel为tag,属性name='Tristan_da_Cunha'的节点\nlabel为tag,属性name='Maria_Elena_Camerin'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Cristina Fernández de Kirchner的id、名称和URL",
        "output": "match (n1:tag)  where n1.name='Cristina_Fernández_de_Kirchner' return n1.id, n1.name, n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Paul_Newman in Santiago_de_Cuba'的节点\nlabel为organisation,属性name='Pablo_de_Olavide_University'的节点\nlabel为organisation,属性name='Rafael_Belloso_Chacin_University'的节点\nlabel为organisation,属性name='Simón_Bolívar_University'的节点\nlabel为place,属性name='San_Pedro_Garza_García'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为place,属性name='Pinar_del_Río'的节点\nlabel为tag,属性name='Paulinho_da_Costa'的节点\nlabel为tag,属性name='Pablo_Cuevas'的节点\nlabel为tag,属性name='Pablo_Picasso'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名称为Pablo_Cuevas的标签的名称、URL和ID，并按名称排序",
        "output": "match (n1:tag)  where n1.name='Pablo_Cuevas' return n1.name, n1.url, n1.id order by n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Colégio_Militar'的节点\nlabel为organisation,属性name='Sir_Gurudas_Mahavidyalaya'的节点\nlabel为organisation,属性name='Chorrillos_Military_School'的节点\nlabel为place,属性name='Chorrillos_District'的节点\nlabel为tag,属性name='Guillermo_Coria'的节点\nlabel为tag,属性name='Giorgio_de_Chirico'的节点\nlabel为tag,属性name='Fiorello_La_Guardia'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Guillermo_Coria的标签名称",
        "output": "match (n1:tag)  where n1.name='Guillermo_Coria' return n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Luiz_Inácio_Lula_da_Silva in Rio_de_Janeiro'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为organisation,属性name='José_Rizal_University'的节点\nlabel为organisation,属性name='Jorge_Tadeo_Lozano_University'的节点\nlabel为organisation,属性name='Jorge_Amado_University_Center'的节点\nlabel为place,属性name='João_Monlevade'的节点\nlabel为place,属性name='San_Pedro_Garza_García'的节点\nlabel为tag,属性name='Juan_Manuel_de_Rosas'的节点\nlabel为tag,属性name='Juan_Martín_del_Potro'的节点\nlabel为tag,属性name='José_Luis_Rodríguez_Zapatero'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找标签为Juan Manuel de Rosas的id、名称和URL",
        "output": "match (n1:tag)  where n1.name='Juan_Manuel_de_Rosas' return n1.id, n1.name, n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 27 of Carlos Gonzalez'的节点\nlabel为forum,属性title='Album 24 of Carlos Gonzalez'的节点\nlabel为organisation,属性name='Rafael_Belloso_Chacin_University'的节点\nlabel为organisation,属性name='José_Rizal_University'的节点\nlabel为organisation,属性name='Jorge_Tadeo_Lozano_University'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为place,属性name='San_Pedro_Garza_García'的节点\nlabel为place,属性name='San_Miguel_de_Tucumán'的节点\nlabel为tag,属性name='Carlos_Tévez'的节点\nlabel为tag,属性name='Sergio_Casal'的节点\nlabel为tag,属性name='Martín_Vassallo_Argüello'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Carlos_Tévez的url、id和名称",
        "output": "match (n1:tag)  where n1.name='Carlos_Tévez' return n1.url, n1.id, n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Recaredo_Castillo_College'的节点\nlabel为organisation,属性name='Diponegoro_University'的节点\nlabel为organisation,属性name='Sergio_Arboleda_University'的节点\nlabel为place,属性name='Chorrillos_District'的节点\nlabel为place,属性name='Pinar_del_Río'的节点\nlabel为tag,属性name='Hernán_Crespo'的节点\nlabel为tag,属性name='Miguel_Hidalgo_y_Costilla'的节点\nlabel为tag,属性name='Rubén_Ramírez_Hidalgo'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Hernán_Crespo的url和id",
        "output": "match (n1:tag)  where n1.name='Hernán_Crespo' return n1.url, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 1 of Pedro Oliveira'的节点\nlabel为forum,属性title='Album 0 of Juan Perez'的节点\nlabel为organisation,属性name='WebJet_Linhas_Aéreas'的节点\nlabel为organisation,属性name='Manuela_Beltrán_University'的节点\nlabel为organisation,属性name='Passaredo_Linhas_Aéreas'的节点\nlabel为person,属性firstname='Bona Pinder Yayumayalolo'的节点\nlabel为place,属性name='San_Pedro_Garza_García'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为place,属性name='Feira_de_Santana'的节点\nlabel为tag,属性name='Eva_Perón'的节点\nlabel为tag,属性name='Busca_una_mujer'的节点\nlabel为tag,属性name='Juan_Martín_del_Potro'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名称为Eva Perón的标签的url和名称，并按名称排序",
        "output": "match (n1:tag)  where n1.name='Eva_Perón' return n1.url, n1.name order by n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Mendel_University_Brno'的节点\nlabel为organisation,属性name='Rafael_Belloso_Chacin_University'的节点\nlabel为organisation,属性name='Gabriel_Dumont_Institute'的节点\nlabel为tag,属性name='Chris_de_Burgh'的节点\nlabel为tag,属性name='Charles_Frédéric_Girard'的节点\nlabel为tag,属性name='Richard_Brinsley_Sheridan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Chris de Burgh的标签的id和名称，并按名称排序",
        "output": "match (n1:tag)  where n1.name='Chris_de_Burgh' return n1.id, n1.name order by n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Spike_Lee in Debre_Marqos'的节点\nlabel为forum,属性title='Group for Miguel_de_Cervantes in Debre_Marqos'的节点\nlabel为organisation,属性name='Rafael_Belloso_Chacin_University'的节点\nlabel为organisation,属性name='Claude_Bernard_University_Lyon_1'的节点\nlabel为organisation,属性name='Sergio_Arboleda_University'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为place,属性name='Antón_Lizardo'的节点\nlabel为place,属性name='Pedro_Escobedo'的节点\nlabel为tag,属性name='Carlos_Berlocq'的节点\nlabel为tag,属性name='Honoré_de_Balzac'的节点\nlabel为tag,属性name='Hector_Berlioz'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Carlos_Berlocque的id和名称",
        "output": "match (n1:tag)  where n1.name='Carlos_Berlocq' return n1.id, n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Luiz_Inácio_Lula_da_Silva in Rio_de_Janeiro'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为organisation,属性name='José_Rizal_University'的节点\nlabel为organisation,属性name='Rafael_Belloso_Chacin_University'的节点\nlabel为organisation,属性name='Jorge_Tadeo_Lozano_University'的节点\nlabel为place,属性name='Antón_Lizardo'的节点\nlabel为place,属性name='Chorrillos_District'的节点\nlabel为place,属性name='Bab_Ezzouar'的节点\nlabel为tag,属性name='Horacio_Zeballos'的节点\nlabel为tag,属性name='José_Luis_Rodríguez_Zapatero'的节点\nlabel为tag,属性name='José_Rizal'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Horacio_Zeballos的id和URL",
        "output": "match (n1:tag)  where n1.name='Horacio_Zeballos' return n1.id, n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 5 of Fernando Alarcón'的节点\nlabel为forum,属性title='Group for Luiz_Inácio_Lula_da_Silva in Rio_de_Janeiro'的节点\nlabel为organisation,属性name='Adolfo_Ibáñez_University'的节点\nlabel为organisation,属性name='Rafael_Belloso_Chacin_University'的节点\nlabel为organisation,属性name='José_Rizal_University'的节点\nlabel为place,属性name='Antón_Lizardo'的节点\nlabel为tag,属性name='Raúl_Alfonsín'的节点\nlabel为tag,属性name='Martín_Vassallo_Argüello'的节点\nlabel为tag,属性name='José_Luis_Rodríguez_Zapatero'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名称为Raúl_Alfonsín的标签的url、名称和id，最多返回5个结果",
        "output": "match (n1:tag)  where n1.name='Raúl_Alfonsín' return n1.url, n1.name, n1.id limit 5"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Rafael_Nadal in Visonta'的节点\nlabel为organisation,属性name='Favaloro_University'的节点\nlabel为organisation,属性name='Rafael_Belloso_Chacin_University'的节点\nlabel为organisation,属性name='Pablo_de_Olavide_University'的节点\nlabel为place,属性name='San_Pedro_Garza_García'的节点\nlabel为place,属性name='Lagoa_da_Prata'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为tag,属性name='Florencia_Labat'的节点\nlabel为tag,属性name='Doremi_Fasol_Latido'的节点\nlabel为tag,属性name='Félix_Mantilla_Botella'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名称为Florencia_Labat的标签的url、id和名称，并按名称降序排列，返回第一个结果",
        "output": "match (n1:tag)  where n1.name='Florencia_Labat' return n1.url, n1.id, n1.name order by n1.name desc limit 1"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Rafael_Nadal in Visonta'的节点\nlabel为tag,属性name='Javier_Frana'的节点\nlabel为tag,属性name='Jon_Favreau'的节点\nlabel为tag,属性name='Philip_José_Farmer'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名称为Javier_Frana的标签的名称和id，并按名称降序排列",
        "output": "match (n1:tag)  where n1.name='Javier_Frana' return n1.name, n1.id order by n1.name desc"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为organisation,属性name='Alberto_Hurtado_University'的节点\nlabel为organisation,属性name='Rafael_Belloso_Chacin_University'的节点\nlabel为organisation,属性name='Jorge_A._Sabato_institute'的节点\nlabel为place,属性name='San_Pedro_Garza_García'的节点\nlabel为place,属性name='Ulan_Bator'的节点\nlabel为place,属性name='Campos_dos_Goytacazes'的节点\nlabel为tag,属性name='Gabriel_Batistuta'的节点\nlabel为tag,属性name='Juan_Bautista_Alvarado'的节点\nlabel为tag,属性name='Anabel_Medina_Garrigues'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找标签Gabriel_Batistuta的名称和URL",
        "output": "match (n1:tag)  where n1.name='Gabriel_Batistuta' return n1.name, n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 1 of Gregorio Manalo'的节点\nlabel为organisation,属性name='Arturo_Michelena_University'的节点\nlabel为organisation,属性name='Arellano_University'的节点\nlabel为organisation,属性name='Arellano_University'的节点\nlabel为tag,属性name='Fernando_Meligeni'的节点\nlabel为tag,属性name='Marcello_Mastroianni'的节点\nlabel为tag,属性name='Benito_Mussolini'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Fernando_Meligeni的标签的名称和URL，并按名称排序",
        "output": "match (n1:tag)  where n1.name='Fernando_Meligeni' return n1.name, n1.url order by n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Adolfo_Ibáñez_University'的节点\nlabel为organisation,属性name='Colegio_de_San_Ildefonso'的节点\nlabel为organisation,属性name='Sergio_Arboleda_University'的节点\nlabel为place,属性name='Antón_Lizardo'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为tag,属性name='Alfredo_Di_Stéfano'的节点\nlabel为tag,属性name='Sacco_and_Vanzetti'的节点\nlabel为tag,属性name='Doremi_Fasol_Latido'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Alfredo Di Stéfano的标签的id、名称和URL，并按名称排序",
        "output": "match (n1:tag)  where n1.name='Alfredo_Di_Stéfano' return n1.id, n1.name, n1.url order by n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for John_Adams in New_Haven'的节点\nlabel为forum,属性title='Group for Joseph_Haydn in Solapur'的节点\nlabel为organisation,属性name='John_Wheatley_College'的节点\nlabel为organisation,属性name='Johns_Hopkins_School_of_Medicine'的节点\nlabel为organisation,属性name='Howell_Hall'的节点\nlabel为tag,属性name='John_Howard'的节点\nlabel为tag,属性name='James_Newton_Howard'的节点\nlabel为tag,属性name='John_Hartford'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为John_Howard的标签名称",
        "output": "match (n1:tag)  where n1.name='John_Howard' return n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Kevin_Rudd in Zhukovsky'的节点\nlabel为forum,属性title='Group for Kevin_Rudd in Zhukovsky'的节点\nlabel为forum,属性title='Group for Kevin_Rudd in Zhukovsky'的节点\nlabel为organisation,属性name='Murdoch_University'的节点\nlabel为organisation,属性name='Mendel_University_Brno'的节点\nlabel为organisation,属性name='Mofid_University'的节点\nlabel为tag,属性name='Rupert_Murdoch'的节点\nlabel为tag,属性name='Under_Rug_Swept'的节点\nlabel为tag,属性name='Murray_Rothbard'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Rupert_Murdoch的名称、id和URL",
        "output": "match (n1:tag)  where n1.name='Rupert_Murdoch' return n1.name, n1.id, n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Hilbert_College'的节点\nlabel为organisation,属性name='Hapag-Lloyd_Flug'的节点\nlabel为organisation,属性name='Hapag-Lloyd_Express'的节点\nlabel为tag,属性name='Lleyton_Hewitt'的节点\nlabel为tag,属性name='Len_Hutton'的节点\nlabel为tag,属性name='John_Greenleaf_Whittier'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Lleyton_Hewitt的标签名称，并按名称排序返回",
        "output": "match (n1:tag)  where n1.name='Lleyton_Hewitt' return n1.name order by n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Link_Campus_University'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名称为Person的标签类的url和id",
        "output": "match (n1:tagclass)  where n1.name='Person' return n1.url, n1.id"
    },
    {
        "instruction": "\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Agent的标签类别的id",
        "output": "match (n1:tagclass)  where n1.name='Agent' return n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Debre_Markos_University'的节点\nlabel为tag,属性name='The_Masses_Against_the_Classes'的节点\nlabel为tag,属性name='Tago_Mago'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名称为Monarch的标签类的名称，最多返回6个结果",
        "output": "match (n1:tagclass)  where n1.name='Monarch' return n1.name limit 6"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Privilege_Style'的节点\nlabel为tag,属性name='Respect_My_Conglomerate'的节点\nlabel为tag,属性name='The_Royal_Scam'的节点\nlabel为tag,属性name='All_of_Our_Names'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Royalty的标签类别的名称",
        "output": "match (n1:tagclass)  where n1.name='Royalty' return n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Holy_Name_University'的节点\nlabel为organisation,属性name='St._Sylvester's_College'的节点\nlabel为organisation,属性name='Saint_Gabriel_College'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Stained_Class'的节点\nlabel为tag,属性name='Stray_Cat_Strut'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名称为Saint的标签类的url、id和名称",
        "output": "match (n1:tagclass)  where n1.name='Saint' return n1.url, n1.id, n1.name"
    },
    {
        "instruction": "\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名称为Cleric的标签类的名称和id，并按名称排序",
        "output": "match (n1:tagclass)  where n1.name='Cleric' return n1.name, n1.id order by n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Rudolf_Steiner_University_College'的节点\nlabel为organisation,属性name='Munich_School_of_Philosophy'的节点\nlabel为organisation,属性name='Paul_Sabatier_University'的节点\nlabel为tag,属性name='Paul_Schrader'的节点\nlabel为tagclass,属性name='Philosopher'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Philosopher的url、id和名称",
        "output": "match (n1:tagclass)  where n1.name='Philosopher' return n1.url, n1.id, n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Mr._Writer'的节点\nlabel为tag,属性name='Paperback_Writer'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Writer的标签类的名称",
        "output": "match (n1:tagclass)  where n1.name='Writer' return n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Ivan_Allen_College_of_Liberal_Arts'的节点\nlabel为organisation,属性name='Music_Industry_Arts'的节点\nlabel为organisation,属性name='Link_Campus_University'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Price_Tag'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名称为Artist的标签类的名称、id和URL",
        "output": "match (n1:tagclass)  where n1.name='Artist' return n1.name, n1.id, n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='The_Name_of_the_Game'的节点\nlabel为tag,属性name='Name_of_the_Game'的节点\nlabel为tag,属性name='Tie_Me_Kangaroo_Down,_Sport'的节点\nlabel为tagclass,属性name='TennisPlayer'的节点\nlabel为tagclass,属性name='GridironFootballPlayer'的节点\nlabel为tagclass,属性name='AmericanFootballPlayer'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找TennisPlayer的URL和名称",
        "output": "match (n1:tagclass)  where n1.name='TennisPlayer' return n1.url, n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Link_Campus_University'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Adal_Sultanate'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Athlete的标签类的url和id",
        "output": "match (n1:tagclass)  where n1.name='Athlete' return n1.url, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Name_of_the_Game'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名称为SoccerPlayer的标签类的url、名称和id，并按名称排序",
        "output": "match (n1:tagclass)  where n1.name='SoccerPlayer' return n1.url, n1.name, n1.id order by n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 11 of Amjad Islam Ahsan'的节点\nlabel为forum,属性title='Album 11 of Abida Ali'的节点\nlabel为forum,属性title='Album 11 of Ali Kountche'的节点\nlabel为organisation,属性name='Music_Industry_Arts'的节点\nlabel为organisation,属性name='An_Music_School'的节点\nlabel为organisation,属性name='Yale_School_of_Music'的节点\nlabel为tag,属性name='Music_for_18_Musicians'的节点\nlabel为tag,属性name='Complete_Music_Video_Collection'的节点\nlabel为tag,属性name='Music_Videos_I'的节点\nlabel为tagclass,属性name='MusicalArtist'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名称为MusicalArtist的标签类的id和URL，最多返回11条结果",
        "output": "match (n1:tagclass)  where n1.name='MusicalArtist' return n1.id, n1.url limit 11"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Center_for_Public_Leadership'的节点\nlabel为organisation,属性name='Instituto_Superior_Santo_Domingo'的节点\nlabel为organisation,属性name='General_Staff_Academy'的节点\nlabel为tag,属性name='Captaincy_General_of_Chile'的节点\nlabel为tag,属性name='Captaincy_General_of_Santo_Domingo'的节点\nlabel为tag,属性name='Welcome_Interstate_Managers'的节点\nlabel为tagclass,属性name='PrimeMinister'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找PrimeMinister的名称和id",
        "output": "match (n1:tagclass)  where n1.name='PrimeMinister' return n1.name, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Kevin_Rudd in Zhukovsky'的节点\nlabel为forum,属性title='Group for Kevin_Rudd in Zhukovsky'的节点\nlabel为forum,属性title='Group for Kevin_Rudd in Zhukovsky'的节点\nlabel为organisation,属性name='Link_Campus_University'的节点\nlabel为organisation,属性name='Ida_Scudder_School'的节点\nlabel为organisation,属性name='Kinnaird_College'的节点\nlabel为tag,属性name='Get_The_Knack'的节点\nlabel为tag,属性name='I_Got_Id'的节点\nlabel为tag,属性name='Curt_Schilling'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Cricketer的url和id",
        "output": "match (n1:tagclass)  where n1.name='Cricketer' return n1.url, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='The_Masses_Against_the_Classes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Comedian的标签类别的名称",
        "output": "match (n1:tagclass)  where n1.name='Comedian' return n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Dum_Dum_Motijheel_College'的节点\nlabel为organisation,属性name='Škoda_Auto_University'的节点\nlabel为organisation,属性name='Link_Campus_University'的节点\nlabel为tag,属性name='Chasing_Cars'的节点\nlabel为tag,属性name='Rapid_City_Muscle_Car'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名称为Cyclist的标签类的url、名称和id，并按名称排序，返回前9个结果",
        "output": "match (n1:tagclass)  where n1.name='Cyclist' return n1.url, n1.name, n1.id order by n1.name limit 9"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='University_of_Applied_Sciences_Trier'的节点\nlabel为organisation,属性name='TESST_College_of_Technology'的节点\nlabel为organisation,属性name='SNS_College_of_Technology'的节点\nlabel为tag,属性name='Lethal_Industry'的节点\nlabel为tag,属性name='Marine_Research'的节点\nlabel为tag,属性name='Symphony_of_Science'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名称为Scientist的标签类的名称，最多返回14条结果",
        "output": "match (n1:tagclass)  where n1.name='Scientist' return n1.name limit 14"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Osama_bin_Laden in Toliara'的节点\nlabel为organisation,属性name='Jamshid_Nakhichevanski_Military_Lyceum'的节点\nlabel为organisation,属性name='Chorrillos_Military_School'的节点\nlabel为organisation,属性name='Chorrillos_Military_School'的节点\nlabel为tag,属性name='Corporal_Clegg'的节点\nlabel为tag,属性name='Osama_bin_Laden'的节点\nlabel为tag,属性name='Captaincy_General_of_Chile'的节点\nlabel为tagclass,属性name='MilitaryPerson'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找MilitaryPerson的名称和URL",
        "output": "match (n1:tagclass)  where n1.name='MilitaryPerson' return n1.name, n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Music_Industry_Arts'的节点\nlabel为organisation,属性name='Michael_Madhusudan_Memorial_College'的节点\nlabel为organisation,属性name='Sardar_Patel_University'的节点\nlabel为tag,属性name='Arif_Mardin'的节点\nlabel为tag,属性name='The_Great_Escape_Artist'的节点\nlabel为tag,属性name='The_Artist_in_the_Ambulance'的节点\nlabel为tagclass,属性name='MartialArtist'的节点\nlabel为tagclass,属性name='MusicalArtist'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找MartialArtist的名称、id和URL",
        "output": "match (n1:tagclass)  where n1.name='MartialArtist' return n1.name, n1.id, n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='James_Cook_University'的节点\nlabel为organisation,属性name='Met_Film_School'的节点\nlabel为tag,属性name='Victory_for_the_Comic_Muse'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Savage_Amusement'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名称为ComicsCreator的标签类的url，最多返回14条结果",
        "output": "match (n1:tagclass)  where n1.name='ComicsCreator' return n1.url limit 14"
    }
]