[
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Wall of Jose Salvador'的节点\nlabel为forum,属性title='Group for Luiz_Inácio_Lula_da_Silva in Rio_de_Janeiro'的节点\nlabel为forum,属性title='Album 28 of Jose Salvador'的节点\nlabel为organisation,属性name='University_of_El_Salvador'的节点\nlabel为organisation,属性name='Universidad_del_Salvador'的节点\nlabel为organisation,属性name='Serviços_Aéreos_Cruzeiro_do_Sul'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为place,属性name='El_Salvador'的节点\nlabel为place,属性name='San_Pedro_Garza_García'的节点\nlabel为tag,属性name='António_de_Oliveira_Salazar'的节点\nlabel为tag,属性name='Luiz_Inácio_Lula_da_Silva'的节点\nlabel为tag,属性name='Arantxa_Sánchez_Vicario'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找El Salvador的名称和URL",
        "output": "match (n1:place)  where n1.name='El_Salvador' return n1.name, n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Concordia_International_University_Estonia'的节点\nlabel为organisation,属性name='Estonian_Information_Technology_College'的节点\nlabel为organisation,属性name='Odessa_College'的节点\nlabel为place,属性name='Ivanovo_Oblast'的节点\nlabel为place,属性name='Iloilo_City'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为tag,属性name='Arantxa_Parra_Santonja'的节点\nlabel为tag,属性name='Austrian_Silesia'的节点\nlabel为tag,属性name='Kingdom_of_East_Anglia'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Estonia的id、网址和名称",
        "output": "match (n1:place)  where n1.name='Estonia' return n1.id, n1.url, n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Ural_Federal_University'的节点\nlabel为organisation,属性name='Florida_Board_of_Regents'的节点\nlabel为organisation,属性name='Fluminense_Federal_University'的节点\nlabel为place,属性name='Fuling_District'的节点\nlabel为place,属性name='Insein_Township'的节点\nlabel为tag,属性name='Illyrian_Provinces'的节点\nlabel为tag,属性name='On_an_Island'的节点\nlabel为tag,属性name='Idlewild_South'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Finland的id、名称和URL，并按名称排序",
        "output": "match (n1:place)  where n1.name='Finland' return n1.id, n1.name, n1.url order by n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Banaras_Hindu_University'的节点\nlabel为organisation,属性name='National_Autonomous_University_of_Honduras'的节点\nlabel为organisation,属性name='Bidhan_Chandra_College,_Asansol'的节点\nlabel为place,属性name='Feira_de_Santana'的节点\nlabel为place,属性name='Anantapur_district'的节点\nlabel为place,属性name='Distrito_de_Bellavista'的节点\nlabel为tag,属性name='Arantxa_Parra_Santonja'的节点\nlabel为tag,属性name='British_Honduras'的节点\nlabel为tag,属性name='Back_in_the_DHSS'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Honduras的地方的网址和名称，并按名称降序排列，返回前9个结果",
        "output": "match (n1:place)  where n1.name='Honduras' return n1.url, n1.name order by n1.name desc limit 9"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='City_University_of_Hong_Kong'的节点\nlabel为organisation,属性name='Hongik_University'的节点\nlabel为organisation,属性name='United_College_of_Hong_Kong'的节点\nlabel为place,属性name='Yongkang_District'的节点\nlabel为place,属性name='Songjiang_District'的节点\nlabel为place,属性name='Haidian_District'的节点\nlabel为tag,属性name='Hong_Kong'的节点\nlabel为tag,属性name='Idlewild_South'的节点\nlabel为tag,属性name='British_Hong_Kong'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为香港的地方的id和名称",
        "output": "match (n1:place)  where n1.name='Hong_Kong' return n1.id, n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='El_Asher_University'的节点\nlabel为organisation,属性name='Dokuz_Eylül_University'的节点\nlabel为organisation,属性name='American_Jewish_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='New_Muslim_Town'的节点\nlabel为place,属性name='El_Oued'的节点\nlabel为tag,属性name='United_Arab_Emirates'的节点\nlabel为tag,属性name='Zine_El_Abidine_Ben_Ali'的节点\nlabel为tag,属性name='Yemen_Arab_Republic'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Israel的地方的url、id和名称，最多返回4个结果",
        "output": "match (n1:place)  where n1.name='Israel' return n1.url, n1.id, n1.name limit 4"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Al-Zaytoonah_University_of_Jordan'的节点\nlabel为organisation,属性name='German-Jordanian_University'的节点\nlabel为organisation,属性name='Jagiellonian_University'的节点\nlabel为tag,属性name='Michael_Jordan'的节点\nlabel为tag,属性name='Robert_Jordan'的节点\nlabel为tag,属性name='John_Zorn'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n按名称降序返回Jordan的名称和URL",
        "output": "match (n1:place)  where n1.name='Jordan' return n1.name, n1.url order by n1.name desc"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='National_University_of_Laos'的节点\nlabel为organisation,属性name='Loyola_University_Andalusia'的节点\nlabel为organisation,属性name='Loyola_University_New_Orleans'的节点\nlabel为place,属性name='Iloilo_City'的节点\nlabel为place,属性name='Larkana_District'的节点\nlabel为place,属性name='Wilayah_Persekutuan_Kuala_Lumpur'的节点\nlabel为tag,属性name='Seventeen_Provinces'的节点\nlabel为tag,属性name='Kingdom_of_Laos'的节点\nlabel为tag,属性name='Al_otro_lado_del_río'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Laos的地方的url和id，限制返回17条结果",
        "output": "match (n1:place)  where n1.name='Laos' return n1.url, n1.id limit 17"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Rafael_Nadal in Visonta'的节点\nlabel为forum,属性title='Group for Luiz_Inácio_Lula_da_Silva in Rio_de_Janeiro'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为organisation,属性name='De_La_Salle_Lipa'的节点\nlabel为organisation,属性name='Triveni_Devi_Bhalotia_College'的节点\nlabel为organisation,属性name='University_of_Latvia'的节点\nlabel为place,属性name='Lagoa_da_Prata'的节点\nlabel为place,属性name='Vallabh_Vidhyanagar'的节点\nlabel为place,属性name='Larkana_District'的节点\nlabel为tag,属性name='In-A-Gadda-Da-Vida'的节点\nlabel为tag,属性name='Al_otro_lado_del_río'的节点\nlabel为tag,属性name='Lope_de_Vega'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Latvia的地方的名称和id",
        "output": "match (n1:place)  where n1.name='Latvia' return n1.name, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Libyan_International_Medical_University'的节点\nlabel为organisation,属性name='Lingaya's_University'的节点\nlabel为organisation,属性name='Ala_Littoria'的节点\nlabel为place,属性name='Chosica,Lima'的节点\nlabel为tag,属性name='Lithuanian_Soviet_Socialist_Republic'的节点\nlabel为tag,属性name='Lutka_sa_naslovne_strane'的节点\nlabel为tag,属性name='Illyrian_Provinces'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Lithuania的网址和名称",
        "output": "match (n1:place)  where n1.name='Lithuania' return n1.url, n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Osama_bin_Laden in Toliara'的节点\nlabel为forum,属性title='Group for Rafael_Nadal in Visonta'的节点\nlabel为organisation,属性name='Malda_Women's_College'的节点\nlabel为organisation,属性name='Maitripa_College'的节点\nlabel为organisation,属性name='Arturo_Michelena_University'的节点\nlabel为tag,属性name='Murda_Muzik'的节点\nlabel为tag,属性name='Busca_una_mujer'的节点\nlabel为tag,属性name='Mujer_Latina'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Malta的id、名称和URL",
        "output": "match (n1:place)  where n1.name='Malta' return n1.id, n1.name, n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Arturo_Michelena_University'的节点\nlabel为organisation,属性name='Mariano_Marcos_State_University'的节点\nlabel为organisation,属性name='Moldova_State_University'的节点\nlabel为place,属性name='Monufia_Governorate'的节点\nlabel为place,属性name='Ratmalana_Airport'的节点\nlabel为tag,属性name='Lutka_sa_naslovne_strane'的节点\nlabel为tag,属性name='Sultanate_of_Maguindanao'的节点\nlabel为tag,属性name='Duchy_of_Mantua'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Mauritania的URL、名称和ID，并按名称排序",
        "output": "match (n1:place)  where n1.name='Mauritania' return n1.url, n1.name, n1.id order by n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Miguel_de_Cervantes in Debre_Marqos'的节点\nlabel为forum,属性title='Wall of Eugene Moke Motsuri'的节点\nlabel为organisation,属性name='University_of_Mauritius'的节点\nlabel为organisation,属性name='Debre_Markos_University'的节点\nlabel为organisation,属性name='Mariano_Marcos_State_University'的节点\nlabel为place,属性name='Debre_Marqos'的节点\nlabel为tag,属性name='Marcus_Junius_Brutus_the_Younger'的节点\nlabel为tag,属性name='Marcus_Aurelius'的节点\nlabel为tag,属性name='Vinicius_de_Moraes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Mauritius的网址和名称",
        "output": "match (n1:place)  where n1.name='Mauritius' return n1.url, n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Mahmud_of_Ghazni in Raniganj'的节点\nlabel为organisation,属性name='Mongolia_International_University'的节点\nlabel为organisation,属性name='Mongolian_University_of_Science_and_Technology'的节点\nlabel为organisation,属性name='Moti_Lal_Nehru_College'的节点\nlabel为place,属性name='Mongolia'的节点\nlabel为place,属性name='Kemerovo_Oblast'的节点\nlabel为place,属性name='Jiaganj_Azimganj'的节点\nlabel为tag,属性name='Mongol_Empire'的节点\nlabel为tag,属性name='Mongolia'的节点\nlabel为tag,属性name='Manmohan_Singh'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为蒙古的地方的名称和网址",
        "output": "match (n1:place)  where n1.name='Mongolia' return n1.name, n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Point_Loma_Nazarene_University'的节点\nlabel为organisation,属性name='State_University_of_Zanzibar'的节点\nlabel为organisation,属性name='State_University_of_Zanzibar'的节点\nlabel为place,属性name='New_Zealand'的节点\nlabel为place,属性name='Zamboanga_City'的节点\nlabel为tag,属性name='Search_for_the_New_Land'的节点\nlabel为tag,属性name='Norfolk_Island'的节点\nlabel为tag,属性name='Idlewild_South'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为New Zealand的地方的URL和ID",
        "output": "match (n1:place)  where n1.name='New_Zealand' return n1.url, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Nicaragüense_de_Aviación'的节点\nlabel为organisation,属性name='National_Autonomous_University_of_Nicaragua'的节点\nlabel为organisation,属性name='Universidad_Anáhuac_México_Norte'的节点\nlabel为place,属性name='San_Nicolás_de_los_Garza'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为place,属性name='San_Pedro_Garza_García'的节点\nlabel为tag,属性name='Territory_of_New_Guinea'的节点\nlabel为tag,属性name='Nigga_Please'的节点\nlabel为tag,属性name='Arantxa_Sánchez_Vicario'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Nicaragua的地方的名称",
        "output": "match (n1:place)  where n1.name='Nicaragua' return n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Friedrich_Nietzsche in Poznań'的节点\nlabel为organisation,属性name='Norway_Airlines'的节点\nlabel为organisation,属性name='Norwegian_Air_Lines'的节点\nlabel为organisation,属性name='Norwegian_School_of_Sport_Sciences'的节点\nlabel为place,属性name='Norway'的节点\nlabel为tag,属性name='Nordic_countries'的节点\nlabel为tag,属性name='Norfolk_Island'的节点\nlabel为tag,属性name='Norway'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找挪威的网址和名称",
        "output": "match (n1:place)  where n1.name='Norway' return n1.url, n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Okan_University'的节点\nlabel为organisation,属性name='Obirin_Junior_College'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为tag,属性name='Osama_bin_Laden'的节点\nlabel为tag,属性name='Muscat_and_Oman'的节点\nlabel为tag,属性name='Odoru_Pompokolin'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Oman的url、名称和id",
        "output": "match (n1:place)  where n1.name='Oman' return n1.url, n1.name, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Latin_University_of_Panama'的节点\nlabel为organisation,属性name='Technological_University_of_Panama'的节点\nlabel为organisation,属性name='National_University_of_La_Pampa'的节点\nlabel为tag,属性name='In_Search_of_Sunrise_3:_Panama'的节点\nlabel为tag,属性name='Pantala_Naga_Pampa'的节点\nlabel为tag,属性name='Las_Palabras_de_Amor'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Panama的地方的名称、id和URL",
        "output": "match (n1:place)  where n1.name='Panama' return n1.name, n1.id, n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为organisation,属性name='University_of_Puerto_Rico_at_Ponce'的节点\nlabel为organisation,属性name='Rio_de_Janeiro_State_University'的节点\nlabel为organisation,属性name='MIP_Politecnico_di_Milano'的节点\nlabel为place,属性name='Iloilo_City'的节点\nlabel为place,属性name='Chorrillos_District'的节点\nlabel为place,属性name='Pinar_del_Río'的节点\nlabel为tag,属性name='Live_in_São_Paulo'的节点\nlabel为tag,属性name='County_of_Portugal'的节点\nlabel为tag,属性name='Seventeen_Provinces'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Puerto Rico的地方的id，最多返回14个结果",
        "output": "match (n1:place)  where n1.name='Puerto_Rico' return n1.id limit 14"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='University_of_Macedonia'的节点\nlabel为organisation,属性name='Moldova_State_University'的节点\nlabel为organisation,属性name='Mariano_Marcos_State_University'的节点\nlabel为place,属性name='Republic_of_Macedonia'的节点\nlabel为place,属性name='Dominican_Republic'的节点\nlabel为tag,属性name='Republic_of_Macedonia'的节点\nlabel为tag,属性name='Kingdom_of_Montenegro'的节点\nlabel为tag,属性name='Maximilian_I_of_Mexico'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Republic_of_Macedonia的名称、id和url",
        "output": "match (n1:place)  where n1.name='Republic_of_Macedonia' return n1.name, n1.id, n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Robert_Redford in Ljubljana'的节点\nlabel为forum,属性title='Group for Franklin_D._Roosevelt in Vadodara'的节点\nlabel为forum,属性title='Group for Franklin_D._Roosevelt in Vadodara'的节点\nlabel为organisation,属性name='National_University_of_Rwanda'的节点\nlabel为organisation,属性name='Vidya_Devi_Jindal_School'的节点\nlabel为organisation,属性name='Padmanava_College_of_Engineering,_Rourkela'的节点\nlabel为place,属性name='Anantapur_district'的节点\nlabel为place,属性name='Larkana_District'的节点\nlabel为place,属性name='Tiruvallur_district'的节点\nlabel为tag,属性name='Kingdom_of_Rwanda'的节点\nlabel为tag,属性name='In-A-Gadda-Da-Vida'的节点\nlabel为tag,属性name='Lope_de_Vega'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Rwanda的地方的url、id和名称，并按名称排序，返回前19个结果",
        "output": "match (n1:place)  where n1.name='Rwanda' return n1.url, n1.id, n1.name order by n1.name limit 19"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='University_of_Sydney_School_of_Geosciences'的节点\nlabel为organisation,属性name='University_of_Sydney_School_of_Geosciences'的节点\nlabel为organisation,属性name='Cardonald_College'的节点\nlabel为place,属性name='Sittwe_District'的节点\nlabel为place,属性name='Chorrillos_District'的节点\nlabel为tag,属性name='Kingdom_of_Scotland'的节点\nlabel为tag,属性name='Flower_of_Scotland'的节点\nlabel为tag,属性name='Idlewild_South'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Scotland的地方的名称和id",
        "output": "match (n1:place)  where n1.name='Scotland' return n1.name, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 15 of Anna Shevchenko'的节点\nlabel为forum,属性title='Group for William_Shakespeare in Vitebsk'的节点\nlabel为forum,属性title='Album 15 of Pavel Kerndlova'的节点\nlabel为organisation,属性name='Moskovia_Airlines'的节点\nlabel为organisation,属性name='Aero_Slovakia'的节点\nlabel为organisation,属性name='Slovak_Airlines'的节点\nlabel为place,属性name='Mladá_Boleslav'的节点\nlabel为place,属性name='Moscow_International_Business_Center'的节点\nlabel为place,属性name='Ivanovo_Oblast'的节点\nlabel为tag,属性name='Lutka_sa_naslovne_strane'的节点\nlabel为tag,属性name='Władysław_IV_Vasa'的节点\nlabel为tag,属性name='Taras_Shevchenko'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Slovakia的网址，最多返回15个结果",
        "output": "match (n1:place)  where n1.name='Slovakia' return n1.url limit 15"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for William_Shakespeare in Vitebsk'的节点\nlabel为forum,属性title='Group for Nikolay_Davydenko in Ahmedpur_Sial'的节点\nlabel为forum,属性title='Group for James_K._Polk in Valdivia'的节点\nlabel为organisation,属性name='Slovak_Medical_University'的节点\nlabel为organisation,属性name='Shevchenko_Transnistria_State_University'的节点\nlabel为organisation,属性name='International_University_of_Sarajevo'的节点\nlabel为place,属性name='Ivanovo_Oblast'的节点\nlabel为place,属性name='Mladá_Boleslav'的节点\nlabel为place,属性name='Slovenia'的节点\nlabel为tag,属性name='Lutka_sa_naslovne_strane'的节点\nlabel为tag,属性name='State_of_Slovenes,_Croats_and_Serbs'的节点\nlabel为tag,属性name='Principality_of_Serbia'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Slovenia的名称、id和网址",
        "output": "match (n1:place)  where n1.name='Slovenia' return n1.name, n1.id, n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Swiss_German_University'的节点\nlabel为organisation,属性name='Farnair_Switzerland'的节点\nlabel为organisation,属性name='Swiss_Private_Aviation'的节点\nlabel为tag,属性name='Austrian_Silesia'的节点\nlabel为tag,属性name='Erwin_Schrödinger'的节点\nlabel为tag,属性name='Old_Swiss_Confederacy'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Switzerland的url、名称和id",
        "output": "match (n1:place)  where n1.name='Switzerland' return n1.url, n1.name, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Genghis_Khan in Asadabad'的节点\nlabel为forum,属性title='Group for Genghis_Khan in Asadabad'的节点\nlabel为forum,属性title='Group for Genghis_Khan in Asadabad'的节点\nlabel为organisation,属性name='Cheikh_Anta_Diop_University'的节点\nlabel为organisation,属性name='Taradevi_Harakhchand_Kankaria_Jain_College'的节点\nlabel为organisation,属性name='Thaksin_University'的节点\nlabel为place,属性name='Jiaganj_Azimganj'的节点\nlabel为place,属性name='Pathum_Thani_Province'的节点\nlabel为place,属性name='Tajikistan'的节点\nlabel为tag,属性name='Tajik_Soviet_Socialist_Republic'的节点\nlabel为tag,属性name='Bal_Gangadhar_Tilak'的节点\nlabel为tag,属性name='Adil_Shahi_dynasty'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Tajikistan的网址、名称和id",
        "output": "match (n1:place)  where n1.name='Tajikistan' return n1.url, n1.name, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='ORT_Uruguay'的节点\nlabel为organisation,属性name='Peruvian_Union_University'的节点\nlabel为organisation,属性name='Federal_Urdu_University'的节点\nlabel为place,属性name='Ulan-Ude'的节点\nlabel为place,属性name='San_Miguel_de_Tucumán'的节点\nlabel为tag,属性name='Get_Ur_Freak_On'的节点\nlabel为tag,属性name='Busca_una_mujer'的节点\nlabel为tag,属性name='Rudy_Giuliani'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Uruguay的id、名称和URL",
        "output": "match (n1:place)  where n1.name='Uruguay' return n1.id, n1.name, n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Wesley_College'的节点\nlabel为organisation,属性name='Walden_University'的节点\nlabel为organisation,属性name='Walden_University'的节点\nlabel为place,属性name='North_Wales'的节点\nlabel为place,属性name='http://maps.google.com/maps?ll=25.530889,69.017306&spn=0.01,0.01&t=m&q=25.530889,69.017306'的节点\nlabel为tag,属性name='The_Valley_Road'的节点\nlabel为tag,属性name='I_Am_the_Walrus'的节点\nlabel为tag,属性name='Kenesaw_Mountain_Landis'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Wales的地方的URL",
        "output": "match (n1:place)  where n1.name='Wales' return n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Luiz_Inácio_Lula_da_Silva in Rio_de_Janeiro'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为organisation,属性name='Boliviana_de_Aviación'的节点\nlabel为organisation,属性name='Azul_Brazilian_Airlines'的节点\nlabel为organisation,属性name='Bolivarian_University_of_Venezuela'的节点\nlabel为place,属性name='Distrito_de_Bellavista'的节点\nlabel为place,属性name='San_Pedro_Garza_García'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为tag,属性name='Pedro_I_of_Brazil'的节点\nlabel为tag,属性name='Brazilian_military_government'的节点\nlabel为tag,属性name='Empire_of_Brazil'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Brazil的地方的id、网址和名称",
        "output": "match (n1:place)  where n1.name='Brazil' return n1.id, n1.url, n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Swiss_German_University'的节点\nlabel为organisation,属性name='German_School_of_Athens'的节点\nlabel为organisation,属性name='German_University_in_Cairo'的节点\nlabel为place,属性name='Freiburg_im_Breisgau'的节点\nlabel为place,属性name='Ústí_nad_Labem'的节点\nlabel为tag,属性name='Allied-occupied_Germany'的节点\nlabel为tag,属性name='North_German_Confederation'的节点\nlabel为tag,属性name='East_Germany'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Germany的地方的名称和URL",
        "output": "match (n1:place)  where n1.name='Germany' return n1.name, n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Indonesia_University_of_Education'的节点\nlabel为organisation,属性name='University_of_Indonesia'的节点\nlabel为organisation,属性name='University_of_Indonesia'的节点\nlabel为place,属性name='Anantapur_district'的节点\nlabel为place,属性name='Iloilo_City'的节点\nlabel为place,属性name='Tamil_Nadu'的节点\nlabel为tag,属性name='Dominion_of_India'的节点\nlabel为tag,属性name='Iparhi_Agapi_Edo'的节点\nlabel为tag,属性name='Nedumudi_Venu'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名称为Indonesia的地方的名称、URL和id，并按名称排序",
        "output": "match (n1:place)  where n1.name='Indonesia' return n1.name, n1.url, n1.id order by n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Kyoto_Sangyo_University'的节点\nlabel为organisation,属性name='Yokohama_National_University'的节点\nlabel为organisation,属性name='Kyoto_Prefectural_University'的节点\nlabel为tag,属性name='Maiden_Japan'的节点\nlabel为tag,属性name='Lovers_in_Japan'的节点\nlabel为tag,属性name='Occupation_of_Japan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找日本的url、id和名称，最多返回4个结果",
        "output": "match (n1:place)  where n1.name='Japan' return n1.url, n1.id, n1.name limit 4"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为forum,属性title='Group for Mstislav_Rostropovich in Moscow'的节点\nlabel为forum,属性title='Group for Mstislav_Rostropovich in Moscow'的节点\nlabel为organisation,属性name='Paleontological_Institute,_Russian_Academy_of_Sciences'的节点\nlabel为organisation,属性name='Russian_State_Social_University'的节点\nlabel为organisation,属性name='Moscow_State_University'的节点\nlabel为place,属性name='Ústí_nad_Labem'的节点\nlabel为place,属性name='Moscow_International_Business_Center'的节点\nlabel为place,属性name='Kemerovo_Oblast'的节点\nlabel为tag,属性name='Lutka_sa_naslovne_strane'的节点\nlabel为tag,属性name='Tsardom_of_Russia'的节点\nlabel为tag,属性name='Rocket_to_Russia'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Russia的地方的url、id和名称，并按名称降序排列",
        "output": "match (n1:place)  where n1.name='Russia' return n1.url, n1.id, n1.name order by n1.name desc"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Mordovian_State_University'的节点\nlabel为organisation,属性name='Ural_State_University'的节点\nlabel为organisation,属性name='State_University_of_Manado'的节点\nlabel为place,属性name='United_States'的节点\nlabel为place,属性name='Major_Cities'的节点\nlabel为place,属性name='Quezon_City'的节点\nlabel为tag,属性name='United_States'的节点\nlabel为tag,属性name='United_States_Live'的节点\nlabel为tag,属性name='Confederate_States_of_America'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为United_States的地方的id，最多返回9个结果",
        "output": "match (n1:place)  where n1.name='United_States' return n1.id limit 9"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Vietnam_Aviation_Academy'的节点\nlabel为organisation,属性name='Vietnam_Academy_of_Science_and_Technology'的节点\nlabel为organisation,属性name='Vietnam_Center_and_Archive'的节点\nlabel为place,属性name='Vallabh_Vidhyanagar'的节点\nlabel为tag,属性name='Nedumudi_Venu'的节点\nlabel为tag,属性name='Viswanathan_Anand'的节点\nlabel为tag,属性name='Guru_Nanak_Dev'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找越南的url、名称和id",
        "output": "match (n1:place)  where n1.name='Vietnam' return n1.url, n1.name, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 14 of Arbaaz Ali'的节点\nlabel为forum,属性title='Album 14 of Amjad Islam Ahsan'的节点\nlabel为forum,属性title='Album 14 of Agustiar Anwar'的节点\nlabel为organisation,属性name='Afghanistan_Public_Policy_Research_Organization'的节点\nlabel为organisation,属性name='Al_Akhawayn_University'的节点\nlabel为organisation,属性name='Amman_Arab_University'的节点\nlabel为place,属性name='Jiaganj_Azimganj'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\nlabel为tag,属性name='Yasser_Arafat'的节点\nlabel为tag,属性name='Dil_Dil_Pakistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找阿富汗的网址，最多返回14个结果",
        "output": "match (n1:place)  where n1.name='Afghanistan' return n1.url limit 14"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Alicia_Keys in Jalpaiguri'的节点\nlabel为forum,属性title='Group for Julie_Andrews in Shah_Alam'的节点\nlabel为organisation,属性name='AlMasria_Universal_Airlines'的节点\nlabel为organisation,属性name='Alzahra_University'的节点\nlabel为organisation,属性name='Aliah_University'的节点\nlabel为place,属性name='Algeria'的节点\nlabel为place,属性name='http://maps.google.com/maps?ll=25.530889,69.017306&spn=0.01,0.01&t=m&q=25.530889,69.017306'的节点\nlabel为tag,属性name='Aceh_Sultanate'的节点\nlabel为tag,属性name='Algeria'的节点\nlabel为tag,属性name='End_of_an_Era'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Algeria的URL",
        "output": "match (n1:place)  where n1.name='Algeria' return n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Mahmud_of_Ghazni in Raniganj'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为organisation,属性name='Qazvin_Islamic_Azad_University'的节点\nlabel为organisation,属性name='Shahid_Madani_University_Of_Azarbaijan'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为place,属性name='Jiaganj_Azimganj'的节点\nlabel为place,属性name='Ramadan_City'的节点\nlabel为place,属性name='Al_Hudaydah'的节点\nlabel为tag,属性name='Mahmud_of_Ghazni'的节点\nlabel为tag,属性name='Yousaf_Raza_Gillani'的节点\nlabel为tag,属性name='Islamic_Emirate_of_Afghanistan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Mahmud_of_Ghazni的URL",
        "output": "match (n1:tag)  where n1.name='Mahmud_of_Ghazni' return n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 11 of Amjad Islam Ahsan'的节点\nlabel为forum,属性title='Album 8 of Amjad Islam Ahsan'的节点\nlabel为forum,属性title='Album 1 of Arbaaz Ali'的节点\nlabel为organisation,属性name='Imam_Sadiq_University'的节点\nlabel为organisation,属性name='Shah_Abdul_Latif_University'的节点\nlabel为organisation,属性name='Sidi_Mohamed_Ben_Abdellah_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Gamal_Abdel_Nasser'的节点\nlabel为tag,属性name='Zine_El_Abidine_Ben_Ali'的节点\nlabel为tag,属性name='Mahmoud_Abbas'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名称为Abbas I of Persia的标签的url和id，最多返回8个结果",
        "output": "match (n1:tag)  where n1.name='Abbas_I_of_Persia' return n1.url, n1.id limit 8"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Cloudman_Hall'的节点\nlabel为organisation,属性name='Hannam_University'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Call_Off_the_Search'的节点\nlabel为tag,属性name='All_of_Our_Names'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名称为Humayun的标签，并按名称排序，返回前两个结果的名称",
        "output": "match (n1:tag)  where n1.name='Humayun' return n1.name order by n1.name limit 2"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Augustine_of_Hippo in Dazhou'的节点\nlabel为forum,属性title='Group for Augustine_of_Hippo in Shenyang'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Uzhhorod_National_University'的节点\nlabel为organisation,属性name='Obirin_Junior_College'的节点\nlabel为place,属性name='Ivanovo_Oblast'的节点\nlabel为tag,属性name='Augustine_of_Hippo'的节点\nlabel为tag,属性name='Iparhi_Agapi_Edo'的节点\nlabel为tag,属性name='Agustín_de_Iturbide'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Augustine_of_Hippo的id、URL和名称",
        "output": "match (n1:tag)  where n1.name='Augustine_of_Hippo' return n1.id, n1.url, n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Louis_XIV_of_France in Indianapolis'的节点\nlabel为organisation,属性name='Pablo_de_Olavide_University'的节点\nlabel为organisation,属性name='Diego_Portales_University'的节点\nlabel为organisation,属性name='Andrés_Bello_University'的节点\nlabel为place,属性name='Pedro_Escobedo'的节点\nlabel为place,属性name='Antón_Lizardo'的节点\nlabel为place,属性name='Debre_Marqos'的节点\nlabel为tag,属性name='Jorge_Luis_Borges'的节点\nlabel为tag,属性name='George_Albert_Boulenger'的节点\nlabel为tag,属性name='Eric_Bogosian'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Jorge Luis Borges的id和名称",
        "output": "match (n1:tag)  where n1.name='Jorge_Luis_Borges' return n1.id, n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Rafael_Belloso_Chacin_University'的节点\nlabel为organisation,属性name='José_Rizal_University'的节点\nlabel为organisation,属性name='Jorge_A._Sabato_institute'的节点\nlabel为place,属性name='San_Pedro_Garza_García'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为place,属性name='San_Nicolás_de_los_Garza'的节点\nlabel为tag,属性name='Juan_Ignacio_Chela'的节点\nlabel为tag,属性name='Busca_una_mujer'的节点\nlabel为tag,属性name='Vasco_da_Gama'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名称为Che Guevara的标签的url、id和名称",
        "output": "match (n1:tag)  where n1.name='Che_Guevara' return n1.url, n1.id, n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 0 of Juan Perez'的节点\nlabel为forum,属性title='Album 1 of Juan Cardenas'的节点\nlabel为organisation,属性name='Paul_Cézanne_University'的节点\nlabel为organisation,属性name='Servicio_de_Publicaciones'的节点\nlabel为organisation,属性name='José_Rizal_University'的节点\nlabel为person,属性firstname='Bona Pinder Yayumayalolo'的节点\nlabel为place,属性name='Pinar_del_Río'的节点\nlabel为tag,属性name='Juan_Martín_del_Potro'的节点\nlabel为tag,属性name='Juan_Perón'的节点\nlabel为tag,属性name='Dion_chante_Plamondon'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Juan Perón的标签的url、id和名称",
        "output": "match (n1:tag)  where n1.name='Juan_Perón' return n1.url, n1.id, n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Rafael_Nadal in Visonta'的节点\nlabel为forum,属性title='Group for Spike_Lee in Debre_Marqos'的节点\nlabel为forum,属性title='Group for Miguel_de_Cervantes in Debre_Marqos'的节点\nlabel为organisation,属性name='Diponegoro_University'的节点\nlabel为organisation,属性name='Damaso_Centeno'的节点\nlabel为organisation,属性name='San_Diego_Miramar_College'的节点\nlabel为place,属性name='Debre_Marqos'的节点\nlabel为place,属性name='João_Monlevade'的节点\nlabel为tag,属性name='Diego_Maradona'的节点\nlabel为tag,属性name='Dario_Argento'的节点\nlabel为tag,属性name='Benicio_del_Toro'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找标签为Diego_Maradona的id",
        "output": "match (n1:tag)  where n1.name='Diego_Maradona' return n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Neil_Diamond in Bhagalpur'的节点\nlabel为forum,属性title='Group for Nikolay_Davydenko in Ahmedpur_Sial'的节点\nlabel为organisation,属性name='DAV_Public_School_Nerul'的节点\nlabel为organisation,属性name='Gabriel_Dumont_Institute'的节点\nlabel为organisation,属性name='Daniel_Payne_College'的节点\nlabel为place,属性name='Dar_es_Salaam'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为place,属性name='Anantapur_district'的节点\nlabel为tag,属性name='David_Nalbandian'的节点\nlabel为tag,属性name='Damon_Albarn'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名称为David_Nalbandian的标签的名称和URL，并按名称排序",
        "output": "match (n1:tag)  where n1.name='David_Nalbandian' return n1.name, n1.url order by n1.name"
    }
]