[
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Sorin_Hall'的节点\nlabel为organisation,属性name='Pawan_Hans'的节点\nlabel为tag,属性name='Hans_Werner_Henze'的节点\nlabel为tag,属性name='Saddam_Hussein'的节点\nlabel为tag,属性name='Hans_Holbein_the_Younger'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Hossein的人的姓氏、生日、语言、位置IP以及他对标签的兴趣创建日期和他的名字",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n1.firstname='Hossein' return n1.lastname, n1.birthday, n1.language, n1.locationip, r1.creationdate, n1.firstname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Robert_Louis_Stevenson in Poznań'的节点\nlabel为organisation,属性name='Shafston_College'的节点\nlabel为organisation,属性name='Rudolf_Steiner_University_College'的节点\nlabel为organisation,属性name='Sorin_Hall'的节点\nlabel为tag,属性name='Shel_Silverstein'的节点\nlabel为tag,属性name='Stone_Cold_Steve_Austin'的节点\nlabel为tag,属性name='John_Huston'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找对Walter Scott感兴趣的Hossein的生日、性别、使用的浏览器、标签id、姓氏、创建日期、语言、兴趣关系的创建日期、名字、邮箱和IP地址，并按标签名称排序，限制返回14条结果",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n2.name='Walter_Scott' and n1.firstname='Hossein' return n1.birthday, n2.name, n1.gender, n1.browserused, n2.id, n1.lastname, n1.creationdate, n1.language, r1.creationdate, n1.firstname, n1.email, n1.locationip order by n2.name limit 14"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Xavier_University_of_Louisiana'的节点\nlabel为organisation,属性name='Houston_Baptist_University'的节点\nlabel为tag,属性name='Christiaan_Huygens'的节点\nlabel为tag,属性name='John_Huston'的节点\nlabel为tag,属性name='Charlton_Heston'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找对C. S. Lewis感兴趣的Hossein的个人信息，包括标签id、姓氏、名字、标签URL、创建日期、邮箱、生日、位置IP、个人id、语言和浏览器使用情况。",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n2.name='C._S._Lewis' and n1.firstname='Hossein' return n2.id, n1.lastname, n1.firstname, n2.url, n1.creationdate, n1.email, n1.birthday, n1.locationip, n1.id, n1.language, n2.name, n1.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Sorin_Hall'的节点\nlabel为organisation,属性name='Gheorghe_Zane_University'的节点\nlabel为tag,属性name='Hans_Werner_Henze'的节点\nlabel为tag,属性name='Hans_Holbein_the_Younger'的节点\nlabel为tag,属性name='Hans_Christian_Andersen'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Hossein的人的兴趣标签的id和名称，同时返回该人的性别、邮箱、名字、生日、id、标签的URL、使用的语言和浏览器。",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n1.firstname='Hossein' return n1.gender, n1.email, n2.id, n1.firstname, n1.birthday, n1.id, n2.url, n1.language, n1.browserused, n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Elizabeth_Female_Academy'的节点\nlabel为organisation,属性name='Queen_Margaret_College'的节点\nlabel为tag,属性name='Elizabeth_I_of_England'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找对Queen Elizabeth The Queen Mother感兴趣的人员使用的浏览器和语言，以及兴趣关系的创建日期",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n2.name='Queen_Elizabeth_The_Queen_Mother' return n1.browserused, r1.creationdate, n1.language"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Sorin_Hall'的节点\nlabel为organisation,属性name='Hannan_University'的节点\nlabel为tag,属性name='Saddam_Hussein'的节点\nlabel为tag,属性name='Henry_Hobson_Richardson'的节点\nlabel为tag,属性name='Hoot_Gibson'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Hossein的人的IP地址、名字、姓氏、语言、性别、兴趣标签的id、兴趣关系的创建日期、人的id和生日",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n1.firstname='Hossein' return n1.locationip, n1.firstname, n1.lastname, n1.language, n1.gender, n2.id, r1.creationdate, n1.id, n1.birthday"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Howard_Hughes in Gardēz'的节点\nlabel为forum,属性title='Group for Robert_Louis_Stevenson in Poznań'的节点\nlabel为organisation,属性name='Martin_College'的节点\nlabel为organisation,属性name='Martin_College'的节点\nlabel为organisation,属性name='Martin_University'的节点\nlabel为person,属性firstname='Martin'的节点\nlabel为tag,属性name='John_Huston'的节点\nlabel为tag,属性name='John_Gosden'的节点\nlabel为tag,属性name='Hermann_von_Helmholtz'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找对George Martin感兴趣的名为Hossein的人的邮箱、性别和姓氏",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n2.name='George_Martin' and n1.firstname='Hossein' return n1.email, n1.gender, n1.lastname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Robert_Louis_Stevenson in Poznań'的节点\nlabel为organisation,属性name='Robson_Hall'的节点\nlabel为organisation,属性name='Rosen_College_of_Hospitality_Management'的节点\nlabel为organisation,属性name='Robin_Hood_Aviation'的节点\nlabel为tag,属性name='Hot_Rocks_1964–1971'的节点\nlabel为tag,属性name='Henry_Hobson_Richardson'的节点\nlabel为tag,属性name='Theodore_Roosevelt'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找对Theodore_Roosevelt感兴趣的名为Hossein的人的创建日期、兴趣关系的创建日期、性别、标签id、标签名称、语言、生日、最后名字和位置IP，并按标签名称降序排列，最多返回16条记录。",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n2.name='Theodore_Roosevelt' and n1.firstname='Hossein' return n1.creationdate, r1.creationdate, n1.gender, n2.id, n2.name, n1.language, n1.birthday, n1.lastname, n1.locationip order by n2.name desc limit 16"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Robert_Louis_Stevenson in Poznań'的节点\nlabel为forum,属性title='Group for John_Adams in New_Haven'的节点\nlabel为organisation,属性name='Fred_Olsen_Air_Transport'的节点\nlabel为organisation,属性name='Thomas_Cook_Airlines'的节点\nlabel为organisation,属性name='Thomas_Cook_Airlines'的节点\nlabel为tag,属性name='Thomas_Jefferson'的节点\nlabel为tag,属性name='Jesse_Jackson'的节点\nlabel为tag,属性name='Joseph_E._Johnston'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找对Thomas_Jefferson感兴趣的人员的性别、使用的浏览器、姓氏、电子邮件、兴趣创建日期、位置IP、标签名称、人员ID、名字、标签URL、生日、人员创建日期和语言，并按标签名称降序排列",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n2.name='Thomas_Jefferson' return n1.gender, n1.browserused, n1.lastname, n1.email, r1.creationdate, n1.locationip, n2.name, n1.id, n1.firstname, n2.url, n1.birthday, n2.id, n1.creationdate, n1.language order by n2.name desc"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Burnett_Honors_College'的节点\nlabel为organisation,属性name='Houston_Baptist_University'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为place,属性name='Borey_Seang_Nam'的节点\nlabel为tag,属性name='Bob_Hoskins'的节点\nlabel为tag,属性name='Benjamin_Harrison'的节点\nlabel为tag,属性name='Hoot_Gibson'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Hossein的人对Bing Crosby标签的兴趣，返回该人的性别、电子邮件、位置IP和姓氏，以及兴趣的创建日期、标签的ID和URL。",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n1.firstname='Hossein' and n2.name='Bing_Crosby' return n1.gender, n1.email, n2.id, r1.creationdate, n1.firstname, n1.locationip, n2.url, n1.lastname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Heinz_Guderian in Dire_Dawa'的节点\nlabel为forum,属性title='Group for Heinz_Guderian in Dire_Dawa'的节点\nlabel为forum,属性title='Group for Heinz_Guderian in Dire_Dawa'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Zakir_Husain_Delhi_College'的节点\nlabel为organisation,属性name='DG_Vaishnav_College'的节点\nlabel为tag,属性name='Devon_Hughes'的节点\nlabel为tag,属性name='Wallis_Simpson'的节点\nlabel为tag,属性name='Dustin_Hoffman'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找对Miles Davis感兴趣的Hossein的id和Miles Davis标签的URL",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n2.name='Miles_Davis' and n1.firstname='Hossein' return n1.id, n2.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Hansung_Science_High_School'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Sorin_Hall'的节点\nlabel为tag,属性name='Hans_Werner_Henze'的节点\nlabel为tag,属性name='Michael_Heseltine'的节点\nlabel为tag,属性name='Hans_Holbein_the_Younger'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Hossein的人的兴趣标签信息，包括该人的创建日期、兴趣关系的创建日期、标签的id和url、该人的生日、语言、id、性别、姓氏以及使用的浏览器。",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n1.firstname='Hossein' return n1.creationdate, r1.creationdate, n2.id, n2.url, n1.birthday, n1.language, n1.id, n1.gender, n1.lastname, n1.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Osama_bin_Laden in Toliara'的节点\nlabel为forum,属性title='Group for Benny_Goodman in Vadodara'的节点\nlabel为organisation,属性name='Sam_Ratulangi_University'的节点\nlabel为organisation,属性name='Allameh_Tabatabai_University'的节点\nlabel为organisation,属性name='Dalit_Bahujan_Shramik_Union'的节点\nlabel为tag,属性name='Bal_Gangadhar_Tilak'的节点\nlabel为tag,属性name='Rahul_Dev_Burman'的节点\nlabel为tag,属性name='David_Nalbandian'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找对Timbaland感兴趣的人员的姓名、id、姓氏、兴趣创建日期、邮箱、标签URL、位置IP、生日、创建日期、名字、浏览器、性别和语言",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n2.name='Timbaland' return n2.name, n2.id, n1.lastname, r1.creationdate, n1.email, n2.url, n1.locationip, n1.birthday, n1.creationdate, n1.firstname, n1.browserused, n1.gender, n1.language"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Howard_Hughes in Gardēz'的节点\nlabel为forum,属性title='Group for Robert_Louis_Stevenson in Poznań'的节点\nlabel为forum,属性title='Group for Suleiman_the_Magnificent in New_Haven'的节点\nlabel为organisation,属性name='Sorin_Hall'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Robson_Hall'的节点\nlabel为person,属性firstname='Hans'的节点\nlabel为person,属性firstname='Hans'的节点\nlabel为person,属性firstname='Hans'的节点\nlabel为place,属性name='Borey_Seang_Nam'的节点\nlabel为tag,属性name='Hans_Holbein_the_Younger'的节点\nlabel为tag,属性name='Heinz-Harald_Frentzen'的节点\nlabel为tag,属性name='Christiaan_Huygens'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Hossein的前9个人的名",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n1.firstname='Hossein' return n1.firstname limit 9"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Karl_Marx in New_Haven'的节点\nlabel为forum,属性title='Group for John_Adams in New_Haven'的节点\nlabel为organisation,属性name='Hans_Raj_College'的节点\nlabel为organisation,属性name='James_Cook_University'的节点\nlabel为organisation,属性name='Harrison_College'的节点\nlabel为tag,属性name='Hank_Jones'的节点\nlabel为tag,属性name='Bob_Hoskins'的节点\nlabel为tag,属性name='Benjamin_Harrison'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Hossein的人对Jack_Kirby标签的兴趣的创建日期和标签名称",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n2.name='Jack_Kirby' and n1.firstname='Hossein' return n1.creationdate, n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Robert_Louis_Stevenson in Poznań'的节点\nlabel为organisation,属性name='Robertson_College'的节点\nlabel为organisation,属性name='Roger_Williams_University'的节点\nlabel为organisation,属性name='Robin_Hood_Aviation'的节点\nlabel为tag,属性name='Roy_Orbison'的节点\nlabel为tag,属性name='Rob_Paulsen'的节点\nlabel为tag,属性name='Ron_Simmons'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找对Roy Orbison感兴趣的人员的id、浏览器使用情况、姓氏、性别、语言、位置IP、生日、创建日期以及Roy Orbison的id、名称和URL，同时返回兴趣关系的创建日期",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n2.name='Roy_Orbison' return n2.id, n1.browserused, n2.name, n2.url, n1.id, n1.lastname, n1.gender, n1.language, n1.locationip, n1.birthday, r1.creationdate, n1.creationdate, n1.firstname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for John_Lennon in Chaozhou'的节点\nlabel为forum,属性title='Group for Howard_Hughes in Gardēz'的节点\nlabel为forum,属性title='Group for Karl_Marx in New_Haven'的节点\nlabel为organisation,属性name='Hans_Raj_College'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Hannan_University'的节点\nlabel为tag,属性name='Hans_Werner_Henze'的节点\nlabel为tag,属性name='Mark_Hughes'的节点\nlabel为tag,属性name='Marvin_Hamlisch'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Hossein的人对Hank_Williams标签的兴趣，返回标签的URL，人的创建日期、ID、名字、标签名称和姓氏，并按标签名称排序",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n1.firstname='Hossein' and n2.name='Hank_Williams' return n2.url, n1.creationdate, n1.id, n1.firstname, n2.name, n1.lastname order by n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Hans_Raj_College'的节点\nlabel为tag,属性name='Jesse_Helms'的节点\nlabel为tag,属性name='Jesse_James'的节点\nlabel为tag,属性name='Jesse_Jackson'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找对Henry_James感兴趣的人员的创建日期、id、姓氏、标签的URL、兴趣关系的创建日期、标签的id、名称、使用的浏览器、名字、性别、生日、语言和邮箱",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n2.name='Henry_James' return n1.creationdate, n1.id, n1.lastname, n2.url, r1.creationdate, n2.id, n2.name, n1.browserused, n1.firstname, n1.gender, n1.birthday, n1.language, n1.email"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Joseph_Haydn in Solapur'的节点\nlabel为organisation,属性name='Sorin_Hall'的节点\nlabel为organisation,属性name='Hannan_University'的节点\nlabel为organisation,属性name='Hans_Raj_College'的节点\nlabel为tag,属性name='Alexander_Shulgin'的节点\nlabel为tag,属性name='Hans_Christian_Andersen'的节点\nlabel为tag,属性name='Adam_Sandler'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Hossein的人对Adam_Sandler标签的兴趣信息，返回标签的URL、Hossein使用的浏览器、兴趣的创建日期、Hossein的创建日期、标签的ID、Hossein的姓氏和名字",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n1.firstname='Hossein' and n2.name='Adam_Sandler' return n2.url, n1.browserused, r1.creationdate, n1.creationdate, n2.id, n1.lastname, n1.firstname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for F._Scott_Fitzgerald in Chaozhou'的节点\nlabel为forum,属性title='Group for Benjamin_Franklin in Vadodara'的节点\nlabel为organisation,属性name='Gordon_Institute_of_TAFE'的节点\nlabel为organisation,属性name='Florida_Student_Association'的节点\nlabel为organisation,属性name='Franklin_University'的节点\nlabel为tag,属性name='F._Scott_Fitzgerald'的节点\nlabel为tag,属性name='Felix_Frankfurter'的节点\nlabel为tag,属性name='Michael_J._Fox'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找对F. Scott Fitzgerald感兴趣的人员的详细信息，包括他们的语言、id、名字、标签id、标签名称、邮箱、浏览器、性别、生日、位置IP、标签URL、创建日期以及兴趣关系的创建日期，限制返回19条结果。",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n2.name='F._Scott_Fitzgerald' return n1.language, n1.id, n1.firstname, n2.id, n2.name, n1.email, n1.browserused, n1.gender, n1.birthday, n1.locationip, n2.url, n1.creationdate, n1.lastname, r1.creationdate limit 19"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Marian_Engineering_College'的节点\nlabel为organisation,属性name='Alrosa_Mirny_Air_Enterprise'的节点\nlabel为organisation,属性name='Rio_Branco_Institute'的节点\nlabel为tag,属性name='Mickey_Rooney'的节点\nlabel为tag,属性name='Ronnie_James_Dio'的节点\nlabel为tag,属性name='Roger_McGuinn'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找对Mickey_Rooney感兴趣的人员的兴趣创建日期、生日、语言、性别以及Mickey_Rooney的id和名称",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n2.name='Mickey_Rooney' return r1.creationdate, n1.birthday, n1.language, n2.name, n2.id, n1.gender"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Joe_Cocker in Brahmavar'的节点\nlabel为forum,属性title='Group for Joe_Cocker in Galați'的节点\nlabel为organisation,属性name='James_Cook_University'的节点\nlabel为organisation,属性name='Ajay_Kumar_Garg_Engineering_College'的节点\nlabel为organisation,属性name='Konark_Institute_of_Science_and_Technology'的节点\nlabel为tag,属性name='Jack_Kerouac'的节点\nlabel为tag,属性name='Jacky_Ickx'的节点\nlabel为tag,属性name='James_K._Polk'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找对Jack_Kerouac感兴趣的人员的生日、IP地址、兴趣创建日期、标签URL、浏览器使用情况、创建日期、标签名称、人员ID、姓氏、名字和性别",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n2.name='Jack_Kerouac' return n1.birthday, n1.locationip, r1.creationdate, n2.url, n1.browserused, n1.creationdate, n2.name, n1.id, n1.lastname, n1.firstname, n1.gender"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Robert_Louis_Stevenson in Poznań'的节点\nlabel为forum,属性title='Group for Friedrich_Nietzsche in Poznań'的节点\nlabel为organisation,属性name='Hochschule_für_Musik_Hanns_Eisler'的节点\nlabel为organisation,属性name='Humboldt_University_of_Berlin'的节点\nlabel为organisation,属性name='Hugo_Lambrechts_Music_Centre'的节点\nlabel为place,属性name='Freiburg_im_Breisgau'的节点\nlabel为tag,属性name='Heinz-Harald_Frentzen'的节点\nlabel为tag,属性name='Hans_Werner_Henze'的节点\nlabel为tag,属性name='Friedrich_Hölderlin'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Hossein且对Ludwig van Beethoven感兴趣的个人的创建日期、姓氏、性别和生日，以及兴趣标签的名称",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n1.firstname='Hossein' and n2.name='Ludwig_van_Beethoven' return n1.creationdate, n2.name, n1.lastname, n1.gender, n1.birthday"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Sorin_Hall'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Hansung_Science_High_School'的节点\nlabel为tag,属性name='Hans_Werner_Henze'的节点\nlabel为tag,属性name='Goon_Affiliated'的节点\nlabel为tag,属性name='Hans_Holbein_the_Younger'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Hossein的人的兴趣标签，返回该人的性别、兴趣关系的创建日期、该人的创建日期、id、浏览器使用情况、姓氏，以及兴趣标签的名称和URL。",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n1.firstname='Hossein' return n1.gender, r1.creationdate, n1.creationdate, n1.id, n2.name, n1.browserused, n2.url, n1.lastname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Sorin_Hall'的节点\nlabel为organisation,属性name='Hannan_University'的节点\nlabel为tag,属性name='Goon_Affiliated'的节点\nlabel为tag,属性name='Saddam_Hussein'的节点\nlabel为tag,属性name='Hoot_Gibson'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Hossein的人的兴趣标签的id，以及该人的浏览器使用情况、创建日期、性别、位置IP和兴趣关系的创建日期",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n1.firstname='Hossein' return n1.firstname, n1.browserused, n1.creationdate, n1.gender, n2.id, n1.locationip, r1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Shadow_Zone'的节点\nlabel为tag,属性name='Under_Blackpool_Lights'的节点\nlabel为tag,属性name='Shadows_Collide_with_People'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找对Shadow_Zone感兴趣的用户的IP地址、性别，并返回前10个结果，同时返回标签名称",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n2.name='Shadow_Zone' return n1.locationip, n1.gender, n2.name limit 10"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Wesley_Institute'的节点\nlabel为organisation,属性name='Wesley_College'的节点\nlabel为organisation,属性name='Burnett_Honors_College'的节点\nlabel为tag,属性name='Shawty_Get_Loose'的节点\nlabel为tag,属性name='Wooly_Bully'的节点\nlabel为tag,属性name='Wesley_Snipes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找对Wooly_Bully感兴趣的Hossein的位置IP和他使用的浏览器，以及该标签的名称",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n2.name='Wooly_Bully' and n1.firstname='Hossein' return n1.locationip, n2.name, n1.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='William_Carey_University'的节点\nlabel为organisation,属性name='Harrison_College'的节点\nlabel为organisation,属性name='Hans_Raj_College'的节点\nlabel为tag,属性name='Goon_Affiliated'的节点\nlabel为tag,属性name='Katherine_Heigl'的节点\nlabel为tag,属性name='Greer_Garson'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找对Cary Grant感兴趣的Hossein的姓氏、Cary Grant标签的URL和id、Hossein的id、创建日期和性别",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n2.name='Cary_Grant' and n1.firstname='Hossein' return n1.lastname, n2.url, n2.id, n1.id, n1.creationdate, n1.gender"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Golden_Gate_University'的节点\nlabel为organisation,属性name='KLM_Cityhopper'的节点\nlabel为organisation,属性name='Jind_Institute_of_Engineering_and_Technology'的节点\nlabel为tag,属性name='Gold_Digger'的节点\nlabel为tag,属性name='Hoot_Gibson'的节点\nlabel为tag,属性name='Goon_Affiliated'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找对Gold_Digger感兴趣的Hossein的IP地址、语言、标签id、人员id、姓氏、浏览器使用情况、创建日期、标签URL和电子邮件地址",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n2.name='Gold_Digger' and n1.firstname='Hossein' return n1.locationip, n1.language, n2.id, n1.id, n1.lastname, n1.browserused, n1.creationdate, n2.url, n1.email"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Sorin_Hall'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Huston–Tillotson_University'的节点\nlabel为tag,属性name='Charlton_Heston'的节点\nlabel为tag,属性name='John_Huston'的节点\nlabel为tag,属性name='Henry_Hobson_Richardson'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找对Charlton_Heston感兴趣的Hossein的个人信息，包括他的名字、姓氏、创建日期、位置IP、性别、兴趣创建日期、id、电子邮件、生日、语言和浏览器使用情况，以及标签的id和名称。",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n2.name='Charlton_Heston' and n1.firstname='Hossein' return n1.firstname, n1.lastname, n1.creationdate, n1.locationip, n1.gender, r1.creationdate, n1.id, n1.email, n1.birthday, n2.id, n1.language, n2.name, n1.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Howard_Hughes in Gardēz'的节点\nlabel为forum,属性title='Group for Paul_Newman in Santiago_de_Cuba'的节点\nlabel为organisation,属性name='Rafael_Belloso_Chacin_University'的节点\nlabel为organisation,属性name='José_Rizal_University'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为tag,属性name='Saddam_Hussein'的节点\nlabel为tag,属性name='Hugo_Chávez'的节点\nlabel为tag,属性name='Manuel_L._Quezon'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Hossein且对Hugo Chávez感兴趣的用户的创建日期和Hugo Chávez标签的URL",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n2.name='Hugo_Chávez' and n1.firstname='Hossein' return n1.creationdate, n2.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Sorin_Hall'的节点\nlabel为organisation,属性name='Hugo_Lambrechts_Music_Centre'的节点\nlabel为organisation,属性name='An_Music_School'的节点\nlabel为tag,属性name='Long_Play_Album'的节点\nlabel为tag,属性name='List_of_RahXephon_albums'的节点\nlabel为tag,属性name='Hans_Holbein_the_Younger'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找对Long_Play_Album感兴趣的Hossein的性别、使用的浏览器、语言、标签的URL、姓氏、生日、标签名称和名字",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n2.name='Long_Play_Album' and n1.firstname='Hossein' return n1.gender, n1.browserused, n1.language, n2.url, n1.lastname, n1.birthday, n2.name, n1.firstname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='When_I_Need_You'的节点\nlabel为tag,属性name='I_Need_Mine'的节点\nlabel为tag,属性name='You_Needed_Me'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找对You_Needed_Me感兴趣的用户兴趣关系的创建日期",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n2.name='You_Needed_Me' return r1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Sorin_Hall'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Nancy_2_University'的节点\nlabel为tag,属性name='Van_Halen_II'的节点\nlabel为tag,属性name='Hannah_Montana_3'的节点\nlabel为tag,属性name='Sonny_Boy_Williamson_II'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Hossein且对2_Become_1感兴趣的个人的语言、性别、兴趣标签名称、名字、创建日期、url、id、生日和姓氏，并按兴趣标签名称降序排列",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n1.firstname='Hossein' and n2.name='2_Become_1' return n1.language, n1.gender, n2.name, n1.firstname, n1.creationdate, n2.url, n1.id, n1.birthday, n1.lastname order by n2.name desc"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Gimme_Back_My_Bullets'的节点\nlabel为tag,属性name='Bulletproof_Wallets'的节点\nlabel为tag,属性name='Get_Busy'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找对Bulletproof_Wallets感兴趣的用户，返回兴趣的创建日期和标签名称，并按标签名称排序",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n2.name='Bulletproof_Wallets' return r1.creationdate, n2.name order by n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为tag,属性name='Where_or_When'的节点\nlabel为tag,属性name='Day_&_Age'的节点\nlabel为tag,属性name='Want_Ads'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找对Where_or_When感兴趣的人员的浏览器使用情况、性别、id、标签id、姓氏和生日",
        "output": "match (n1:person)-[r1:hasinterest]->(n2:tag)  where n2.name='Where_or_When' return n1.browserused, n1.gender, n1.id, n2.id, n1.lastname, n1.birthday"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Kamal_Haasan in Orlando'的节点\nlabel为forum,属性title='Group for Joseph_Haydn in Solapur'的节点\nlabel为forum,属性title='Group for Genghis_Khan in Asadabad'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Zakir_Husain_Delhi_College'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为person,属性firstname='Hassan'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为place,属性name='Pathum_Thani_Province'的节点\nlabel为tag,属性name='Ahmad_Shah_Durrani'的节点\nlabel为tag,属性name='Hussein_of_Jordan'的节点\nlabel为tag,属性name='Kamal_Haasan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Hossein且位于Tehran的人的生日和id，同时返回Tehran的url和id，最多返回7条结果",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n1.firstname='Hossein' and n2.name='Tehran' return n2.url, n1.birthday, n2.id, n1.id limit 7"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Kevin_Rudd in Zhukovsky'的节点\nlabel为forum,属性title='Group for Kevin_Rudd in Zhukovsky'的节点\nlabel为forum,属性title='Group for Kevin_Rudd in Zhukovsky'的节点\nlabel为organisation,属性name='Krasnoyarsk_State_University'的节点\nlabel为organisation,属性name='Adam_Mickiewicz_University_in_Poznań'的节点\nlabel为organisation,属性name='Kozminski_University'的节点\nlabel为place,属性name='Hradec_Králové'的节点\nlabel为place,属性name='Larkana_District'的节点\nlabel为place,属性name='Dera_Ismail_Khan'的节点\nlabel为tag,属性name='Jane_Krakowski'的节点\nlabel为tag,属性name='John_Krasinski'的节点\nlabel为tag,属性name='Richard_Krajicek'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找居住在Kraków且名字为Jan的人的创建日期、语言、邮箱、关系的创建日期、名字和id，限制返回13条结果",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n2.name='Kraków' and n1.firstname='Jan' return n1.creationdate, n1.language, n1.email, r1.creationdate, n1.firstname, n1.id limit 13"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for William_Shakespeare in Vitebsk'的节点\nlabel为forum,属性title='Group for James_K._Polk in Valdivia'的节点\nlabel为forum,属性title='Group for Kevin_Rudd in Zhukovsky'的节点\nlabel为organisation,属性name='Adam_Mickiewicz_University_in_Poznań'的节点\nlabel为organisation,属性name='Taras_Shevchenko_National_University_of_Kyiv'的节点\nlabel为organisation,属性name='Voronezh_State_University'的节点\nlabel为place,属性name='Ivanovo_Oblast'的节点\nlabel为place,属性name='Moscow_International_Business_Center'的节点\nlabel为place,属性name='Hradec_Králové'的节点\nlabel为tag,属性name='Alexander_Vladimirovich_Volkov'的节点\nlabel为tag,属性name='Yevgeny_Kafelnikov'的节点\nlabel为tag,属性name='Wassily_Kandinsky'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找住在Katowice且名字为Wojciech的人的性别和生日，并返回他们的居住地网址，最多返回2条结果",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n2.name='Katowice' and n1.firstname='Wojciech' return n2.url, n1.gender, n1.birthday limit 2"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为organisation,属性name='Al-Ahliyya_Amman_University'的节点\nlabel为organisation,属性name='Al_Akhawayn_University'的节点\nlabel为organisation,属性name='Obirin_Junior_College'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为place,属性name='Rahim_Yar_Khan'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\nlabel为tag,属性name='Ahmad_Shah_Durrani'的节点\nlabel为tag,属性name='Zine_El_Abidine_Ben_Ali'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找在Oran且名为Ali的人的详细信息，包括名、创建日期、位置IP、所在地点的URL、姓、生日、邮箱、ID、浏览器使用情况和语言。",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n2.name='Oran' and n1.firstname='Ali' return n1.firstname, n1.creationdate, n1.locationip, n2.url, n1.lastname, n1.birthday, n1.email, n1.id, n1.browserused, n1.language"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为forum,属性title='Group for Nikolay_Davydenko in Ahmedpur_Sial'的节点\nlabel为forum,属性title='Wall of Ahmad Zakii Lee'的节点\nlabel为organisation,属性name='ACSI_College-Iloilo'的节点\nlabel为organisation,属性name='Altai_State_University'的节点\nlabel为organisation,属性name='Mohammad_Ali_Jinnah_University'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Iloilo_City'的节点\nlabel为place,属性name='Addis_Ababa'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\nlabel为tag,属性name='Hyder_Ali'的节点\nlabel为tag,属性name='Muhammad_Ali'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Ali的人的id及其所在地点的名称",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n1.firstname='Ali' return n1.id, n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Miguel_de_Cervantes in Rio_de_Janeiro'的节点\nlabel为forum,属性title='Group for Paul_Newman in Santiago_de_Cuba'的节点\nlabel为forum,属性title='Group for Plato in Chifeng'的节点\nlabel为organisation,属性name='Chapingo_Autonomous_University'的节点\nlabel为organisation,属性name='Jorge_A._Sabato_institute'的节点\nlabel为organisation,属性name='PSG_Institute_of_Management_Coimbatore'的节点\nlabel为place,属性name='Pedro_Escobedo'的节点\nlabel为place,属性name='West_Papua'的节点\nlabel为place,属性name='Nakhon_Pathom_Province'的节点\nlabel为tag,属性name='Philip_IV_of_Spain'的节点\nlabel为tag,属性name='Georges_Pompidou'的节点\nlabel为tag,属性name='Iparhi_Agapi_Edo'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找位于Chapingo的前5个人的姓名、关联关系的创建日期和这些人的id",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n2.name='Chapingo' return n1.firstname, r1.creationdate, n1.id limit 5"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Debre_Markos_University'的节点\nlabel为organisation,属性name='Deakin_University'的节点\nlabel为organisation,属性name='Deakin_University'的节点\nlabel为tag,属性name='Dick_Van_Dyke'的节点\nlabel为tag,属性name='John_Diefenbaker'的节点\nlabel为tag,属性name='Teddy_Picker'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Deepak的人的姓氏和使用的浏览器",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n1.firstname='Deepak' return n1.lastname, n1.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Bob_Dole in Thrissur'的节点\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为forum,属性title='Group for Louis_XIV_of_France in Indianapolis'的节点\nlabel为organisation,属性name='Suleyman_Demirel_University'的节点\nlabel为organisation,属性name='Dokuz_Eylül_University'的节点\nlabel为organisation,属性name='Jean_Moulin_University_Lyon_3'的节点\nlabel为place,属性name='Tiruvallur_district'的节点\nlabel为tag,属性name='Hyder_Ali'的节点\nlabel为tag,属性name='Brian_Dabul'的节点\nlabel为tag,属性name='Adrian_Belew'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找位于Diourbel的前三个人的个人信息，包括他们的id、使用的语言、浏览器和性别，同时返回Diourbel的url和id",
        "output": "match (n1:person)-[r1:islocatedinperson]->(n2:place)  where n2.name='Diourbel' return n2.url, n1.id, n2.id, n1.language, n1.browserused, n1.gender limit 3"
    }
]