[
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 14 of Ali Achiou'的节点\nlabel为forum,属性title='Album 34 of Ali Achiou'的节点\nlabel为forum,属性title='Album 24 of Ali Achiou'的节点\nlabel为organisation,属性name='Al-Ahliyya_Amman_University'的节点\nlabel为organisation,属性name='Al_Akhawayn_University'的节点\nlabel为organisation,属性name='Amman_Arab_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='The_Help_Album'的节点\nlabel为tag,属性name='Gangsta_Grillz:_The_Album'的节点\nlabel为tag,属性name='The_Barbra_Streisand_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 14 of Ali Achiou的标题、创建日期和id",
        "output": "match (n1:forum)  where n1.title='Album 14 of Ali Achiou' return n1.title, n1.creationdate, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 15 of Ali Achiou'的节点\nlabel为forum,属性title='Album 15 of Ali Abouba'的节点\nlabel为forum,属性title='Album 15 of Abdoulatifou Aly'的节点\nlabel为organisation,属性name='Al_Akhawayn_University'的节点\nlabel为organisation,属性name='Al-Ahliyya_Amman_University'的节点\nlabel为organisation,属性name='Maulana_Azad_College'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Jiaganj_Azimganj'的节点\nlabel为tag,属性name='The_Help_Album'的节点\nlabel为tag,属性name='Gangsta_Grillz:_The_Album'的节点\nlabel为tag,属性name='ABBA:_The_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 15 of Ali Achiou的创建日期、id和标题",
        "output": "match (n1:forum)  where n1.title='Album 15 of Ali Achiou' return n1.creationdate, n1.id, n1.title"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 17 of Ali Achiou'的节点\nlabel为forum,属性title='Album 17 of Abdoulatifou Aly'的节点\nlabel为forum,属性title='Album 17 of Ali Abouba'的节点\nlabel为organisation,属性name='Al-Ahliyya_Amman_University'的节点\nlabel为organisation,属性name='Maulana_Azad_College'的节点\nlabel为organisation,属性name='Al_Akhawayn_University'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Jiaganj_Azimganj'的节点\nlabel为place,属性name='Banda_Aceh'的节点\nlabel为tag,属性name='The_Help_Album'的节点\nlabel为tag,属性name='Listennn..._the_Album'的节点\nlabel为tag,属性name='The_Yes_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 17 of Ali Achiou的id和标题",
        "output": "match (n1:forum)  where n1.title='Album 17 of Ali Achiou' return n1.id, n1.title"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 18 of Ali Achiou'的节点\nlabel为forum,属性title='Album 18 of Abdoulatifou Aly'的节点\nlabel为forum,属性title='Album 18 of Arbaaz Ali'的节点\nlabel为organisation,属性name='Baku_Academy_of_Music'的节点\nlabel为organisation,属性name='Yale_School_of_Music'的节点\nlabel为organisation,属性name='Aerolloyd_Iguassu'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Long_Play_Album'的节点\nlabel为tag,属性name='Music_for_18_Musicians'的节点\nlabel为tag,属性name='The_Barbra_Streisand_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 18 of Ali Achiou的标题",
        "output": "match (n1:forum)  where n1.title='Album 18 of Ali Achiou' return n1.title"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Album 21 of Ali Achiou'的节点\nlabel为forum,属性title='Album 20 of Ali Achiou'的节点\nlabel为forum,属性title='Album 24 of Ali Achiou'的节点\nlabel为organisation,属性name='Al-Ahliyya_Amman_University'的节点\nlabel为organisation,属性name='Al_Akhawayn_University'的节点\nlabel为organisation,属性name='Baku_Academy_of_Music'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Jiaganj_Azimganj'的节点\nlabel为place,属性name='Anantapur_district'的节点\nlabel为tag,属性name='The_Help_Album'的节点\nlabel为tag,属性name='Long_Play_Album'的节点\nlabel为tag,属性name='The_Yes_Album'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Album 20 of Ali Achiou的标题和id，最多返回14条结果",
        "output": "match (n1:forum)  where n1.title='Album 20 of Ali Achiou' return n1.title, n1.id limit 14"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='MarcoPolo_Airways'的节点\nlabel为organisation,属性name='Domodedovo_Airlines'的节点\nlabel为organisation,属性name='MIP_Politecnico_di_Milano'的节点\nlabel为place,属性name='Ratmalana_Airport'的节点\nlabel为tag,属性name='Sur_un_air_latino'的节点\nlabel为tag,属性name='Milo_Goes_to_College'的节点\nlabel为tag,属性name='Paolo_Maldini'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找MarcoPolo_Airways的id、网址和名称",
        "output": "match (n1:organisation)  where n1.name='MarcoPolo_Airways' return n1.id, n1.url, n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Nikolay_Davydenko in Ahmedpur_Sial'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为forum,属性title='Group for Mohammad_Reza_Pahlavi in Salem'的节点\nlabel为organisation,属性name='Pamir_Airways'的节点\nlabel为organisation,属性name='Wimbi_Dira_Airways'的节点\nlabel为organisation,属性name='Imair_Airlines'的节点\nlabel为place,属性name='Ratmalana_Airport'的节点\nlabel为tag,属性name='Dil_Dil_Pakistan'的节点\nlabel为tag,属性name='S&M_Airlines'的节点\nlabel为tag,属性name='Adil_Shahi_dynasty'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Pamir_Airways的id、网址和名称",
        "output": "match (n1:organisation)  where n1.name='Pamir_Airways' return n1.id, n1.url, n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Azov_Avia_Airlines'的节点\nlabel为organisation,属性name='Air_Go_Airlines'的节点\nlabel为organisation,属性name='Imair_Airlines'的节点\nlabel为tag,属性name='S&M_Airlines'的节点\nlabel为tag,属性name='Sur_un_air_latino'的节点\nlabel为tag,属性name='Jefferson_Airplane_Takes_Off'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Air_Algérie的id、网址和名称，并按名称降序排列",
        "output": "match (n1:organisation)  where n1.name='Air_Algérie' return n1.id, n1.url, n1.name order by n1.name desc"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Khalifa_Airways'的节点\nlabel为organisation,属性name='Khyber_Afghan_Airlines'的节点\nlabel为organisation,属性name='Chabahar_Airlines'的节点\nlabel为place,属性name='Ratmalana_Airport'的节点\nlabel为place,属性name='Fatehgarh_Sahib'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Emirate_of_Sicily'的节点\nlabel为tag,属性name='Wiz_Khalifa'的节点\nlabel为tag,属性name='Emirate_of_Bukhara'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Khalifa_Airways的名称、网址和id，并按名称排序，返回前10个结果",
        "output": "match (n1:organisation)  where n1.name='Khalifa_Airways' return n1.name, n1.url, n1.id order by n1.name limit 10"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Tassili_Airlines'的节点\nlabel为organisation,属性name='ItAli_Airlines'的节点\nlabel为organisation,属性name='Safi_Airways'的节点\nlabel为place,属性name='Ratmalana_Airport'的节点\nlabel为place,属性name='Pathum_Thani_Province'的节点\nlabel为tag,属性name='S&M_Airlines'的节点\nlabel为tag,属性name='Emirate_of_Sicily'的节点\nlabel为tag,属性name='Adil_Shahi_dynasty'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Tassili_Airlines的id和名称，并按名称排序，返回前15个结果",
        "output": "match (n1:organisation)  where n1.name='Tassili_Airlines' return n1.id, n1.name order by n1.name limit 15"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Vytautas in Banda_Aceh'的节点\nlabel为forum,属性title='Group for Vytautas in Banda_Aceh'的节点\nlabel为forum,属性title='Group for Rafael_Nadal in Visonta'的节点\nlabel为organisation,属性name='Antinea_Airlines'的节点\nlabel为organisation,属性name='Aerolínea_de_Antioquia'的节点\nlabel为organisation,属性name='Azov_Avia_Airlines'的节点\nlabel为place,属性name='Ratmalana_Airport'的节点\nlabel为tag,属性name='South_Asian_Association_for_Regional_Cooperation'的节点\nlabel为tag,属性name='Brazilian_military_government'的节点\nlabel为tag,属性name='Part_of_the_Union'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Antinea_Airlines的组织的名称",
        "output": "match (n1:organisation)  where n1.name='Antinea_Airlines' return n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Star_Aviation'的节点\nlabel为organisation,属性name='Kal_Star_Aviation'的节点\nlabel为organisation,属性name='Astral_Aviation'的节点\nlabel为tag,属性name='Lil_Star'的节点\nlabel为tag,属性name='Star_Star'的节点\nlabel为tag,属性name='Star_People'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Star_Aviation的id",
        "output": "match (n1:organisation)  where n1.name='Star_Aviation' return n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Vytautas in Banda_Aceh'的节点\nlabel为forum,属性title='Group for Vytautas in Banda_Aceh'的节点\nlabel为forum,属性title='Group for Osama_bin_Laden in Toliara'的节点\nlabel为organisation,属性name='TAAG_Angola_Airlines'的节点\nlabel为organisation,属性name='Angola_Air_Charter'的节点\nlabel为organisation,属性name='Azov_Avia_Airlines'的节点\nlabel为place,属性name='Ratmalana_Airport'的节点\nlabel为tag,属性name='Emirate_of_Granada'的节点\nlabel为tag,属性name='Arantxa_Parra_Santonja'的节点\nlabel为tag,属性name='S&M_Airlines'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找TAAG Angola Airlines的名称、网址和id，最多返回2个结果",
        "output": "match (n1:organisation)  where n1.name='TAAG_Angola_Airlines' return n1.name, n1.url, n1.id limit 2"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Direct_Aero_Services'的节点\nlabel为organisation,属性name='Aero_Tropical'的节点\nlabel为organisation,属性name='Aeropelican_Air_Services'的节点\nlabel为tag,属性name='This_Strange_Engine'的节点\nlabel为tag,属性name='Apollo:_Atmospheres_and_Soundtracks'的节点\nlabel为tag,属性name='Okeh_Presents_the_Wayfaring_Stranger'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Aero_Tropical的id、名称和网址",
        "output": "match (n1:organisation)  where n1.name='Aero_Tropical' return n1.id, n1.name, n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Vytautas in Banda_Aceh'的节点\nlabel为forum,属性title='Group for Vytautas in Banda_Aceh'的节点\nlabel为forum,属性title='Group for Alicia_Keys in Jalpaiguri'的节点\nlabel为organisation,属性name='Alzahra_University'的节点\nlabel为organisation,属性name='Adama_University'的节点\nlabel为organisation,属性name='Bidhan_Chandra_College,_Asansol'的节点\nlabel为place,属性name='Anantapur_district'的节点\nlabel为place,属性name='Addis_Ababa'的节点\nlabel为place,属性name='Akita_City'的节点\nlabel为tag,属性name='My_Kinda_Party'的节点\nlabel为tag,属性name='In_da_Club'的节点\nlabel为tag,属性name='In-A-Gadda-Da-Vida'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Alada的组织的id、名称和网址，最多返回18条记录",
        "output": "match (n1:organisation)  where n1.name='Alada' return n1.id, n1.name, n1.url limit 18"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Air_Go_Airlines'的节点\nlabel为organisation,属性name='Wings_Abadi_Air'的节点\nlabel为organisation,属性name='VIM_Airlines'的节点\nlabel为tag,属性name='Bennie_and_the_Jets'的节点\nlabel为tag,属性name='Get_Your_Wings'的节点\nlabel为tag,属性name='If_U_Seek_Amy'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Air_Gemini的id、网址和名称，并按名称排序",
        "output": "match (n1:organisation)  where n1.name='Air_Gemini' return n1.id, n1.url, n1.name order by n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Aeronáutica_(Angola)'的节点\nlabel为organisation,属性name='Línea_Turística_Aereotuy'的节点\nlabel为organisation,属性name='Aerolínea_de_Antioquia'的节点\nlabel为tag,属性name='Arantxa_Parra_Santonja'的节点\nlabel为tag,属性name='Almas_del_Silencio'的节点\nlabel为tag,属性name='Apollo:_Atmospheres_and_Soundtracks'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Aeronáutica_(Angola)的网址和id",
        "output": "match (n1:organisation)  where n1.name='Aeronáutica_(Angola)' return n1.url, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Spike_Lee in Debre_Marqos'的节点\nlabel为organisation,属性name='Diexim_Expresso'的节点\nlabel为organisation,属性name='Diponegoro_University'的节点\nlabel为organisation,属性name='Instituto_Superior_Santo_Domingo'的节点\nlabel为tag,属性name='Empezar_Desde_Cero'的节点\nlabel为tag,属性name='Iparhi_Agapi_Edo'的节点\nlabel为tag,属性name='Doremi_Fasol_Latido'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Diexim_Expresso的id、网址和名称",
        "output": "match (n1:organisation)  where n1.name='Diexim_Expresso' return n1.id, n1.url, n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='748_Air_Services'的节点\nlabel为organisation,属性name='Severstal_Air_Company'的节点\nlabel为organisation,属性name='Shaheen_Air'的节点\nlabel为place,属性name='Borey_Seang_Nam'的节点\nlabel为tag,属性name='Get_Your_Wings'的节点\nlabel为tag,属性name='Sonic_Nurse'的节点\nlabel为tag,属性name='Call_Off_the_Search'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找SonAir的名称、网址和id，限制返回16条结果",
        "output": "match (n1:organisation)  where n1.name='SonAir' return n1.name, n1.url, n1.id limit 16"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Luiz_Inácio_Lula_da_Silva in Rio_de_Janeiro'的节点\nlabel为organisation,属性name='Aerolíneas_Argentinas'的节点\nlabel为organisation,属性name='Líneas_Aéreas_Privadas_Argentinas'的节点\nlabel为organisation,属性name='Aerolínea_de_Antioquia'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为place,属性name='Ratmalana_Airport'的节点\nlabel为place,属性name='Argentina'的节点\nlabel为tag,属性name='Almas_del_Silencio'的节点\nlabel为tag,属性name='Arantxa_Parra_Santonja'的节点\nlabel为tag,属性name='Arantxa_Sánchez_Vicario'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Aerolíneas Argentinas的id、网址和名称",
        "output": "match (n1:organisation)  where n1.name='Aerolíneas_Argentinas' return n1.id, n1.url, n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Lindsay_Davenport in Ahmedpur_Sial'的节点\nlabel为organisation,属性name='Líneas_Aéreas_Azteca'的节点\nlabel为organisation,属性name='Austral_Líneas_Aéreas'的节点\nlabel为organisation,属性name='Nordeste_Linhas_Aéreas_Regionais'的节点\nlabel为place,属性name='Ratmalana_Airport'的节点\nlabel为tag,属性name='Australian_Antarctic_Territory'的节点\nlabel为tag,属性name='On_Avery_Island'的节点\nlabel为tag,属性name='French_Equatorial_Africa'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Austral Líneas Aéreas的网址、名称和id，最多返回20条结果",
        "output": "match (n1:organisation)  where n1.name='Austral_Líneas_Aéreas' return n1.url, n1.name, n1.id limit 20"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Miguel_de_Cervantes in Rio_de_Janeiro'的节点\nlabel为forum,属性title='Group for Luiz_Inácio_Lula_da_Silva in Rio_de_Janeiro'的节点\nlabel为forum,属性title='Album 14 of Guillermo Irigoyen'的节点\nlabel为organisation,属性name='Aero_VIP_(Argentina)'的节点\nlabel为organisation,属性name='Aero_VIP_(Portugal)'的节点\nlabel为organisation,属性name='Aerolíneas_Argentinas'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为place,属性name='San_Pedro_Garza_García'的节点\nlabel为place,属性name='Ratmalana_Airport'的节点\nlabel为tag,属性name='Iparhi_Agapi_Edo'的节点\nlabel为tag,属性name='Sur_un_air_latino'的节点\nlabel为tag,属性name='Spanish_East_Indies'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Aero_VIP_(Argentina)的网址和id，最多返回14条结果",
        "output": "match (n1:organisation)  where n1.name='Aero_VIP_(Argentina)' return n1.url, n1.id limit 14"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='CATA_Línea_Aérea'的节点\nlabel为organisation,属性name='LAI_–_Línea_Aérea_IAACA'的节点\nlabel为organisation,属性name='Ándalus_Líneas_Aéreas'的节点\nlabel为place,属性name='Ratmalana_Airport'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为tag,属性name='In_Search_of_Sunrise_3:_Panama'的节点\nlabel为tag,属性name='In_Search_of_Sunrise_4:_Latin_America'的节点\nlabel为tag,属性name='La_Isla_Bonita'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找CATA_Línea_Aérea的id和网址，最多返回4条结果",
        "output": "match (n1:organisation)  where n1.name='CATA_Línea_Aérea' return n1.id, n1.url limit 4"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Daeduk_College'的节点\nlabel为organisation,属性name='Deree_College'的节点\nlabel为organisation,属性name='Deeside_College'的节点\nlabel为tag,属性name='Alan_Ladd'的节点\nlabel为tag,属性name='Yellow_Ledbetter'的节点\nlabel为tag,属性name='Leander_Paes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找LADE的网址和名称",
        "output": "match (n1:organisation)  where n1.name='LADE' return n1.url, n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为organisation,属性name='Ándalus_Líneas_Aéreas'的节点\nlabel为organisation,属性name='Líneas_Aéreas_Federales'的节点\nlabel为organisation,属性name='Andes_Líneas_Aéreas'的节点\nlabel为place,属性name='Ratmalana_Airport'的节点\nlabel为tag,属性name='Al_otro_lado_del_río'的节点\nlabel为tag,属性name='Las_Palabras_de_Amor'的节点\nlabel为tag,属性name='Younes_El_Aynaoui'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Líneas Aéreas Federales的名称和网址",
        "output": "match (n1:organisation)  where n1.name='Líneas_Aéreas_Federales' return n1.name, n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为organisation,属性name='LAN_Argentina'的节点\nlabel为organisation,属性name='Líneas_Aéreas_Privadas_Argentinas'的节点\nlabel为organisation,属性name='Ándalus_Líneas_Aéreas'的节点\nlabel为place,属性name='Larkana_District'的节点\nlabel为place,属性name='Antón_Lizardo'的节点\nlabel为place,属性name='San_Pedro_Garza_García'的节点\nlabel为tag,属性name='Arantxa_Parra_Santonja'的节点\nlabel为tag,属性name='Almas_del_Silencio'的节点\nlabel为tag,属性name='Antonio_López_de_Santa_Anna'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找LAN_Argentina的id、网址和名称",
        "output": "match (n1:organisation)  where n1.name='LAN_Argentina' return n1.id, n1.url, n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Luiz_Inácio_Lula_da_Silva in Rio_de_Janeiro'的节点\nlabel为organisation,属性name='Sol_Líneas_Aéreas'的节点\nlabel为organisation,属性name='Sol_Linhas_Aéreas'的节点\nlabel为organisation,属性name='Andes_Líneas_Aéreas'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为tag,属性name='Almas_del_Silencio'的节点\nlabel为tag,属性name='In_Search_of_Sunrise_5:_Los_Angeles'的节点\nlabel为tag,属性name='Al_otro_lado_del_río'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Sol_Líneas_Aéreas的名称、网址和id",
        "output": "match (n1:organisation)  where n1.name='Sol_Líneas_Aéreas' return n1.name, n1.url, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为organisation,属性name='Ándalus_Líneas_Aéreas'的节点\nlabel为organisation,属性name='Andes_Líneas_Aéreas'的节点\nlabel为organisation,属性name='Dinar_Líneas_Aéreas'的节点\nlabel为place,属性name='Los_Angeles'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为place,属性name='Campos_dos_Goytacazes'的节点\nlabel为tag,属性name='Enrique_Iglesias'的节点\nlabel为tag,属性name='Younes_El_Aynaoui'的节点\nlabel为tag,属性name='In_Search_of_Sunrise_5:_Los_Angeles'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Andes_Líneas_Aéreas的网址",
        "output": "match (n1:organisation)  where n1.name='Andes_Líneas_Aéreas' return n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Silver_Sky_Airlines'的节点\nlabel为organisation,属性name='Russian_Sky_Airlines'的节点\nlabel为organisation,属性name='Skymaster_Airlines'的节点\nlabel为tag,属性name='S&M_Airlines'的节点\nlabel为tag,属性name='Nashville_Skyline'的节点\nlabel为tag,属性name='Welcome_to_Sky_Valley'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n按名称排序后，返回Silver_Sky_Airlines的名称",
        "output": "match (n1:organisation)  where n1.name='Silver_Sky_Airlines' return n1.name order by n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为forum,属性title='Group for Benicio_del_Toro in Larissa'的节点\nlabel为organisation,属性name='Dinar_Líneas_Aéreas'的节点\nlabel为organisation,属性name='Ándalus_Líneas_Aéreas'的节点\nlabel为organisation,属性name='Andes_Líneas_Aéreas'的节点\nlabel为place,属性name='Pinar_del_Río'的节点\nlabel为tag,属性name='Al_otro_lado_del_río'的节点\nlabel为tag,属性name='Almas_del_Silencio'的节点\nlabel为tag,属性name='Lourdes_Domínguez_Lino'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Dinar_Líneas_Aéreas的名称、网址和id",
        "output": "match (n1:organisation)  where n1.name='Dinar_Líneas_Aéreas' return n1.name, n1.url, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Aerolínea_de_Antioquia'的节点\nlabel为organisation,属性name='Instituto_Tecnológico_de_Oaxaca'的节点\nlabel为organisation,属性name='WebJet_Linhas_Aéreas'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为tag,属性name='Iparhi_Agapi_Edo'的节点\nlabel为tag,属性name='Antonio_da_Correggio'的节点\nlabel为tag,属性name='Busca_una_mujer'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Aerochaco的名称、网址和id",
        "output": "match (n1:organisation)  where n1.name='Aerochaco' return n1.name, n1.url, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Skywest_Airlines'的节点\nlabel为organisation,属性name='Silver_Sky_Airlines'的节点\nlabel为organisation,属性name='Aerosvit_Airlines'的节点\nlabel为tag,属性name='S&M_Airlines'的节点\nlabel为tag,属性name='Wings_over_America'的节点\nlabel为tag,属性name='In_the_Air_Tonight'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Skywest Airlines的名称和id，最多返回9条记录",
        "output": "match (n1:organisation)  where n1.name='Skywest_Airlines' return n1.name, n1.id limit 9"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Virgin_Blue'的节点\nlabel为organisation,属性name='Volareweb.com'的节点\nlabel为organisation,属性name='Silverfly_(airline)'的节点\nlabel为tag,属性name='Mule_Skinner_Blues'的节点\nlabel为tag,属性name='How_Blue_Can_You_Get'的节点\nlabel为tag,属性name='Blue_Is_the_Colour'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Virgin Blue的网址",
        "output": "match (n1:organisation)  where n1.name='Virgin_Blue' return n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Kendell_Airlines'的节点\nlabel为organisation,属性name='Golden_International_Airlines'的节点\nlabel为organisation,属性name='Corendon_Airlines'的节点\nlabel为tag,属性name='S&M_Airlines'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Kendell_Airlines的id、网址和名称，并按名称排序返回这些信息",
        "output": "match (n1:organisation)  where n1.name='Kendell_Airlines' return n1.id, n1.url, n1.name order by n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Interlink_Airlines'的节点\nlabel为organisation,属性name='Air_Go_Airlines'的节点\nlabel为organisation,属性name='ARP_410_Airlines'的节点\nlabel为place,属性name='Ratmalana_Airport'的节点\nlabel为tag,属性name='S&M_Airlines'的节点\nlabel为tag,属性name='Wings_over_America'的节点\nlabel为tag,属性name='Something_About_Airplanes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Impulse_Airlines的名称、id和网址，最多返回9条记录",
        "output": "match (n1:organisation)  where n1.name='Impulse_Airlines' return n1.name, n1.id, n1.url limit 9"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Sunshine_Express_Airlines'的节点\nlabel为organisation,属性name='Express.Net_Airlines'的节点\nlabel为organisation,属性name='Interlink_Airlines'的节点\nlabel为tag,属性name='S&M_Airlines'的节点\nlabel为tag,属性name='All_for_the_Love_of_Sunshine'的节点\nlabel为tag,属性name='Steal_My_Sunshine'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Sunshine Express Airlines的id",
        "output": "match (n1:organisation)  where n1.name='Sunshine_Express_Airlines' return n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Norfolk_Jet_Express'的节点\nlabel为organisation,属性name='Regional_Express_Airlines'的节点\nlabel为organisation,属性name='Link_Air_Express'的节点\nlabel为tag,属性name='Idlewild_South'的节点\nlabel为tag,属性name='Union_between_Sweden_and_Norway'的节点\nlabel为tag,属性name='Give_My_Regards_to_Broad_Street'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Norfolk_Jet_Express的id、网址和名称",
        "output": "match (n1:organisation)  where n1.name='Norfolk_Jet_Express' return n1.id, n1.url, n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Air_Go_Airlines'的节点\nlabel为organisation,属性name='Alliance_Airlines'的节点\nlabel为organisation,属性name='Interlink_Airlines'的节点\nlabel为place,属性name='Ratmalana_Airport'的节点\nlabel为tag,属性name='S&M_Airlines'的节点\nlabel为tag,属性name='Wings_over_America'的节点\nlabel为tag,属性name='Wings_Greatest'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Alliance_Airlines的网址和名称，并按名称排序",
        "output": "match (n1:organisation)  where n1.name='Alliance_Airlines' return n1.url, n1.name order by n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Aero-Tropics_Air_Services'的节点\nlabel为organisation,属性name='748_Air_Services'的节点\nlabel为organisation,属性name='Aeropelican_Air_Services'的节点\nlabel为place,属性name='Ratmalana_Airport'的节点\nlabel为tag,属性name='S&M_Airlines'的节点\nlabel为tag,属性name='Hotel_Room_Service'的节点\nlabel为tag,属性name='Something_About_Airplanes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Aero-Tropics_Air_Services的名称和网址",
        "output": "match (n1:organisation)  where n1.name='Aero-Tropics_Air_Services' return n1.name, n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Emu_Airways'的节点\nlabel为organisation,属性name='Eznis_Airways'的节点\nlabel为organisation,属性name='Elrom_Airways'的节点\nlabel为place,属性name='Ratmalana_Airport'的节点\nlabel为tag,属性name='S&M_Airlines'的节点\nlabel为tag,属性name='Emirate_of_Sicily'的节点\nlabel为tag,属性name='If_U_Seek_Amy'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Emu_Airways的id",
        "output": "match (n1:organisation)  where n1.name='Emu_Airways' return n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Cobham_Aviation_Services_Australia'的节点\nlabel为organisation,属性name='Australian_air_Express'的节点\nlabel为organisation,属性name='East-West_Airlines_(Australia)'的节点\nlabel为place,属性name='Ratmalana_Airport'的节点\nlabel为tag,属性name='S&M_Airlines'的节点\nlabel为tag,属性name='Straight_Outta_Cashville'的节点\nlabel为tag,属性name='Governor-General_of_Australia'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Cobham Aviation Services Australia的名称，最多返回13个结果",
        "output": "match (n1:organisation)  where n1.name='Cobham_Aviation_Services_Australia' return n1.name limit 13"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Airlines_of_Tasmania'的节点\nlabel为organisation,属性name='TAM_Airlines'的节点\nlabel为organisation,属性name='Tasman_Cargo_Airlines'的节点\nlabel为place,属性name='Ratmalana_Airport'的节点\nlabel为tag,属性name='S&M_Airlines'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Airlines of Tasmania的网址、名称和id",
        "output": "match (n1:organisation)  where n1.name='Airlines_of_Tasmania' return n1.url, n1.name, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Genghis_Khan in Asadabad'的节点\nlabel为forum,属性title='Group for Genghis_Khan in Asadabad'的节点\nlabel为forum,属性title='Group for Genghis_Khan in Asadabad'的节点\nlabel为organisation,属性name='Tasman_Cargo_Airlines'的节点\nlabel为organisation,属性name='Airlines_of_Tasmania'的节点\nlabel为organisation,属性name='Trigana_Air_Service'的节点\nlabel为place,属性name='Ratmalana_Airport'的节点\nlabel为tag,属性name='S&M_Airlines'的节点\nlabel为tag,属性name='LaDainian_Tomlinson'的节点\nlabel为tag,属性name='Sivaji_Ganesan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Tasman Cargo Airlines的id",
        "output": "match (n1:organisation)  where n1.name='Tasman_Cargo_Airlines' return n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Australian_air_Express'的节点\nlabel为organisation,属性name='Express.Net_Airlines'的节点\nlabel为organisation,属性name='Trans_Australia_Airlines'的节点\nlabel为tag,属性name='S&M_Airlines'的节点\nlabel为tag,属性name='Anne_of_Austria'的节点\nlabel为tag,属性name='Wings_over_America'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Australian air Express的网址和名称",
        "output": "match (n1:organisation)  where n1.name='Australian_air_Express' return n1.url, n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Tyrolean_Jet_Services'的节点\nlabel为organisation,属性name='WebJet_Linhas_Aéreas'的节点\nlabel为organisation,属性name='Toll_Aviation'的节点\nlabel为tag,属性name='All_of_Our_Names'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Toll_Aviation的名称和网址，并按名称排序返回",
        "output": "match (n1:organisation)  where n1.name='Toll_Aviation' return n1.name, n1.url order by n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Skytrans_Airlines'的节点\nlabel为organisation,属性name='Air_Go_Airlines'的节点\nlabel为organisation,属性name='Transaero_Airlines'的节点\nlabel为place,属性name='Ratmalana_Airport'的节点\nlabel为tag,属性name='S&M_Airlines'的节点\nlabel为tag,属性name='In_the_Air_Tonight'的节点\nlabel为tag,属性name='Something_About_Airplanes'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Skytrans_Airlines的名称，最多返回20个结果",
        "output": "match (n1:organisation)  where n1.name='Skytrans_Airlines' return n1.name limit 20"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='East-West_Airlines_(Australia)'的节点\nlabel为organisation,属性name='Eastern_Australia_Airlines'的节点\nlabel为organisation,属性name='Flight_West_Airlines'的节点\nlabel为tag,属性name='Idlewild_South'的节点\nlabel为tag,属性name='Dutch_East_Indies'的节点\nlabel为tag,属性name='S&M_Airlines'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找East-West_Airlines_(Australia)的id和网址",
        "output": "match (n1:organisation)  where n1.name='East-West_Airlines_(Australia)' return n1.id, n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Regional_Express_Airlines'的节点\nlabel为organisation,属性name='Express.Net_Airlines'的节点\nlabel为organisation,属性name='Republic_Express_Airlines'的节点\nlabel为tag,属性name='S&M_Airlines'的节点\nlabel为tag,属性name='Wings_over_America'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Regional Express Airlines的网址、id和名称，并按名称排序返回这些信息",
        "output": "match (n1:organisation)  where n1.name='Regional_Express_Airlines' return n1.url, n1.id, n1.name order by n1.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Skywest_Airlines'的节点\nlabel为organisation,属性name='Flight_West_Airlines'的节点\nlabel为organisation,属性name='Express.Net_Airlines'的节点\nlabel为tag,属性name='S&M_Airlines'的节点\nlabel为tag,属性name='Wings_over_America'的节点\nlabel为tag,属性name='Wind_Beneath_My_Wings'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Flight West Airlines的网址",
        "output": "match (n1:organisation)  where n1.name='Flight_West_Airlines' return n1.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for John_McCain in Zhukovsky'的节点\nlabel为forum,属性title='Group for John_Lennon in Chaozhou'的节点\nlabel为forum,属性title='Group for John_Adams in New_Haven'的节点\nlabel为organisation,属性name='Jain_Institute_of_Technology'的节点\nlabel为organisation,属性name='Jan_Van_Eyck_Academie'的节点\nlabel为organisation,属性name='John_Jay_College_of_Criminal_Justice'的节点\nlabel为tag,属性name='Jennifer_Jason_Leigh'的节点\nlabel为tag,属性name='Janet_Jackson'的节点\nlabel为tag,属性name='Jermaine_Jackson'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名字为Jan的人的电子邮件地址",
        "output": "match (n1:person)  where n1.firstname='Jan' return n1.email"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Friedrich_Nietzsche in Poznań'的节点\nlabel为forum,属性title='Group for William_Shakespeare in Vitebsk'的节点\nlabel为organisation,属性name='Cardinal_Stefan_Wyszyński_University_in_Warsaw'的节点\nlabel为organisation,属性name='Wrocław_University_of_Technology'的节点\nlabel为organisation,属性name='Adam_Mickiewicz_University_in_Poznań'的节点\nlabel为tag,属性name='Daniel_Vacek'的节点\nlabel为tag,属性name='Władysław_IV_Vasa'的节点\nlabel为tag,属性name='Andrzej_Wajda'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名字为Wojciech的人的姓氏、名字、性别、创建日期、使用的浏览器、生日、邮箱、id、位置IP和语言，限制返回17条记录",
        "output": "match (n1:person)  where n1.firstname='Wojciech' return n1.lastname, n1.firstname, n1.gender, n1.creationdate, n1.browserused, n1.birthday, n1.email, n1.id, n1.locationip, n1.language limit 17"
    }
]