[
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Wall of Wojciech Ciesla'的节点\nlabel为forum,属性title='Group for Rafael_Nadal in Visonta'的节点\nlabel为organisation,属性name='Cardinal_Stefan_Wyszyński_University_in_Warsaw'的节点\nlabel为organisation,属性name='Universitas_Kristen_Krida_Wacana'的节点\nlabel为organisation,属性name='Webster_University_Vienna'的节点\nlabel为tag,属性name='Wallis_and_Futuna'的节点\nlabel为tag,属性name='Stanislas_Wawrinka'的节点\nlabel为tag,属性name='Władysław_IV_Vasa'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Wall of Wojciech Ciesla与Shania_Twain标签之间的关系创建日期，以及Wall of Wojciech Ciesla的id和标题",
        "output": "match (n1:forum)-[r1:hastagforum]->(n2:tag)  where n1.title='Wall of Wojciech Ciesla' and n2.name='Shania_Twain' return r1.creationdate, n1.id, n1.title"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Kazan_Federal_University'的节点\nlabel为organisation,属性name='Gheorghe_Zane_University'的节点\nlabel为organisation,属性name='Fisk_University'的节点\nlabel为tag,属性name='Franz_Kafka'的节点\nlabel为tag,属性name='Zakk_Wylde'的节点\nlabel为tag,属性name='Richard_Widmark'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Franz_Kafka的标签的id",
        "output": "match (n1:forum)-[r1:hastagforum]->(n2:tag)  where n2.name='Franz_Kafka' return n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Wall of Wojciech Ciesla'的节点\nlabel为forum,属性title='Wall of Witold Ciesla'的节点\nlabel为forum,属性title='Wall of Wojciech Kowalski'的节点\nlabel为organisation,属性name='Cardinal_Stefan_Wyszyński_University_in_Warsaw'的节点\nlabel为organisation,属性name='Vesalius_College'的节点\nlabel为organisation,属性name='Valahia_University_of_Târgovişte'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为tag,属性name='Władysław_IV_Vasa'的节点\nlabel为tag,属性name='Lech_Wałęsa'的节点\nlabel为tag,属性name='John_II_Casimir_Vasa'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Wall of Wojciech Ciesla的创建日期",
        "output": "match (n1:forum)-[r1:hastagforum]->(n2:tag)  where n1.title='Wall of Wojciech Ciesla' return n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Wall of Wojciech Ciesla'的节点\nlabel为organisation,属性name='Cardinal_Stefan_Wyszyński_University_in_Warsaw'的节点\nlabel为organisation,属性name='Wrocław_University_of_Technology'的节点\nlabel为organisation,属性name='Webster_University_Geneva'的节点\nlabel为tag,属性name='Władysław_IV_Vasa'的节点\nlabel为tag,属性name='Lutka_sa_naslovne_strane'的节点\nlabel为tag,属性name='Western_Wall:_The_Tucson_Sessions'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Wall of Wojciech Ciesla的具有的标签信息的url、论坛的标题和id、关系的创建日期、标签的名称和id、论坛的创建日期，并按标签名称降序排列，限制返回14条结果",
        "output": "match (n1:forum)-[r1:hastagforum]->(n2:tag)  where n1.title='Wall of Wojciech Ciesla' return n2.url, n1.title, n1.id, r1.creationdate, n2.name, n2.id, n1.creationdate order by n2.name desc limit 14"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Wall of Wojciech Ciesla'的节点\nlabel为forum,属性title='Group for Jawaharlal_Nehru in Rahim_Yar_Khan'的节点\nlabel为forum,属性title='Wall of Nedeljko Bajić Mikulic'的节点\nlabel为organisation,属性name='Jawaharlal_Nehru_University'的节点\nlabel为organisation,属性name='Jawaharlal_Nehru_Agricultural_University'的节点\nlabel为organisation,属性name='Jawaharlal_Nehru_Medical_College,_Belgaum'的节点\nlabel为place,属性name='Vallabh_Vidhyanagar'的节点\nlabel为tag,属性name='Jawaharlal_Nehru'的节点\nlabel为tag,属性name='Naser_al-Din_Shah_Qajar'的节点\nlabel为tag,属性name='Lech_Wałęsa'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Wall of Wojciech Ciesla具有Jawaharlal_Nehru标签的论坛标题和标签的URL",
        "output": "match (n1:forum)-[r1:hastagforum]->(n2:tag)  where n1.title='Wall of Wojciech Ciesla' and n2.name='Jawaharlal_Nehru' return n1.title, n2.url"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Wall of Wojciech Ciesla'的节点\nlabel为forum,属性title='Wall of Gyula Kovacs'的节点\nlabel为forum,属性title='Group for Robert_Louis_Stevenson in Poznań'的节点\nlabel为organisation,属性name='San_Carlos_Seminary'的节点\nlabel为organisation,属性name='Cardinal_Stefan_Wyszyński_University_in_Warsaw'的节点\nlabel为organisation,属性name='Catholic_University_of_Colombia'的节点\nlabel为tag,属性name='Western_Wall:_The_Tucson_Sessions'的节点\nlabel为tag,属性name='Chicago_at_Carnegie_Hall'的节点\nlabel为tag,属性name='On_My_Way_to_Church'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Wall of Wojciech Ciesla中包含Christopher Columbus标签的论坛信息，返回标签的id、论坛的标题和id、标签的URL以及论坛的创建日期，限制返回7条结果。",
        "output": "match (n1:forum)-[r1:hastagforum]->(n2:tag)  where n2.name='Christopher_Columbus' and n1.title='Wall of Wojciech Ciesla' return n2.id, n1.title, n1.id, n2.url, n1.creationdate limit 7"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Joseph_Haydn in Solapur'的节点\nlabel为organisation,属性name='Jagran_Institute_of_Communication_and_Management'的节点\nlabel为organisation,属性name='Al-Zaytoonah_University_of_Jordan'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为tag,属性name='Hussein_of_Jordan'的节点\nlabel为tag,属性name='Joss_Whedon'的节点\nlabel为tag,属性name='Michael_Jordan'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与Hussein_of_Jordan标签关联的论坛的id、标题、创建日期，以及该标签的id和URL，同时返回关联关系的创建日期",
        "output": "match (n1:forum)-[r1:hastagforum]->(n2:tag)  where n2.name='Hussein_of_Jordan' return r1.creationdate, n1.title, n1.id, n2.id, n2.url, n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Wall of Wojciech Ciesla'的节点\nlabel为forum,属性title='Wall of Cesar Magalona'的节点\nlabel为forum,属性title='Group for Niccolò_Machiavelli in Toliara'的节点\nlabel为organisation,属性name='Rafael_Belloso_Chacin_University'的节点\nlabel为organisation,属性name='Coleg_Llandrillo_Cymru'的节点\nlabel为organisation,属性name='Arturo_Michelena_University'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为place,属性name='San_Pedro_Garza_García'的节点\nlabel为place,属性name='Feira_de_Santana'的节点\nlabel为tag,属性name='Mario_Vargas_Llosa'的节点\nlabel为tag,属性name='Gloria_Macapagal-Arroyo'的节点\nlabel为tag,属性name='Anabel_Medina_Garrigues'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Wall of Wojciech Ciesla中包含Gloria Macapagal-Arroyo标签的关系的创建日期，以及该标签的id、名称和论坛的创建日期，并按标签名称排序",
        "output": "match (n1:forum)-[r1:hastagforum]->(n2:tag)  where n2.name='Gloria_Macapagal-Arroyo' and n1.title='Wall of Wojciech Ciesla' return r1.creationdate, n2.id, n1.creationdate, n2.name order by n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Wall of Wojciech Ciesla'的节点\nlabel为forum,属性title='Wall of Jan Zakrzewski'的节点\nlabel为forum,属性title='Wall of Wojciech Kowalski'的节点\nlabel为organisation,属性name='Cardinal_Stefan_Wyszyński_University_in_Warsaw'的节点\nlabel为organisation,属性name='Walter_Lemke_Department_of_Journalism'的节点\nlabel为organisation,属性name='Jan_Matejko_Academy_of_Fine_Arts'的节点\nlabel为tag,属性name='Western_Wall:_The_Tucson_Sessions'的节点\nlabel为tag,属性name='John_the_Revelator_Lilian'的节点\nlabel为tag,属性name='Jo-Wilfried_Tsonga'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Wall of Wojciech Ciesla中与J.R.R.Tolkien相关的论坛的标题、id以及该标签的名称、URL和id，最多返回13条结果",
        "output": "match (n1:forum)-[r1:hastagforum]->(n2:tag)  where n1.title='Wall of Wojciech Ciesla' and n2.name='J._R._R._Tolkien' return n1.title, n1.id, n2.name, n2.url, n2.id limit 13"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Universidad_del_Salvador'的节点\nlabel为organisation,属性name='Instituto_Tecnológico_de_Saltillo'的节点\nlabel为organisation,属性name='Instituto_Superior_Santo_Domingo'的节点\nlabel为place,属性name='Feira_de_Santana'的节点\nlabel为tag,属性name='Salvador_Dalí'的节点\nlabel为tag,属性name='Dario_Argento'的节点\nlabel为tag,属性name='Doremi_Fasol_Latido'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与Salvador_Dalí标签关联的论坛的url、论坛id、关联关系的创建日期、论坛标题、论坛创建日期以及标签id",
        "output": "match (n1:forum)-[r1:hastagforum]->(n2:tag)  where n2.name='Salvador_Dalí' return n2.url, n1.id, r1.creationdate, n1.title, n1.creationdate, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Wall of Wojciech Ciesla'的节点\nlabel为forum,属性title='Group for William_Shakespeare in Vitebsk'的节点\nlabel为forum,属性title='Group for Henry_VI_of_England in Vitebsk'的节点\nlabel为organisation,属性name='Cardinal_Stefan_Wyszyński_University_in_Warsaw'的节点\nlabel为organisation,属性name='Elizabeth_Female_Academy'的节点\nlabel为organisation,属性name='Harold_and_Sylvia_Greenberg_Theatre'的节点\nlabel为tag,属性name='Władysław_IV_Vasa'的节点\nlabel为tag,属性name='Albrecht_von_Wallenstein'的节点\nlabel为tag,属性name='Sylvia_Plath'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Wall of Wojciech Ciesla中与Elizabeth_II相关的标签的名称，关系的创建日期以及论坛的创建日期，限制返回15条结果",
        "output": "match (n1:forum)-[r1:hastagforum]->(n2:tag)  where n2.name='Elizabeth_II' and n1.title='Wall of Wojciech Ciesla' return n2.name, r1.creationdate, n1.creationdate limit 15"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='SNDT_Women's_University'的节点\nlabel为organisation,属性name='SNDT_Women's_University'的节点\nlabel为organisation,属性name='Fatima_Jinnah_Women_University'的节点\nlabel为tag,属性name='Source_Tags_&_Codes'的节点\nlabel为tag,属性name='Price_Tag'的节点\nlabel为tag,属性name='My_Back_Pages'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找与Queen Victoria相关的论坛标签的id、URL、关系创建日期、标签名称和论坛标题，并按标签名称降序排列",
        "output": "match (n1:forum)-[r1:hastagforum]->(n2:tag)  where n2.name='Queen_Victoria' return n2.id, n2.url, r1.creationdate, n2.name, n1.title order by n2.name desc"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Wall of Wojciech Ciesla'的节点\nlabel为forum,属性title='Wall of Witold Ciesla'的节点\nlabel为organisation,属性name='Cardinal_Stefan_Wyszyński_University_in_Warsaw'的节点\nlabel为organisation,属性name='John_Wesley_College'的节点\nlabel为organisation,属性name='John_Wheatley_College'的节点\nlabel为tag,属性name='Wallis_and_Futuna'的节点\nlabel为tag,属性name='Władysław_IV_Vasa'的节点\nlabel为tag,属性name='Walls_and_Bridges'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Wall of Wojciech Ciesla与Charles I of England标签之间的关系，返回关系的创建日期，标签的id，论坛的id、创建日期和标题，以及标签的URL和名称。",
        "output": "match (n1:forum)-[r1:hastagforum]->(n2:tag)  where n1.title='Wall of Wojciech Ciesla' and n2.name='Charles_I_of_England' return r1.creationdate, n2.id, n1.id, n1.creationdate, n1.title, n2.url, n2.name"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Hannan_University'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Hossein创建的帖子的语言、位置IP以及创建者的语言、姓氏、ID和创建日期",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Hossein' return n2.language, n2.lastname, n2.id, n2.creationdate, n1.language, n1.locationip"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Hannan_University'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Hansung_University'的节点\nlabel为tag,属性name='Wingspan:_Hits_and_History'的节点\nlabel为tag,属性name='Hans_Holbein_the_Younger'的节点\nlabel为tag,属性name='Hans_Werner_Henze'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Hossein创建的帖子的详细信息，包括帖子的长度、语言、浏览器使用情况、位置IP和创建日期，以及Hossein的浏览器使用情况、语言、性别、ID、电子邮件、创建日期、位置IP、姓氏和生日，限制返回3条记录。",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Hossein' return n2.browserused, n2.firstname, n1.length, n1.language, n1.browserused, n2.language, n2.gender, n2.id, n2.email, n2.creationdate, n1.id, r1.creationdate, n2.locationip, n2.lastname, n1.creationdate, n1.content, n2.birthday, n1.locationip limit 3"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Sorin_Hall'的节点\nlabel为organisation,属性name='Hannan_University'的节点\nlabel为tag,属性name='Saddam_Hussein'的节点\nlabel为tag,属性name='Denis_Istomin'的节点\nlabel为tag,属性name='Hans_Werner_Henze'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Hossein创建的帖子的id、长度以及Hossein的语言和性别",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Hossein' return n1.id, n1.length, n2.language, n2.gender"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Hannan_University'的节点\nlabel为organisation,属性name='Sorin_Hall'的节点\nlabel为tag,属性name='Hans_Werner_Henze'的节点\nlabel为tag,属性name='Hans_Holbein_the_Younger'的节点\nlabel为tag,属性name='Hans_Christian_Andersen'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Hossein的人创建的帖子的信息，包括人的姓氏、语言、邮箱、性别、ID、生日、位置IP、创建日期、浏览器使用情况，以及帖子的内容、图片文件、浏览器使用情况、ID、长度、语言、位置IP和创建日期。",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Hossein' return n2.lastname, n2.language, n2.email, n1.imagefile, n1.browserused, n2.gender, n2.id, n1.content, r1.creationdate, n2.birthday, n2.locationip, n2.firstname, n2.creationdate, n1.creationdate, n2.browserused, n1.id, n1.length, n1.language, n1.locationip"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Sorin_Hall'的节点\nlabel为organisation,属性name='Hannan_University'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Hossein创建的帖子的语言、内容、IP地址、id、浏览器使用情况、以及创建者Hossein的性别、创建日期、语言、id、浏览器使用情况、电子邮件、IP地址、名字、帖子的创建日期、生日和帖子的长度",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Hossein' return n1.language, n1.content, n1.locationip, n1.id, n1.browserused, n2.gender, n2.creationdate, r1.creationdate, n2.language, n2.id, n2.browserused, n2.email, n1.imagefile, n2.locationip, n2.firstname, n1.creationdate, n2.birthday, n1.length"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Hansung_University'的节点\nlabel为organisation,属性name='Hannan_University'的节点\nlabel为tag,属性name='Saddam_Hussein'的节点\nlabel为tag,属性name='Hans_Werner_Henze'的节点\nlabel为tag,属性name='Michael_Heseltine'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Hossein创建的帖子及其相关信息，包括发帖人使用的浏览器、帖子使用的浏览器、发帖人的邮箱、关系的创建日期、帖子的内容、发帖人的语言、帖子的创建日期、帖子的id、帖子的语言、发帖人的名字、发帖人的性别、发帖人的创建日期、帖子的图片文件、帖子的位置IP、发帖人的id、帖子的长度、发帖人的位置IP、发帖人的生日和发帖人的姓氏。",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Hossein' return n2.browserused, n1.browserused, n2.email, r1.creationdate, n1.content, n2.language, n1.creationdate, n1.id, n1.language, n2.firstname, n2.gender, n2.creationdate, n1.imagefile, n1.locationip, n2.id, n1.length, n2.locationip, n2.birthday, n2.lastname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Robert_Louis_Stevenson in Poznań'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Sorin_Hall'的节点\nlabel为organisation,属性name='Gheorghe_Zane_University'的节点\nlabel为tag,属性name='Hans_Holbein_the_Younger'的节点\nlabel为tag,属性name='Hans_Werner_Henze'的节点\nlabel为tag,属性name='Justine_Henin'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Hossein的人的生日、性别、电子邮件、语言，以及他创建的帖子的语言和IP地址",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Hossein' return n2.birthday, n1.language, n2.gender, n1.locationip, n2.email, n2.language, n2.firstname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为tag,属性name='Wingspan:_Hits_and_History'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Hossein创建的帖子的创建日期、创建者的邮箱、位置IP、姓氏、ID、帖子的图片文件、帖子的ID、帖子的语言、创建者使用的浏览器和帖子的位置IP，限制返回20条记录。",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Hossein' return n1.creationdate, n2.email, n2.locationip, n2.lastname, n2.id, n1.imagefile, n1.id, n1.language, n2.browserused, n1.locationip limit 20"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Sorin_Hall'的节点\nlabel为organisation,属性name='Gorseinon_College'的节点\nlabel为tag,属性name='Saddam_Hussein'的节点\nlabel为tag,属性name='Harry_Nilsson'的节点\nlabel为tag,属性name='Hans_Werner_Henze'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Hossein的人的姓氏、他创建的帖子的创建日期、帖子的位置IP、他的语言、电子邮件和位置IP",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Hossein' return n2.lastname, r1.creationdate, n1.locationip, n2.language, n2.email, n2.locationip"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Hannan_University'的节点\nlabel为organisation,属性name='Sorin_Hall'的节点\nlabel为tag,属性name='Hans_Christian_Andersen'的节点\nlabel为tag,属性name='Saddam_Hussein'的节点\nlabel为tag,属性name='Hans_Werner_Henze'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Hossein的人创建的帖子的内容、位置IP、帖子ID、创建时间，以及该人的邮箱、性别、生日、使用的浏览器和创建时间",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Hossein' return n2.email, n1.content, n1.locationip, n1.id, r1.creationdate, n2.creationdate, n2.gender, n2.birthday, n2.browserused, n1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Hannan_University'的节点\nlabel为organisation,属性name='Shoin_University'的节点\nlabel为tag,属性name='Wingspan:_Hits_and_History'的节点\nlabel为tag,属性name='Saddam_Hussein'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Hossein创建的帖子的IP地址、内容长度、内容、创建日期、浏览器使用情况以及Hossein的电子邮件、姓氏、生日、IP地址和浏览器使用情况，同时返回关系的创建日期和帖子的ID。",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Hossein' return n1.locationip, n2.email, n1.length, n1.content, n2.lastname, n2.birthday, n1.creationdate, n1.browserused, r1.creationdate, n1.id, n2.firstname, n2.locationip, n2.browserused"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Hansung_University'的节点\nlabel为organisation,属性name='Hannan_University'的节点\nlabel为tag,属性name='Hans_Werner_Henze'的节点\nlabel为tag,属性name='Saddam_Hussein'的节点\nlabel为tag,属性name='Hans_Holbein_the_Younger'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Hossein创建的帖子的详细信息，包括创建者的id、帖子长度、关系创建日期、帖子创建日期、创建者使用的语言、创建者的创建日期、帖子内容、图片文件、创建者的名字、性别、使用的浏览器、邮箱、位置IP、生日，以及帖子的位置IP、id和创建者的姓氏。",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Hossein' return n2.id, n1.length, r1.creationdate, n1.creationdate, n2.language, n2.creationdate, n1.content, n1.imagefile, n2.firstname, n2.gender, n1.browserused, n2.email, n2.locationip, n2.browserused, n2.birthday, n1.locationip, n1.id, n2.lastname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Hannan_University'的节点\nlabel为organisation,属性name='Shoin_University'的节点\nlabel为tag,属性name='Saddam_Hussein'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Hossein创建的帖子的IP地址、内容、创建时间、浏览器使用情况、图片文件、创建日期、帖子ID以及Hossein的个人信息（包括ID、姓氏、名字、邮箱）",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Hossein' return n1.locationip, n1.content, r1.creationdate, n2.id, n1.browserused, n2.lastname, n1.imagefile, n2.firstname, n1.creationdate, n2.email, n1.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Hannan_University'的节点\nlabel为organisation,属性name='Shoin_University'的节点\nlabel为tag,属性name='Saddam_Hussein'的节点\nlabel为tag,属性name='Denis_Istomin'的节点\nlabel为tag,属性name='Hoot_Gibson'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Hossein的人创建的帖子的浏览器使用情况、IP位置、创建日期、帖子长度以及该人的ID",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Hossein' return n2.browserused, n2.locationip, r1.creationdate, n1.length, n2.id"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for John_Lennon in Chaozhou'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Hannan_University'的节点\nlabel为organisation,属性name='Sorin_Hall'的节点\nlabel为tag,属性name='Wingspan:_Hits_and_History'的节点\nlabel为tag,属性name='Hans_Holbein_the_Younger'的节点\nlabel为tag,属性name='Honus_Wagner'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Hossein的人所创建的帖子的长度、他们的姓氏、位置IP、创建日期和使用的浏览器，限制返回15条记录",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Hossein' return n2.lastname, n2.locationip, n2.creationdate, n1.length, n2.browserused limit 15"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Hannan_University'的节点\nlabel为organisation,属性name='Shoin_University'的节点\nlabel为tag,属性name='Wingspan:_Hits_and_History'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Hossein创建的帖子的IP地址、创建日期、长度、浏览器使用情况，以及Hossein的姓名、性别、语言、浏览器使用情况、创建日期、IP地址和电子邮件",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Hossein' return n1.locationip, n2.firstname, r1.creationdate, n2.gender, n2.language, n1.creationdate, n2.browserused, n1.length, n1.browserused, n2.creationdate, n2.locationip, n2.email"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Sorin_Hall'的节点\nlabel为organisation,属性name='Hannan_University'的节点\nlabel为tag,属性name='Wingspan:_Hits_and_History'的节点\nlabel为tag,属性name='Justine_Henin'的节点\nlabel为tag,属性name='Hans_Holbein_the_Younger'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由名为Hossein的人创建的帖子的IP地址、创建日期、长度、内容以及该人的语言、姓氏、性别和图像文件，限制返回16条记录",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Hossein' return n1.locationip, n1.creationdate, n2.language, n2.lastname, n1.length, n2.gender, n1.imagefile, n1.content limit 16"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Hannan_University'的节点\nlabel为organisation,属性name='Huron_University_College'的节点\nlabel为tag,属性name='Hans_Holbein_the_Younger'的节点\nlabel为tag,属性name='Saddam_Hussein'的节点\nlabel为tag,属性name='Henry_Hobson_Richardson'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由名为Hossein的人创建的帖子的相关信息，包括帖子的长度、内容、id、使用的浏览器、语言、创建日期、图片文件、位置IP，以及创建者的姓氏、使用的浏览器、创建日期、位置IP，关系的创建日期，限制返回8条结果。",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Hossein' return n1.length, n2.firstname, n2.browserused, n1.content, n2.lastname, n1.id, n1.browserused, n1.language, n1.creationdate, n1.imagefile, n2.creationdate, n1.locationip, n2.locationip, r1.creationdate limit 8"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Imam_Hossein_University'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Hossein创建的帖子的创建日期、位置IP、性别、邮箱、图片文件、语言、浏览器使用情况、帖子ID、关系创建日期以及Hossein的位置IP",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Hossein' return n1.creationdate, n2.firstname, n1.locationip, n2.gender, n2.email, n1.imagefile, n2.language, n2.browserused, n1.id, r1.creationdate, n2.locationip"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Hannan_University'的节点\nlabel为tag,属性name='Saddam_Hussein'的节点\nlabel为tag,属性name='Profiles'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Hossein创建的帖子的浏览器使用情况、创建日期、帖子ID、创建者的创建日期、帖子长度、创建者的性别和名字",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Hossein' return n1.browserused, n1.creationdate, n1.id, n2.creationdate, n1.length, n2.gender, n2.firstname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Sorin_Hall'的节点\nlabel为organisation,属性name='Imam_Hossein_University'的节点\nlabel为organisation,属性name='Hesser_College'的节点\nlabel为person,属性firstname='Hans'的节点\nlabel为person,属性firstname='Hans'的节点\nlabel为person,属性firstname='Hans'的节点\nlabel为tag,属性name='Henry_Hobson_Richardson'的节点\nlabel为tag,属性name='Hermann_Hesse'的节点\nlabel为tag,属性name='Christiaan_Huygens'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Hossein的人的姓氏",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Hossein' return n2.lastname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Adam_Mickiewicz_University_in_Poznań'的节点\nlabel为organisation,属性name='Wrocław_University_of_Technology'的节点\nlabel为organisation,属性name='Warsaw_University_of_Life_Sciences'的节点\nlabel为tag,属性name='Daniel_Vacek'的节点\nlabel为tag,属性name='David_Škoch'的节点\nlabel为tag,属性name='Zakk_Wylde'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由Wojciech创建的帖子的相关信息，包括帖子的长度、内容、图片文件、创建日期、浏览器使用情况、ID，以及创建者的语言、电子邮件、性别、位置IP、创建日期、生日、姓氏、名字、浏览器使用情况和ID。",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Wojciech' return n2.language, n1.length, n2.email, n1.id, n2.gender, n1.imagefile, n1.creationdate, n2.locationip, n2.creationdate, n1.content, n2.lastname, n1.locationip, n2.firstname, n2.browserused, n2.id, n2.birthday, n1.browserused, r1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for James_K._Polk in Valdivia'的节点\nlabel为forum,属性title='Group for Friedrich_Nietzsche in Poznań'的节点\nlabel为forum,属性title='Group for William_Shakespeare in Vitebsk'的节点\nlabel为organisation,属性name='Adam_Mickiewicz_University_in_Poznań'的节点\nlabel为organisation,属性name='Cardinal_Stefan_Wyszyński_University_in_Warsaw'的节点\nlabel为organisation,属性name='Zaoksky_Adventist_University'的节点\nlabel为place,属性name='Ivanovo_Oblast'的节点\nlabel为tag,属性name='Daniel_Vacek'的节点\nlabel为tag,属性name='Andrzej_Wajda'的节点\nlabel为tag,属性name='Ivan_Ljubičić'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由名为Wojciech的人创建的帖子的创建者的位置IP和性别，最多返回9条记录",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Wojciech' return n2.locationip, n2.gender limit 9"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Mohammad_Ali_Jinnah_University'的节点\nlabel为organisation,属性name='Al-Ahliyya_Amman_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\nlabel为tag,属性name='Hyder_Ali'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由名为Ali的人创建的帖子的浏览器使用情况、创建日期、语言、图片文件、ID、长度、位置IP以及该人的浏览器使用情况、电子邮件、位置IP、创建日期、姓氏、名字、生日和语言，同时返回关系的创建日期。",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Ali' return n1.browserused, n1.creationdate, n2.browserused, n1.language, n2.email, n2.locationip, n2.creationdate, n2.lastname, n2.firstname, n2.birthday, n1.imagefile, n1.id, n1.length, n1.locationip, n2.language, r1.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为organisation,属性name='Mohammad_Ali_Jinnah_University'的节点\nlabel为organisation,属性name='Azim_Premji_University'的节点\nlabel为organisation,属性name='Al-Ahliyya_Amman_University'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为tag,属性name='Hyder_Ali'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\nlabel为tag,属性name='Muhammad_Ali'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由名为Ali的人创建的帖子所使用的浏览器、创建日期和图片文件",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Ali' return n1.browserused, n2.creationdate, n1.imagefile"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Mohammad_Ali_Jinnah_University'的节点\nlabel为organisation,属性name='Al-Ahliyya_Amman_University'的节点\nlabel为organisation,属性name='Syed_Jamaluddin_Afghan_University'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\nlabel为tag,属性name='Muhammad_Ali'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由名为Ali的人创建的帖子的id、语言、位置IP、创建日期、内容、长度、图片文件、浏览器使用情况，以及该人的名字、姓氏、创建日期、位置IP、浏览器使用情况、性别、id、生日、语言和邮箱，同时返回关系的创建日期。",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Ali' return n1.id, n2.firstname, n1.language, n1.locationip, n2.creationdate, n2.lastname, n1.browserused, n2.locationip, n2.browserused, n2.gender, n2.id, n1.length, n1.imagefile, n2.birthday, r1.creationdate, n2.language, n2.email, n1.creationdate, n1.content"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为forum,属性title='Album 1 of Ali Achiou'的节点\nlabel为organisation,属性name='Azim_Premji_University'的节点\nlabel为organisation,属性name='Aliah_University'的节点\nlabel为organisation,属性name='New_Alipore_College'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为tag,属性name='Muhammad_Ali'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\nlabel为tag,属性name='Ilham_Aliyev'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Ali的人的名（firstname）",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Ali' return n2.firstname"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Muhammad_Ali in Moscow'的节点\nlabel为organisation,属性name='Mohammad_Ali_Jinnah_University'的节点\nlabel为organisation,属性name='Aliah_University'的节点\nlabel为organisation,属性name='Al-Ahliyya_Amman_University'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为person,属性firstname='Ali'的节点\nlabel为place,属性name='Ahmedpur_Sial'的节点\nlabel为place,属性name='Shah_Alam'的节点\nlabel为tag,属性name='Abdullah_Ahmad_Badawi'的节点\nlabel为tag,属性name='Hyder_Ali'的节点\nlabel为tag,属性name='Asif_Ali_Zardari'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找名为Ali的人创建的帖子的相关信息，包括该人的邮箱、位置IP、名字，帖子的长度、创建日期、使用的浏览器、位置IP，以及该人的语言、使用的浏览器、生日、性别和创建日期",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Ali' return n2.email, n2.locationip, n2.firstname, n1.length, r1.creationdate, n1.browserused, n1.locationip, n2.language, n2.browserused, n2.birthday, n2.gender, n2.creationdate"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为forum,属性title='Group for Rafael_Nadal in Visonta'的节点\nlabel为organisation,属性name='Jorge_Amado_University_Center'的节点\nlabel为organisation,属性name='Arellano_University'的节点\nlabel为organisation,属性name='Arellano_University'的节点\nlabel为place,属性name='Antón_Lizardo'的节点\nlabel为place,属性name='João_Monlevade'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为tag,属性name='Giovanni_Pierluigi_da_Palestrina'的节点\nlabel为tag,属性name='Dario_Argento'的节点\nlabel为tag,属性name='Juan_Ignacio_Chela'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找Alejandro创建的帖子的内容、语言以及Alejandro的姓氏、语言和id，最多返回11条结果",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Alejandro' return n2.language, n1.content, n2.lastname, n1.language, n2.id limit 11"
    },
    {
        "instruction": "已知数据库中存在以下数据信息:\nlabel为organisation,属性name='Jorge_Amado_University_Center'的节点\nlabel为organisation,属性name='Sergio_Arboleda_University'的节点\nlabel为organisation,属性name='Arellano_University'的节点\nlabel为place,属性name='Antón_Lizardo'的节点\nlabel为place,属性name='Ciego_de_Ávila'的节点\nlabel为place,属性name='João_Monlevade'的节点\nlabel为tag,属性name='Andrea_Palladio'的节点\nlabel为tag,属性name='Giovanni_Pierluigi_da_Palestrina'的节点\nlabel为tag,属性name='Dario_Argento'的节点\n\n请将以下自然语言翻译为对该数据库的Cypher查询:\n查找由名为Alejandro的人创建的帖子的信息，包括创建者的电子邮件、位置IP、帖子的创建日期、浏览器使用情况、关系的创建日期、帖子的图片文件、创建者的性别、生日、帖子的内容、创建者的姓氏、帖子的位置IP、帖子的ID、创建者的创建日期、创建者的ID、创建者的语言和名字。",
        "output": "match (n1:post)-[r1:hascreatorpost]->(n2:person)  where n2.firstname='Alejandro' return n2.email, n2.locationip, n1.creationdate, n1.browserused, r1.creationdate, n1.imagefile, n2.gender, n2.birthday, n1.content, n2.lastname, n1.locationip, n1.id, n2.creationdate, n2.id, n2.language, n2.firstname"
    }
]